{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": [
        {
          "id": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.1",
          "author": null,
          "description": "Fixed: Unexpected nested element in author field crashes the parser\nThank you @ad-m",
          "link": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.1",
          "publishedOn": "2021-09-16T06:39:32.000Z",
          "wordCount": 343,
          "title": "v1.11.1"
        }
      ]
    },
    {
      "title": "GitLab",
      "feedUrl": "https://about.gitlab.com/atom.xml",
      "siteUrl": "https://about.gitlab.com/blog/",
      "articles": [
        {
          "id": "https://about.gitlab.com/releases/2021/09/17/gitlab-14-2-4-released/",
          "author": null,
          "description": "Today we are releasing version 14.2.4 for GitLab Community Edition and Enterprise Edition.\nThis version resolves a number of regressions and bugs in\nlast month's 14.2 release and\nprior versions.\nGitLab Community Edition and Enterprise Edition\nAvailable in GitLab Free, Premium, and Ultimate:\nRemoves cleanup job from Terraform.latest\nRun AWS Release rake task only if on latest stable tag\nFix Elastic::MigrationWorker current_migration\nDerive virtual storage's filesystem id from its name\nImportant notes on upgrading\nThis version does not include any new migrations, and for multi-node deployments, should not require any downtime.\nPlease be aware that by default the Omnibus packages will stop, run migrations,\nand start again, no matter how “big” or “small” the upgrade is. This behavior\ncan be changed by adding a /etc/gitlab/skip-auto-reconfigure file,\nwhich is only used for updates.\nUpdating\nTo update, check out our update page.\nGitLab subscriptions\nAccess to GitLab Premium and Ultimate features is granted by a paid subscription.\nAlternatively, sign up for GitLab.com\nto use GitLab's own infrastructure.",
          "link": "https://about.gitlab.com/releases/2021/09/17/gitlab-14-2-4-released/",
          "publishedOn": "2021-09-17T00:00:00.000Z",
          "wordCount": 1015,
          "title": "GitLab Patch Release: 14.2.4"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/09/15/qpage-on-the-devops-platform/",
          "author": null,
          "description": "Deployment automation is essential for any company involved in software development to stay competitive. QPage, a company that provides an end-to-end sourcing and recruitment solution for SMEs, realized it quickly and migrated to GitLab’s DevOps Platform to accelerate their deployment process.\nWe spoke with Pouya Lotfi, the co-founder of QPage, to see how they use GitLab at QPage and how it has helped the company.\nWhy GitLab?\nQPage was initially using a local bespoke CI/CD for about the first two months, but they soon realized they needed a more professional DevOps Platform system. Because Pouya and the team at QPage had already used GitLab at a previous employer, they knew it would be the right fit. So, they didn’t consider other options and opted for GitLab straight away.\nEverything you …",
          "link": "https://about.gitlab.com/blog/2021/09/15/qpage-on-the-devops-platform/",
          "publishedOn": "2021-09-15T00:00:00.000Z",
          "wordCount": 2253,
          "title": "How QPage achieved automatic deployment and efficiency using the GitLab DevOps Platform"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/09/14/gitlab-together-with-terratag-open-source-to-help-you-manage-terraform-resources/",
          "author": null,
          "description": "When using infrastructure as code (IaC) on a public cloud provider, it's important to use tags and labels to organize your IaC using their complementary services. Terratag, an open source project developed by env0, can be used with Terraform and placed on top of the GitLab CI/CD platform, making tagging and labeling IaC easier and more efficient.\nGitLab and Terraform make it easy to tag and label infrastructure as code.\nInside your toolbox\nGitLab the industry's leading DevOps platform. Not long ago, we announced the ability to control Terraform deployments, remote state management, private module registry, and merge request integration for Terraform. This gives users a range of solutions for running CI/CD for Terraform code and managing it on a large scale.\nTerraform is the most widely ado…",
          "link": "https://about.gitlab.com/blog/2021/09/14/gitlab-together-with-terratag-open-source-to-help-you-manage-terraform-resources/",
          "publishedOn": "2021-09-14T00:00:00.000Z",
          "wordCount": 3836,
          "title": "How to use Terratag to automatically manage tags and labels for your Terraform Code"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/09/13/lessons-weet-learned-lokalise/",
          "author": null,
          "description": "As a GitLab customer, Weet has fully invested in the premise of \"Iterate faster, innovate together.\" Weet has a low tolerance for processes that don't keep pace with the way they develop and launch. One important process that was slowing the business down – localizing their app.\nLocalization is a key way to drive growth and accelerate product adoption. When done poorly, localization or l10n, as it's commonly known, can slow down your development process, introduce bugs, and make it cumbersome to launch updates. When done right, teams can smooth out the process and continuously localize their app. We unpack how Weet conquered its localization problems using GitLab and Lokalise.\nWhat is Weet?\nWeet is an asynchronous video communication tool designed to reduce the need for meetings. By combin…",
          "link": "https://about.gitlab.com/blog/2021/09/13/lessons-weet-learned-lokalise/",
          "publishedOn": "2021-09-13T00:00:00.000Z",
          "wordCount": 2868,
          "title": "How Weet integrates localization into the GitLab pipeline with Lokalise"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/09/10/setting-up-the-k-agent/",
          "author": null,
          "description": "The GitLab Kubernetes Agent (agentk) is an active in-cluster component for solving GitLab and Kubernetes integration tasks in a secure and cloud native way. The agentk communicates to the GitLab Kubernetes Agent Server (kas) to perform GitOps operations.\nIn many examples, we see the agent being deployed with global-level permissions on your cluster. There are use cases where we want to reduce the scope of what agentk has access to. In this guide I will provide information on deploying agentk on your cluster, limiting what namespaces it can access, as well as using it to deploy your applications.\nPrefer a video? Watch the walkthrough below to learn how to deploy agentk to your cluster:\n\n\nHow it works\nAnytime a developer performs changes to a manifest file managed within GitLab, the agentk w…",
          "link": "https://about.gitlab.com/blog/2021/09/10/setting-up-the-k-agent/",
          "publishedOn": "2021-09-10T00:00:00.000Z",
          "wordCount": 4016,
          "title": "How to deploy the GitLab Kubernetes Agent with limited permissions"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/09/10/adopt-agile-and-devops-for-ibm-z/",
          "author": null,
          "description": "As more organizations adopt open source software, DevOps and cloud computing, teams are moving towards a hybrid approach to application development and deployments. This is a particular challenge for siloed mainframe development teams that typically work within their own development tools – and those tools are are not the same ones used by their distributed developer counterparts. These disparate toolsets are not integrated between build, package, test, and deploy steps. GitLab aims to provide a unified enterprise-wide DevOps platform with enhanced support for IBM z/OS® applications. Here are three critical areas to focus on that can help bridge the gap between mainframe and \"modern\" DevOps development.\nCommon workflows for hybrid environments\nDevOps is naturally aligned to Agile processes…",
          "link": "https://about.gitlab.com/blog/2021/09/10/adopt-agile-and-devops-for-ibm-z/",
          "publishedOn": "2021-09-10T00:00:00.000Z",
          "wordCount": 2352,
          "title": "The benefits of DevOps practices for IBM Z"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/09/09/5-code-review-features/",
          "author": null,
          "description": "This is the second in a series of blog posts looking at the challenges of code review and the ways a DevOps platform can help. Read the first post.\nCode review can be one of the most deceivingly difficult things in delivering software faster. Given the high stakes involved, we've made some key additions to our DevOps Platform that focus on making the code review process as seamless and effective as possible. We believe the number one way to make code reviews effective is to provide context. Too often we think of code reviews as only \"reading\" and commenting on others' code - but what a good code reviewer does is understand the entire context of the proposed change. Context-driven code reviews should include factors like the issue that spurred on the change, how the change impacts non-obvio…",
          "link": "https://about.gitlab.com/blog/2021/09/09/5-code-review-features/",
          "publishedOn": "2021-09-09T00:00:00.000Z",
          "wordCount": 2692,
          "title": "How GitLab's 5 new code review features will make life easier"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/09/08/making-the-case-for-a-devops-platform-what-data-and-customers-say/",
          "author": null,
          "description": "In the struggle to release safer software faster, development teams are increasingly choosing a DevOps platform to help them get there. In our 2021 Global DevSecOps Survey we asked respondents what their DevOps practices included and a \"DevOps platform\" was among the top four choices, right next to CI/CD, test automation, and DevSecOps.\nWe're of course bullish on the idea of a DevOps platform, but we're far from alone. Here's a fresh look at how the data – and the customers – support the optimistic trajectory of a DevOps platform.\nDevOps is hot\nThe DevOps market was worth $6 billion in 2020, according to Global Industry Analysts, and five-year growth forecasts range from $17 billion to as much as $23 billion, depending on the firm. \n[Watch a deep dive into GitLab's DevOps Platform]\nThis pr…",
          "link": "https://about.gitlab.com/blog/2021/09/08/making-the-case-for-a-devops-platform-what-data-and-customers-say/",
          "publishedOn": "2021-09-08T00:00:00.000Z",
          "wordCount": 2123,
          "title": "Making the case for a DevOps platform: What data and customers say"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/09/08/write-vulnerability-detection-rules/",
          "author": null,
          "description": "In summer 2021, the Vulnerability Research and Static Analysis\nteams launched the Google Summer of Code (GSoC) project: Write vulnerability detection rules for SAST.\nFor this project, we built and implemented a framework to helps transition GitLab away from our current SAST tools over to Semgrep. Semgrep is a language-agnostic SAST tool that is gaining popularity in CI/CD environments.\nBefore replacing an analyzer with the corresponding Semgrep configuration (called rule-sets), we need to ensure that they are equivalent – in that they yield the same set of findings.\nFor this purpose, we built a testing framework that helps us assess the quality of a Semgrep rule-set. This framework has been used to guide the replacement of flawfinder, a C/C++ analyzer with a corresponding Semgrep rule-set.…",
          "link": "https://about.gitlab.com/blog/2021/09/08/write-vulnerability-detection-rules/",
          "publishedOn": "2021-09-08T00:00:00.000Z",
          "wordCount": 5402,
          "title": "How to write and continuously test vulnerability detection rules for SAST"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/09/07/why-are-developers-vulnerable-to-driveby-attacks/",
          "author": null,
          "description": "As someone who spends a lot of time working with computers, I know how easy it is to grow over-confident with regards to security. My systems are patched, my firewall rules are tight, and I’m vigilant when it comes to just about anything that looks out of the ordinary.\nNo one’s hacking their way into my workstation, that’s for sure.\nBut my experience working as a hacker myself has shown me that the opposite is often true. Those of us who are more technical are often much more vulnerable to an attack due to the complexity of our working environments.\nIn this blog, we’re going to dive into the anatomy of something called a “drive-by attack,” where malicious code hidden within a website uses your own browser to attack your computer.\nAs an example, I’ll show you how our own Red Team was able t…",
          "link": "https://about.gitlab.com/blog/2021/09/07/why-are-developers-vulnerable-to-driveby-attacks/",
          "publishedOn": "2021-09-07T00:00:00.000Z",
          "wordCount": 6130,
          "title": "Why are developers so vulnerable to drive-by attacks?"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/09/03/the-code-review-struggle-is-real-heres-what-you-need-to-know/",
          "author": null,
          "description": "When making a list of the reasons to consider moving to a DevOps Platform, don't forget about code review, a critical piece of the process that's also an incredible source of frustration and delays to developers and their teams.\nIn our 2021 Global DevSecOps Survey, respondents told us code quality was the number one reason they chose DevOps. But, when asked what was most likely to delay a product release, code review – vital to code quality – was one of the top four culprits (the others were testing, planning and code development). \nThe fact that code review is a pain point is hardly surprising, given that it can often require context-switching, communication, collaboration, and of course subject matter expertise. At a time when it's never been more urgent to release secure code as quickly…",
          "link": "https://about.gitlab.com/blog/2021/09/03/the-code-review-struggle-is-real-heres-what-you-need-to-know/",
          "publishedOn": "2021-09-03T00:00:00.000Z",
          "wordCount": 2301,
          "title": "The code review struggle is real. Here's what you need to know"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/09/02/the-journey-to-a-devops-platform/",
          "author": null,
          "description": "In a recent blog post about the importance of a DevOps Platform, GitLab CEO Sid Sijbrandij outlined four phases through which organizations frequently travel as their practice matures. It’s a painful journey we see again and again when we meet new customers. It spans every industry and every company size, and it’s the most mature DevOps teams with the most at stake who’ve felt the most pain. \nHistorically, if you wanted DevOps to work, you had to be prepared to pay for it. Just managing the backbone of DevOps – the toolchain -– has been a grind. Your “Jenkins Team,” your “GitHub Team,” or even, as one of our customers described, your “Duct Tape Team” (designed to hold it all together and patch holes), added no end value beyond keeping everything from falling apart. That’s a lot of investme…",
          "link": "https://about.gitlab.com/blog/2021/09/02/the-journey-to-a-devops-platform/",
          "publishedOn": "2021-09-02T00:00:00.000Z",
          "wordCount": 2124,
          "title": "The journey to a DevOps Platform"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/09/02/specialized-sidekiq-configuration-lessons-from-gitlab-dot-com/",
          "author": null,
          "description": "Sidekiq in GitLab works perfectly well out-of-the-box in most use cases, but it requires a little more attention in larger deployments or other specialized cases. We've learned a lot about how to configure Sidekiq in large deployments by maintaining GitLab.com – one of the largest instances of GitLab in existence. We added some critical features to GitLab.com in the past year to make it easier to configure Sidekiq in a manner more consistent with the maintainer's guidance, having strayed from this path for some time.\nWe are publishing two blog posts devoted to this topic. In this first post, we will unpack how we configured Sidekiq for GitLab.com, and in our second post, we will explain how to apply this to your GitLab instance.\n[Learn more about how we iterated on Sidekiq background jobs]…",
          "link": "https://about.gitlab.com/blog/2021/09/02/specialized-sidekiq-configuration-lessons-from-gitlab-dot-com/",
          "publishedOn": "2021-09-02T00:00:00.000Z",
          "wordCount": 5329,
          "title": "What we learned about configuring Sidekiq from GitLab.com"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/09/02/gitlab-13-12-11-released/",
          "author": null,
          "description": "Today we are releasing version 13.12.11 for GitLab Community Edition and Enterprise Edition.\nThis version resolves a number of regressions and bugs in\nthe 13.12 release and\nprior versions.\nGitLab Community Edition and Enterprise Edition\nThe main purpose of this release is to resolve high CPU usage by the Gitaly\nserver:\nOnly activate Git pack-objects hook if cache is enabled\nBackport improved replication logic\nImportant notes on upgrading\nThis version does not include any new migrations, and for multi-node deployments, should not require any downtime.\nPlease be aware that by default the Omnibus packages will stop, run migrations,\nand start again, no matter how “big” or “small” the upgrade is. This behavior\ncan be changed by adding a /etc/gitlab/skip-auto-reconfigure file,\nwhich is only used for updates.\nUpdating\nTo update, check out our update page.\nGitLab subscriptions\nAccess to GitLab Premium and Ultimate features is granted by a paid subscription.\nAlternatively, sign up for GitLab.com\nto use GitLab's own infrastructure.",
          "link": "https://about.gitlab.com/releases/2021/09/02/gitlab-13-12-11-released/",
          "publishedOn": "2021-09-02T00:00:00.000Z",
          "wordCount": 1013,
          "title": "GitLab Patch Release: 13.12.11"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/09/02/gitlab-14-0-10-released/",
          "author": null,
          "description": "Today we are releasing versions 14.0.10 and 14.1.5 for GitLab Community Edition and Enterprise Edition.\nThese versions resolve a number of regressions and bugs in the\n14.0 and\n14.1 releases.\nGitLab Community Edition and Enterprise Edition\nThe main purpose of these two releases is to resolve high CPU usage by the\nGitaly server:\nOnly activate Git pack-objects hook if cache is enabled\nBackport improved replication logic\nAdditionally, 14.1.5 includes the following fixes:\nGeo: Replicate multi-arch containers\nRun AWS Release rake task only if on latest stable tag\nImportant notes on upgrading\nThese versions do not include any new migrations, and for multi-node deployments, should not require any downtime.\nPlease be aware that by default the Omnibus packages will stop, run migrations,\nand start again, no matter how “big” or “small” the upgrade is. This behavior\ncan be changed by adding a /etc/gitlab/skip-auto-reconfigure file,\nwhich is only used for updates.\nUpdating\nTo update, check out our update page.\nGitLab subscriptions\nAccess to GitLab Premium and Ultimate features is granted by a paid subscription.\nAlternatively, sign up for GitLab.com\nto use GitLab's own infrastructure.",
          "link": "https://about.gitlab.com/releases/2021/09/02/gitlab-14-0-10-released/",
          "publishedOn": "2021-09-02T00:00:00.000Z",
          "wordCount": 1040,
          "title": "GitLab Patch Release: 14.0.10 and 14.1.5"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/09/01/gsoc-at-gitlab/",
          "author": null,
          "description": "GitLab participated in Google Summer of Code for the first time this year. We hosted four student interns to work with us on four different projects under the supervision of two or three mentors each.\nFor the past 16 years, Google has hosted the Summer of Code to introduce students to the world of open source. Over the summer, student interns work on a project with an open source organization and are closely mentored by the developers of the open source project. More than 200 organizations participated this year.\nWe started off the summer with a two-week long community bonding period to get our students familiar with how we work at GitLab and helped them set-up their local development environments. During the 10-week program we worked through scoped projects with regular check-ins and a fi…",
          "link": "https://about.gitlab.com/blog/2021/09/01/gsoc-at-gitlab/",
          "publishedOn": "2021-09-01T00:00:00.000Z",
          "wordCount": 2696,
          "title": "Google Summer of Code at GitLab – some intern highlights"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/09/01/gitlab-14-2-3-released/",
          "author": null,
          "description": "Today we are releasing version 14.2.3 for GitLab Community Edition and Enterprise Edition.\nThis version resolves a number of regressions and bugs in\nlast month's 14.2 release and\nprior versions.\nGitLab Community Edition and Enterprise Edition\nAvailable in GitLab Free, Premium, and Ultimate:\nGeo: Replicate multi-arch containers\nReset severity_levels default\nCreate 14.2 In-app top 7 product highlights\nFix OrphanedInviteTokensCleanup migration\nFix Live Markdown Preview in personal and subgroup projects\nDowngrade grpc from 1.38.0 to 1.30.2 for compatibility with older CPUs\nRestore proper contents to toolbox ubi8 image\nOnly activate Git pack-objects hook if cache is enabled\nImportant notes on upgrading\nThis version does include post deploy db migrations. For multi-node deployments, it should not require any downtime.\nPlease be aware that by default the Omnibus packages will stop, run migrations,\nand start again, no matter how “big” or “small” the upgrade is. This behavior\ncan be changed by adding a /etc/gitlab/skip-auto-reconfigure file,\nwhich is only used for updates.\nUpdating\nTo update, check out our update page.\nGitLab subscriptions\nAccess to GitLab Premium and Ultimate features is granted by a paid subscription.\nAlternatively, sign up for GitLab.com\nto use GitLab's own infrastructure.",
          "link": "https://about.gitlab.com/releases/2021/09/01/gitlab-14-2-3-released/",
          "publishedOn": "2021-09-01T00:00:00.000Z",
          "wordCount": 1048,
          "title": "GitLab Patch Release: 14.2.3"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/08/31/security-release-gitlab-14-2-2-released/",
          "author": null,
          "description": "Today we are releasing versions 14.2.2, 14.1.4, and 14.0.9 for GitLab Community Edition (CE) and Enterprise Edition (EE).\nThese versions contain important security fixes, and we strongly recommend that all GitLab installations be upgraded to one of these versions immediately.\nGitLab releases patches for vulnerabilities in dedicated security releases. There are two types of security releases: a monthly, scheduled security release, released a week after the feature release (which deploys on the 22nd of each month), and ad-hoc security releases for critical vulnerabilities. For more information, you can visit our security FAQ. You can see all of our regular and security release blog posts here. In addition, the issues detailing each vulnerability are made public on our issue tracker 30 days a…",
          "link": "https://about.gitlab.com/releases/2021/08/31/security-release-gitlab-14-2-2-released/",
          "publishedOn": "2021-08-31T00:00:00.000Z",
          "wordCount": 2081,
          "title": "GitLab Security Release: 14.2.2, 14.1.4, and 14.0.9"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/08/30/secure-pipeline-with-single-sign-in/",
          "author": null,
          "description": "If there is one thing that recent cyberattacks at companies such as SolarWinds, Codecov, and Kaseya have taught us, it's that software build pipelines are being targeted for attacks more than ever before. Hackers are no longer just attacking the bits and bytes of source code that go into our products, but also the development, testing, and build infrastructure tools that are used to build these products.\nEven if you believe your company is at low risk of an attack, it's also important to think about your customers. Businesses with high profile customers – like government agencies or large, multinational corporations that use your products – might have attackers target them by hacking your company, or more specifically, the software you provide them.\nThe incidents at Solarwinds, Codecov, an…",
          "link": "https://about.gitlab.com/blog/2021/08/30/secure-pipeline-with-single-sign-in/",
          "publishedOn": "2021-08-30T00:00:00.000Z",
          "wordCount": 2794,
          "title": "How to secure your software build pipeline using code signing"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/08/26/its-time-to-upgrade-docker-engine/",
          "author": null,
          "description": "Alpine Linux distribution is the base OS used by many Linux container images. It provides a handy packaging mechanism, new versions of software, and a quick and predictable release cycle – all while being distributed using a minimal image size. It's used by many very popular container images, for example docker:dind,\nwidely used in GitLab CI/CD workloads handling container\nimages building and management in the jobs.\nOn June 15, 2021, Alpine Linux released version 3.14. As documented in the release notes, changes in the musl library require\nan updated version of runc or updated version of\nDocker for the Alpine 3.14-based images to work properly.\nSoftware products across the computer industry have started migrating their Alpine Linux-based container images to 3.14 since it includes significa…",
          "link": "https://about.gitlab.com/blog/2021/08/26/its-time-to-upgrade-docker-engine/",
          "publishedOn": "2021-08-26T00:00:00.000Z",
          "wordCount": 2613,
          "title": "It's time to update Docker Engine"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/08/26/gitlab-14-0-8-released/",
          "author": null,
          "description": "Today we are releasing version 14.0.8 for GitLab Community Edition and Enterprise Edition.\nThis version resolves a number of regressions and bugs in\nthe 14.0 release and\nprior versions.\nGitLab Community Edition and Enterprise Edition\nRevert backfill on ci_build_trace_sections\nResolve \"operator does not exist: integer[] || bigint in app/models/namespace/traversal_hierarchy.rb\"\nFix Sidekiq workers delete each other's metrics\nGeo 2.0 Regression - Add ability to remove primary\nBackport fix for flaky spec to 14.0\nImportant notes on upgrading\nThis version includes a post deploy migration. For multi-node deployments, it should not require any downtime.\nPlease be aware that by default the Omnibus packages will stop, run migrations,\nand start again, no matter how “big” or “small” the upgrade is. This behavior\ncan be changed by adding a /etc/gitlab/skip-auto-reconfigure file,\nwhich is only used for updates.\nUpdating\nTo update, check out our update page.\nGitLab subscriptions\nAccess to GitLab Premium and Ultimate features is granted by a paid subscription.\nAlternatively, sign up for GitLab.com\nto use GitLab's own infrastructure.",
          "link": "https://about.gitlab.com/releases/2021/08/26/gitlab-14-0-8-released/",
          "publishedOn": "2021-08-26T00:00:00.000Z",
          "wordCount": 1023,
          "title": "GitLab Patch Release: 14.0.8"
        }
      ]
    },
    {
      "title": "Phoronix",
      "feedUrl": "https://www.phoronix.com/rss.php",
      "siteUrl": "https://www.phoronix.com/",
      "articles": [
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-Less-Broken-Jensen",
          "author": null,
          "description": "One has to wonder how much longer the Linux kernel will keep around some very old and known to be borked hardware support but at least for now the DECpc AXP 150 \"Jensen\" platform support is sticking around and with Linux 5.15 is no longer marked as \"broken\" outright...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-Less-Broken-Jensen",
          "publishedOn": "2021-09-18T23:36:07.000Z",
          "wordCount": 955,
          "title": "Linux 5.15 Is Now Slightly Less Broken For The DEC Alpha \"Jensen\""
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=DRM-AI-APU-RFC",
          "author": null,
          "description": "BayLibre developer Alexandre Bailon has posted a \"request for comments\" of a new open-source Direct Rendering Manager (DRM) driver for AI Processing Unit (APU) functionality. Initially the driver is catering to Mediatek SoCs with an AI co-processor but this DRM \"APU\" driver could be adapted to other hardware too...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=DRM-AI-APU-RFC",
          "publishedOn": "2021-09-18T17:12:27.000Z",
          "wordCount": 785,
          "title": "DRM Driver Posted For AI Processing Unit - Initially Focused On Mediatek SoCs"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Apple-M1-USB-Type-C-Linux",
          "author": null,
          "description": "The latest patches sent out for review/testing on the long mission for enabling Apple M1 support on Linux is the USB Type-C connectivity...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Apple-M1-USB-Type-C-Linux",
          "publishedOn": "2021-09-18T13:05:58.000Z",
          "wordCount": 812,
          "title": "Apple M1 USB Type-C Linux Support Code Sent Out For Testing"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-P-State-XDC2021",
          "author": null,
          "description": "As reported at the start of August, AMD and Valve have been working on Linux CPU performance/frequency scaling improvements with the Steam Deck being one of the leading motivators. As speculated at that time, their work would likely revolve around use of ACPI CPPC found with Zen 2 CPUs and newer. Published last week was that AMD P-State driver for Linux systems indeed now leveraging CPPC information. AMD formally presented this new driver yesterday at XDC2021...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-P-State-XDC2021",
          "publishedOn": "2021-09-18T11:26:08.000Z",
          "wordCount": 972,
          "title": "AMD + Valve Focusing On P-State / CPPC Driver With Schedutil For Better Linux Efficiency"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=GIMP-2.10.28-Released",
          "author": null,
          "description": "There's still some time to go before seeing the long-awaited GIMP 3.0 release for this open-source image manipulation program but at least out this weekend is GIMP 2.10.28 for bettering the current stable series...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=GIMP-2.10.28-Released",
          "publishedOn": "2021-09-18T09:56:56.000Z",
          "wordCount": 714,
          "title": "GIMP 2.10.28 Released With More Fixes"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=More-Plasma-Wayland-Sep-2021",
          "author": null,
          "description": "Along with releasing Plasma 5.23 Beta this week, KDE developers have been busy on driving in a bunch of Plasma Wayland fixes and other refinements to their stack...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=More-Plasma-Wayland-Sep-2021",
          "publishedOn": "2021-09-18T09:42:36.000Z",
          "wordCount": 810,
          "title": "KDE Sees Another Big Batch Of Plasma Wayland Improvements"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Red-Hat-Hiring-For-Linux-HDR",
          "author": null,
          "description": "One of the areas where Linux has struggled on the desktop has been around HDR (high dynamic range) display support while that will hopefully be addressed in the coming months with Red Hat hiring an engineer to focus on that problem...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Red-Hat-Hiring-For-Linux-HDR",
          "publishedOn": "2021-09-17T19:15:34.000Z",
          "wordCount": 864,
          "title": "Red Hat Is Hiring So Linux Can Finally Have Good HDR Display Support"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=GCC-12-Apple-M1-Port-Plan",
          "author": null,
          "description": "Developers are hoping for next year's GCC 12 release they will have Apple AArch64 support on Darwin in place for being able to support Apple Silicon -- initially the M1 SoC -- on macOS with GCC...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=GCC-12-Apple-M1-Port-Plan",
          "publishedOn": "2021-09-17T18:41:26.000Z",
          "wordCount": 801,
          "title": "Apple Silicon / M1 Port Planned For GCC 12"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-Rust-2021-Experiment",
          "author": null,
          "description": "Longtime Mesa developer Karol Herbst who has worked extensively on the open-source NVIDIA \"Nouveau\" driver as well as the OpenCL/compute stack while being employed by Red Hat is now toying with the idea of Rust code inside Mesa...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-Rust-2021-Experiment",
          "publishedOn": "2021-09-17T17:39:50.000Z",
          "wordCount": 723,
          "title": "Experimenting Is Underway For Rust Code Within Mesa"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Ubuntu-18.04.6-LTS-Released",
          "author": null,
          "description": "The unplanned Ubuntu 18.04.6 LTS release is available today that was made on short notice for addressing unbootable media with Ubuntu 18.04.5...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Ubuntu-18.04.6-LTS-Released",
          "publishedOn": "2021-09-17T17:06:12.000Z",
          "wordCount": 755,
          "title": "Ubuntu 18.04.6 LTS Released To Correct Broken Install Media"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-DG1-Status-XDC2021",
          "author": null,
          "description": "Along with bringing up DG2/Alchemist graphics card support on Linux, Intel engineers have been working to square away their support for the DG1 developer graphics card. This week thanks to XDC2021 is a fresh status update about what is working with this initial Intel graphics card on their open-source driver and what remains in the works...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-DG1-Status-XDC2021",
          "publishedOn": "2021-09-17T13:25:11.000Z",
          "wordCount": 929,
          "title": "The Current State Of Intel Discrete Graphics On Linux: Almost \"Fully Functional\""
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Platform-Profiles-Axboe",
          "author": null,
          "description": "As covered several times going back to the end of last year, ACPI Platform Profile support has materialized in recent versions of the Linux kernel for the core infrastructure and implementations that work with the latest laptops from the likes of Dell, Lenovo, ASUS, and HP. This platform profile support is becoming increasingly important with expressing your power/cooling/performance preference so that your laptop behaves as one would expect...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Platform-Profiles-Axboe",
          "publishedOn": "2021-09-17T12:58:39.000Z",
          "wordCount": 987,
          "title": "The Increasing Importance Of ACPI Platform Profiles With Today's Throttle-Happy Hardware"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=LVFS-2-Million-Downloads",
          "author": null,
          "description": "The Linux Vendor Firmware Service (LVFS) in conjunction with FWUPD for offering easy-to-deploy firmware updates on Linux continues its meteoric rise...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=LVFS-2-Million-Downloads",
          "publishedOn": "2021-09-17T11:54:45.000Z",
          "wordCount": 807,
          "title": "LVFS Serves Up 2+ Million Firmware Downloads In The Past Month"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=KWinFT-2021-WLROOTS-Continues",
          "author": null,
          "description": "KWinFT as a fork of KDE's KWin X11/Wayland compositor code continues making progress on driving fundamental display improvements and ironing out the Wayland support...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=KWinFT-2021-WLROOTS-Continues",
          "publishedOn": "2021-09-17T09:55:47.000Z",
          "wordCount": 802,
          "title": "KWinFT Continues Working On WLROOTS Render, Library Split"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=RADV-Ray-Tracing-Multi-Games",
          "author": null,
          "description": "Not only is Intel progressing with its open-source ray-tracing driver support but the Mesa Radeon Vulkan driver \"RADV\" has been rounding out its RT code too and now has multiple games correctly rendering...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=RADV-Ray-Tracing-Multi-Games",
          "publishedOn": "2021-09-17T09:00:58.000Z",
          "wordCount": 860,
          "title": "Multiple Games Are Now Working With RADV's Ray-Tracing Code"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-PSH-ISHTP-ECLite",
          "author": null,
          "description": "It looks like Intel's ISHTP_ECLITE driver will be ready for mainlining in Linux 5.16 as a driver for newer systems skipping out on a traditional embedded control (EC) and instead using this EC-like IP as part of their Programmable Service Engine subsystem...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-PSH-ISHTP-ECLite",
          "publishedOn": "2021-09-17T04:00:00.000Z",
          "wordCount": 745,
          "title": "Intel's PSH ISHTP Driver Readied On Linux For Systems Wanting To Forego A Traditional EC"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=X.Org-Security-Help-2021",
          "author": null,
          "description": "Those reading Phoronix over the years likely know the X.Org Server has had an increasing number of vulnerabilities come to light in recent times and statements by security researchers like the security being even worse than it looks. Given the age of the X.Org/X11 codebase and many components being rather unmaintained these days, the security situation isn't that great combined with a lack of manpower. The security topic was under the spotlight today at the XDC2021 conference...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=X.Org-Security-Help-2021",
          "publishedOn": "2021-09-16T20:10:14.000Z",
          "wordCount": 870,
          "title": "X.Org Could Use More Help Improving & Addressing Its Security"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=OpenZFS-2.1.1-Released",
          "author": null,
          "description": "Following the big OpenZFS 2.1 release from July that brought Distributed SPARE RAID, a compatibility property for pools, and other new features, OpenZFS 2.1.1 is available today as a follow-up release for this open-source ZFS file-system implementation for Linux and FreeBSD systems...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=OpenZFS-2.1.1-Released",
          "publishedOn": "2021-09-16T18:17:17.000Z",
          "wordCount": 799,
          "title": "OpenZFS 2.1.1 Arrives As A Big Point Release"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-Vulkan-RT-XDC2021",
          "author": null,
          "description": "Prominent Intel open-source Vulkan Linux driver developer Jason Ekstrand presented at today's X.Org Developers Conference (XDC2021) about their work on enabling Vulkan ray-tracing support...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-Vulkan-RT-XDC2021",
          "publishedOn": "2021-09-16T17:42:58.000Z",
          "wordCount": 858,
          "title": "Intel Talks More About Their Open-Source Vulkan Ray-Tracing Bring-Up"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=KDE-Plasma-5.23-Beta",
          "author": null,
          "description": "It was in October of 1996 that the KDE desktop environment was founded and as such with marking twenty-five years since its creation, the forthcoming Plasma 5.23 is being advertised as the \"25th Anniversary Edition\" for the desktop...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=KDE-Plasma-5.23-Beta",
          "publishedOn": "2021-09-16T13:00:18.000Z",
          "wordCount": 753,
          "title": "KDE Plasma 5.23 Beta Released As The 25th Anniversary Edition"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30531",
          "author": null,
          "description": "As usual when the Linux 5.15 merge window began wrapping up, I set out to dive into its performance to see what is in store for this next version of the kernel and whether there was any regressions or other performance changes worth noting. Linux 5.15 overall has been in good shape for the \"-rc1\" state except noticing that code compilation workloads were taking longer on multiple Linux 5.15-rc1-running systems than Linux 5.14 or prior. Seeing it across multiple systems and a very real-world regression, it was worth bisecting and looking closer so here are the details.",
          "link": "https://www.phoronix.com/vr.php?view=30531",
          "publishedOn": "2021-09-16T11:00:00.000Z",
          "wordCount": 1045,
          "title": "Running Linux 5.15-rc1 Causing A New Slowdown... Here's A Look"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=First-DRM-Misc-Next-For-5.16",
          "author": null,
          "description": "With the Linux 5.15 merge window out of the way, the first drm-misc-next pull request has been sent in to DRM-Next for staging until the Linux 5.16 merge window opens up about two months from now...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=First-DRM-Misc-Next-For-5.16",
          "publishedOn": "2021-09-16T09:22:52.000Z",
          "wordCount": 885,
          "title": "Linux 5.16 To Add Quirk For The Steam Deck, Other DRM-Misc-Next Changes"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=LLVMpipe-Lavapipe-FP16",
          "author": null,
          "description": "The latest work landing for Mesa 21.3 is supporting FP16 within the LLVM-based software driver code namely for the LLVMpipe Gallium3D OpenGL and Lavapipe Vulkan drivers...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=LLVMpipe-Lavapipe-FP16",
          "publishedOn": "2021-09-16T09:00:00.000Z",
          "wordCount": 709,
          "title": "Mesa's LLVMpipe + Lavapipe Land FP16 Support"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Chromebooks-Mesa-QLCM",
          "author": null,
          "description": "It's been known that Google has been using the open-source \"MSM\" DRM/KMS driver on Qualcomm-powered devices that originally started out as a reverse-engineered driver project separate from the company. Now it's also been confirmed how Google is successfully using the open-source Mesa Freedreno OpenGL and TURNIP Vulkan drivers on Qualcomm-powered Chromebooks too...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Chromebooks-Mesa-QLCM",
          "publishedOn": "2021-09-16T07:00:00.000Z",
          "wordCount": 801,
          "title": "Google Is Successfully Using The Open-Source Qualcomm GL/VLK Drivers On Chromebooks"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-BPF-Scheduler",
          "author": null,
          "description": "The latest area where BPF is looking to expand within the Linux kernel is its CFS scheduler...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-BPF-Scheduler",
          "publishedOn": "2021-09-16T04:00:00.000Z",
          "wordCount": 903,
          "title": "Early Patches Bring BPF To The Linux Scheduler"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Microsoft-Mesa-EGL-Windows",
          "author": null,
          "description": "While Microsoft has long had WGL as an API analogous to EGL for residing between OpenGL and the Windows interfaces, Microsoft has now wired up an EGL implementation for Mesa that works on Windows...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Microsoft-Mesa-EGL-Windows",
          "publishedOn": "2021-09-15T22:14:15.000Z",
          "wordCount": 846,
          "title": "Microsoft Adds An EGL Implementation To Mesa For Windows"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Apple-AGX-XDC2021",
          "author": null,
          "description": "Alyssa Rosenzweig spoke today at the virtual X.Org Developers Conference about the ongoing work for bringing up Linux display and graphics support on the Apple M1 graphics processor...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Apple-AGX-XDC2021",
          "publishedOn": "2021-09-15T18:11:25.000Z",
          "wordCount": 868,
          "title": "Reverse Engineering, Open-Source Driver Writing Continues For Apple's M1 GPU"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Radeon-Pro-Software-21.Q3",
          "author": null,
          "description": "AMD today released their quarterly update to the Radeon Pro Software for Enterprise graphics driver package, which includes an updated Linux build as well...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Radeon-Pro-Software-21.Q3",
          "publishedOn": "2021-09-15T17:32:12.000Z",
          "wordCount": 804,
          "title": "Radeon Pro Software for Enterprise 21.Q3 Released For Linux"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=AMDGPU-Yellow-Carp-FW",
          "author": null,
          "description": "A small but important step forward is seeing AMD recently publishing their binary firmware files in advance of new GPU/APU launches for rounding out their Linux driver support stack...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=AMDGPU-Yellow-Carp-FW",
          "publishedOn": "2021-09-15T13:25:49.000Z",
          "wordCount": 1002,
          "title": "AMD Publishes Initial Firmware For Yellow Carp APUs"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=V3DV-2021-Status",
          "author": null,
          "description": "Iago Toral of Igalia kicked off the first day of the virtual XDC2021 developer conference today by sharing a status update on V3DV as the open-source Mesa Vulkan driver most notably used for Raspberry Pi 4 and newer...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=V3DV-2021-Status",
          "publishedOn": "2021-09-15T12:07:23.000Z",
          "wordCount": 864,
          "title": "Raspberry Pi V3DV Driver Still Working On Vulkan 1.1 Conformance, More Performance"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Orange-BPF-Memory-Cache-BMC",
          "author": null,
          "description": "French telecommunications giant Orange has published \"BMC\" as the (e)BPF Memory Cache providing a cache focused on memcached usage within the Linux kernel...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Orange-BPF-Memory-Cache-BMC",
          "publishedOn": "2021-09-15T10:28:19.000Z",
          "wordCount": 706,
          "title": "Orange Publishes An In-Kernel eBPF-Powered Cache - Can Speed Up Memcached By ~18x"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30523",
          "author": null,
          "description": "While NVIDIA has been supporting Resizable BAR for a while now with their GeForce RTX 30 series graphics cards, for those exclusively using Linux it remains more of a challenge due to AIB partners generally not releasing any vBIOS updates for ReBAR support that can be easily applied under Linux. But if you do carry out an update -- such as under Windows -- the performance uplift can be worthwhile if using a game that can benefit from the support.",
          "link": "https://www.phoronix.com/vr.php?view=30523",
          "publishedOn": "2021-09-14T13:09:13.000Z",
          "wordCount": 855,
          "title": "NVIDIA RTX 30 Series Resizable BAR Support Continues Helping Performance On Linux"
        }
      ]
    }
  ],
  "cliVersion": "1.11.1"
}