{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": [
        {
          "id": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.2",
          "author": null,
          "description": "Fixed: unicode characters in URL caused download error\nFixed: project root npm install error\nAdded: unit test library\nChore: Dependency updates\nThank you: @CaptNo1",
          "link": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.2",
          "publishedOn": "2021-09-26T18:45:39.000Z",
          "wordCount": 354,
          "title": "v1.11.2"
        },
        {
          "id": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.1",
          "author": null,
          "description": "Fixed: Unexpected nested element in author field crashes the parser\nThank you @ad-m",
          "link": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.1",
          "publishedOn": "2021-09-16T06:39:32.000Z",
          "wordCount": 344,
          "title": "v1.11.1"
        }
      ]
    },
    {
      "title": "GitLab",
      "feedUrl": "https://about.gitlab.com/atom.xml",
      "siteUrl": "https://about.gitlab.com/blog/",
      "articles": [
        {
          "id": "https://about.gitlab.com/blog/2021/10/01/join-us-for-hacktoberfest-2021/",
          "author": null,
          "description": "It’s October 2021, and we have quite a few treats in store. In addition to celebrating the 10th anniversary of the GitLab open source project, GitLab Inc. will be participating in Hacktoberfest, an event dedicated to increasing contributions to open source projects that's now in its eighth year. This has been widely requested by the open source community for years, so we’re thrilled to see GitLab support rolled out!\nThanks to DigitalOcean, the organization behind Hacktoberfest, people can now contribute to open source projects that are hosted on GitLab.com.\nIt’s easy, sign up on the Hacktoberfest website using your GitLab account and explore the available projects to contribute.\nProject maintainers who want their projects to participate in Hacktoberfest should follow the steps described on…",
          "link": "https://about.gitlab.com/blog/2021/10/01/join-us-for-hacktoberfest-2021/",
          "publishedOn": "2021-10-01T00:00:00.000Z",
          "wordCount": 1469,
          "title": "Join us for Hacktoberfest 2021!"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/10/01/gitlab-14-3-2-released/",
          "author": null,
          "description": "Today we are releasing version 14.3.2 GitLab Community Edition and Enterprise Edition.\nThis version resolves a number of regressions and bugs in\nthe 14.3 release and\nprior versions.\nGitLab Community Edition and Enterprise Edition\nAdd OR REPLACE when creating function\nTop 7 Highlight items for 14.3\nUpdate GitLab Shell to v13.21.1\nRemove feature flag check for candece finder\nRemove unexpected FK prior to swapping columns\nAllow ee images to be skipped on CE pipelines\nBump kas to v14.3.3\nImportant notes on upgrading\nThese versions do not include any new migrations, and for multi-node deployments, should not require any downtime.\nPlease be aware that by default the Omnibus packages will stop, run migrations,\nand start again, no matter how “big” or “small” the upgrade is. This behavior\ncan be changed by adding a /etc/gitlab/skip-auto-reconfigure file,\nwhich is only used for updates.\nUpdating\nTo update, check out our update page.\nGitLab subscriptions\nAccess to GitLab Premium and Ultimate features is granted by a paid subscription.\nAlternatively, sign up for GitLab.com\nto use GitLab's own infrastructure.",
          "link": "https://about.gitlab.com/releases/2021/10/01/gitlab-14-3-2-released/",
          "publishedOn": "2021-10-01T00:00:00.000Z",
          "wordCount": 1050,
          "title": "GitLab Patch Release: 14.3.2"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/09/30/personal-profile/",
          "author": null,
          "description": "The GitLab user profile contains information about you and your GitLab activity. You can select what information to display.\nWe recently added a few new settings to make you user profile more personal:\nUser pronouns\nUser pronunciation guides\nUser local times\nUser pronouns\nYou can now set pronouns to your GitLab user profile. The pronoun appears:\nNext to your user name in your public profile.\nOn the snapshot view of your user profile when someone hovers over your name on an issue or\nmerge request.\nBesides being more inclusive, GitLab wants to help you use the correct pronouns when replying\nto comments to respect people's identity. You can:\nDecide whether or not to add pronouns to your profile.\nSelf-identify and enter whatever pronouns you want, without having to select from a pre-defined list.\nRead more about adding\npronouns to your profile.\nUser pronunciation\nYou can now add a pronunciation guide to your user profile. In distributed teams where team\nmembers are from different countries, it can be difficult to determine how to say someone's\nname correctly. You can now help people know how to pronounce your name.\nRead more about adding a\npronunciation guide to your profile.\nUser local time\nYour local time is now displayed on your profile. Previously, you could set your time\nzone but your local time was not visible throughout GitLab. This improvement helps\nothers know when you are likely to be available.\nRead more about adding a\nlocal time zone to your profile.\nAdditional settings for user profiles\nIn the upcoming milestone, we are planning to add your timezone to the snapshot view of the GitLab user profile.\nIn GitLab, everyone can contribute. If you would like to see even\nmore additions to user profiles, you can:\nOpen an issue with your request.\nUpvote an existing issue. Read more in our Users direction page.\nEven code it yourself!\nCover image by Ben Sweet on Unsplash",
          "link": "https://about.gitlab.com/blog/2021/09/30/personal-profile/",
          "publishedOn": "2021-09-30T00:00:00.000Z",
          "wordCount": 1400,
          "title": "GitLab user profiles have just become more personal"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/09/30/want-faster-releases-your-answer-lies-in-automated-software-testing/",
          "author": null,
          "description": "For three years in a row, our Global DevSecOps Survey found testing was the number one reason (by large margins) for release delays. A lack of automated software testing, combined with too many manual tests conducted too late in the process, was a story told time after time, and it certainly was one without any kind of happy ending.\nDespite the undeniable progress DevOps has brought to software development, integrating automated software testing into the lifecycle has remained an elusive goal for many teams. Here’s a look at why testing is such a difficult step to get right, and how an integrated DevOps Platform can bring much-needed structure to the process.\nThe state of automated software testing\nAccording to our 2021 Survey, it’s safe to say respondents are frustrated with software test…",
          "link": "https://about.gitlab.com/blog/2021/09/30/want-faster-releases-your-answer-lies-in-automated-software-testing/",
          "publishedOn": "2021-09-30T00:00:00.000Z",
          "wordCount": 2123,
          "title": "Want faster releases? Your answer lies in automated software testing"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/09/30/security-release-gitlab-14-3-1-released/",
          "author": null,
          "description": "Today we are releasing versions 14.3.1, 14.2.5, and 14.1.7 for GitLab Community Edition (CE) and Enterprise Edition (EE).\nThese versions contain important security fixes, and we strongly recommend that all GitLab installations be upgraded to one of these versions immediately.\nGitLab releases patches for vulnerabilities in dedicated security releases. There are two types of security releases: a monthly, scheduled security release, released a week after the feature release (which deploys on the 22nd of each month), and ad-hoc security releases for critical vulnerabilities. For more information, you can visit our security FAQ. You can see all of our regular and security release blog posts here. In addition, the issues detailing each vulnerability are made public on our issue tracker 30 days a…",
          "link": "https://about.gitlab.com/releases/2021/09/30/security-release-gitlab-14-3-1-released/",
          "publishedOn": "2021-09-30T00:00:00.000Z",
          "wordCount": 3566,
          "title": "GitLab Security Release: 14.3.1, 14.2.5, and 14.1.7"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/09/29/why-we-spent-the-last-month-eliminating-postgresql-subtransactions/",
          "author": null,
          "description": "Since last June, we noticed the database on GitLab.com would\nmysteriously stall for minutes, which would lead to users seeing 500\nerrors during this time. Through a painstaking investigation over\nseveral weeks, we finally uncovered the cause of this: initiating a\nsubtransaction via the SAVEPOINT SQL query while\na long transaction is in progress can wreak havoc on database\nreplicas. Thus launched a race, which we recently completed, to\neliminate all SAVEPOINT queries from our code. Here's what happened,\nhow we discovered the problem, and what we did to fix it.\nThe symptoms begin\nOn June 24th, we noticed that our CI/CD runners service reported a high\nerror rate:\n\nA quick investigation revealed that database queries used to retrieve\nCI/CD builds data were timing out and that the unprocessed b…",
          "link": "https://about.gitlab.com/blog/2021/09/29/why-we-spent-the-last-month-eliminating-postgresql-subtransactions/",
          "publishedOn": "2021-09-29T00:00:00.000Z",
          "wordCount": 7257,
          "title": "Why we spent the last month eliminating PostgreSQL subtransactions"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/09/28/generic-semantic-version-processing/",
          "author": null,
          "description": "The semantic versioning (SemVer) specification can be\nconsidered the de-facto standard for tracking software states during its\nevolution. Unfortunately, in reality many languages/ecosystems practice \"SemVer versioning\" and have not adopted\nthe standard as-is; instead we can find many different semantic versioning\nflavors that are not necessarily compatible with the original SemVer spec. SemVer Versioning has\nled to the creation of a variety of different semantic versioning schemes.\nGitLab provides a Dependency Scanning (DS)\nfeature that automatically detects vulnerabilities in the dependencies of a\nsoftware project for a variety of different languages. DS relies on the\nGitLab security advisory database\nthat is updated on a daily basis providing information about\nvulnerable packages that is…",
          "link": "https://about.gitlab.com/blog/2021/09/28/generic-semantic-version-processing/",
          "publishedOn": "2021-09-28T00:00:00.000Z",
          "wordCount": 7734,
          "title": "SemVer versioning: how we handled it with linear interval arithmetic"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/09/27/how-to-configure-sidekiq-for-gitlab-at-scale/",
          "author": null,
          "description": "Configuring Sidekiq in your own deployment of GitLab is a little complicated, but entirely possible. In this blog post, we share how to set up Sidekiq for GitLab in special cases and at a large scale by sharing some exmaples that may be useful to you.\nWhy consider special configuration?\nWhile Sidekiq (both in general, and in a GitLab deployment) will usually just work most of the time, there can be some sharp edges and limits. Raw scale is a clear and obvious driver for needing to take action, and although it may be fine to simply scale out multiple Sidekiq nodes each listening to all the queues, at some point:\nThe uniqueness of workload distribution and job characteristics may require dedicated workers, either sharded on job attributes (as for GitLab.com), or specific workers (based on yo…",
          "link": "https://about.gitlab.com/blog/2021/09/27/how-to-configure-sidekiq-for-gitlab-at-scale/",
          "publishedOn": "2021-09-27T00:00:00.000Z",
          "wordCount": 6297,
          "title": "How to configure Sidekiq for specialized or large-scale GitLab instances"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/09/27/gitlab-14-0-11-released/",
          "author": null,
          "description": "Today we are releasing version 14.0.11 GitLab Community Edition and Enterprise Edition.\nThis version resolves a number of regressions and bugs in\nthe 14.0 release and\nprior versions.\nGitLab Community Edition and Enterprise Edition\nDerive virtual storage's filesystem id from its name\nFix Elastic::MigrationWorker current_migration\nImportant notes on upgrading\nThese versions do not include any new migrations, and for multi-node deployments, should not require any downtime.\nPlease be aware that by default the Omnibus packages will stop, run migrations,\nand start again, no matter how “big” or “small” the upgrade is. This behavior\ncan be changed by adding a /etc/gitlab/skip-auto-reconfigure file,\nwhich is only used for updates.\nUpdating\nTo update, check out our update page.\nGitLab subscriptions\nAccess to GitLab Premium and Ultimate features is granted by a paid subscription.\nAlternatively, sign up for GitLab.com\nto use GitLab's own infrastructure.",
          "link": "https://about.gitlab.com/releases/2021/09/27/gitlab-14-0-11-released/",
          "publishedOn": "2021-09-27T00:00:00.000Z",
          "wordCount": 1028,
          "title": "GitLab Patch Release: 14.0.11"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/09/27/gitlab-14-1-6-released/",
          "author": null,
          "description": "Today we are releasing version 14.1.6 for GitLab Community Edition and Enterprise Edition.\nThis version resolves a number of regressions and bugs in\nthis month's 14.1 release and\nprior versions.\nGitLab Community Edition and Enterprise Edition\nDerive virtual storage's filesystem id from its name\nFix Elastic::MigrationWorker current_migration\nImportant notes on upgrading\nThis version does not include any new migrations, and for multi-node deployments, should not require any downtime.\nPlease be aware that by default the Omnibus packages will stop, run migrations,\nand start again, no matter how “big” or “small” the upgrade is. This behavior\ncan be changed by adding a /etc/gitlab/skip-auto-reconfigure file,\nwhich is only used for updates.\nUpdating\nTo update, check out our update page.\nGitLab subscriptions\nAccess to GitLab Premium and Ultimate features is granted by a paid subscription.\nAlternatively, sign up for GitLab.com\nto use GitLab's own infrastructure.",
          "link": "https://about.gitlab.com/releases/2021/09/27/gitlab-14-1-6-released/",
          "publishedOn": "2021-09-27T00:00:00.000Z",
          "wordCount": 1030,
          "title": "GitLab Patch Release: 14.1.6"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/09/23/best-practices-customer-feature-request/",
          "author": null,
          "description": "Effectively communicating a customer’s private needs to product teams is essential to a product’s success, but it can be a tricky undertaking.\nTeams can face several challenges in communicating and tracking customers' requests, including protecting customer confidentiality, tracking priority and progress, and making sure the product team is getting actionable feedback that can be incorporated into product milestones.\nThis blog post shares GitLab's best practices and lessons learned, as well as a video conversation between GitLab CEO Sid Sijbrandij and Fleet CEO Mike McNeil.\nIn line with GitLab's open core model and transparency value, our product roadmap is public and the product team uses public issue trackers for feature requests and to plan the work. Because the issues are public, custo…",
          "link": "https://about.gitlab.com/blog/2021/09/23/best-practices-customer-feature-request/",
          "publishedOn": "2021-09-23T00:00:00.000Z",
          "wordCount": 2544,
          "title": "How to incorporate private customer needs into a public product roadmap"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/09/23/have-devops-jobs-to-fill-try-these-3-strategies-to-hire-and-retain/",
          "author": null,
          "description": "If every company is a software company, how do you stand out from the crowd when it comes to attracting developer talent and filling DevOps jobs?\nThere’s a well-known, and worldwide, shortage of software developers, especially those with expertise in DevOps. Worse still, demand for those roles is accelerating rapidly: The US Bureau of Labor Statistics predicts employment opportunities for devs and testers will increase 22% between 2020 and 2030. That growth rate means nearly 190,000 net new developer/QA/test jobs will be opening each year, according to the BLS.\nThat’s all a long way of saying things are tough out there. Organizations looking to expand, or even just maintain, their DevOps jobs momentum have to find unique ways to stand out from the crowd because, as many surveys have shown,…",
          "link": "https://about.gitlab.com/blog/2021/09/23/have-devops-jobs-to-fill-try-these-3-strategies-to-hire-and-retain/",
          "publishedOn": "2021-09-23T00:00:00.000Z",
          "wordCount": 2002,
          "title": "Have DevOps jobs to fill? Try these 3 strategies to hire and retain"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/09/22/gitlab-13-12-12-released/",
          "author": null,
          "description": "Today we are releasing version 13.12.12 for GitLab Community Edition and Enterprise Edition.\nThis version resolves a number of regressions and bugs in\nthe 13.12 release and\nprior versions.\nGitLab Community Edition and Enterprise Edition\nDerive virtual storage's filesystem id from its name\nAllow Raspberry Pi builds on Graviton\nStop pinning versions of perl related packages in UBI images\nImportant notes on upgrading\nThis version does not include any new migrations, and for multi-node deployments, should not require any downtime.\nPlease be aware that by default the Omnibus packages will stop, run migrations,\nand start again, no matter how “big” or “small” the upgrade is. This behavior\ncan be changed by adding a /etc/gitlab/skip-auto-reconfigure file,\nwhich is only used for updates.\nUpdating\nTo update, check out our update page.\nGitLab subscriptions\nAccess to GitLab Premium and Ultimate features is granted by a paid subscription.\nAlternatively, sign up for GitLab.com\nto use GitLab's own infrastructure.",
          "link": "https://about.gitlab.com/releases/2021/09/22/gitlab-13-12-12-released/",
          "publishedOn": "2021-09-22T00:00:00.000Z",
          "wordCount": 1034,
          "title": "GitLab Patch Release: 13.12.12"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/09/22/gitlab-14-3-released/",
          "author": null,
          "description": "Today, we are excited to announce the release of GitLab 14.3 with project-level security scan execution policies, next generation SAST to reduce Ruby false positives, group-level permissions for protected environments, group access for the GitLab Kubernetes Agent, and much more!\nThese are just a few highlights from the 40+ improvements in this release. Read on to check out all of the great updates below.\nTo preview what's coming in next month’s release, check out our Upcoming Releases page, which includes our 14.4 release kickoff video.\nJoin us for an upcoming event\n\n\n\n\n\n\n\n\n\nThis month's Most Valuable Person (MVP) is\nfeistel\n\n@feistel started contributing to GitLab Pages in September 2020. In the last 4 months, they have made continuous contributions to improve Pages by adding features, fi…",
          "link": "https://about.gitlab.com/releases/2021/09/22/gitlab-14-3-released/",
          "publishedOn": "2021-09-22T00:00:00.000Z",
          "wordCount": 6046,
          "title": "GitLab 14.3 releases Project Security Policies & Next Gen SAST"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/09/21/how-the-devops-platform-makes-building-accessible-software-easier/",
          "author": null,
          "description": "The earlier a feature or process is introduced in the multi-step software development lifecycle (SDLC), the more likely it is to be fully integrated into the product.\nIt's well documented how security can shift left using a DevOps platform, so it's time to make the case that accessbility needs to be thought about earlier (and, clearly, a DevOps platform can facilitate that too). Although there are laws that require applications to meet certain accessibility requirements, which opens an application up to a broader user base, rarely is accessibility considered a core product requirement. Instead, it is just a test tacked on at the end instead of being built into the DevOps platform process.\n[Learn more about how the open source development community helps build accessible software]\n\"The prob…",
          "link": "https://about.gitlab.com/blog/2021/09/21/how-the-devops-platform-makes-building-accessible-software-easier/",
          "publishedOn": "2021-09-21T00:00:00.000Z",
          "wordCount": 2854,
          "title": "It's time to build more accessible software. A DevOps platform can help"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/09/21/introducing-markdown-live-preview/",
          "author": null,
          "description": "Fostering better, more meaningful collaboration is an integral part of DevOps and a key part of what GitLab, the complete DevOps Platform, unlocks for developers and their teams. While many developers or engineers feel more comfortable working locally on their machines and spend a majority of their time using a CLI to push code changes, with GitLab you can also use the Web Editor or Web IDE to collaborate and edit content in a much easier, faster, and approachable way.\nStarting in GitLab 14.2, editing Markdown content in the Web Editor or Web IDE just got even better.\nIntroducing the realtime Preview Markdown editor\nGitLab Flavored Markdown automatically renders Markdown content in an easy-to-read and easy-to-write plain text language. Although Markdown is inherently more “human-readable” …",
          "link": "https://about.gitlab.com/blog/2021/09/21/introducing-markdown-live-preview/",
          "publishedOn": "2021-09-21T00:00:00.000Z",
          "wordCount": 1613,
          "title": "GitLab's realtime Preview Markdown is an editor for everyone"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/09/17/gitlab-14-2-4-released/",
          "author": null,
          "description": "Today we are releasing version 14.2.4 for GitLab Community Edition and Enterprise Edition.\nThis version resolves a number of regressions and bugs in\nlast month's 14.2 release and\nprior versions.\nGitLab Community Edition and Enterprise Edition\nAvailable in GitLab Free, Premium, and Ultimate:\nRemoves cleanup job from Terraform.latest\nRun AWS Release rake task only if on latest stable tag\nFix Elastic::MigrationWorker current_migration\nDerive virtual storage's filesystem id from its name\nImportant notes on upgrading\nThis version does not include any new migrations, and for multi-node deployments, should not require any downtime.\nPlease be aware that by default the Omnibus packages will stop, run migrations,\nand start again, no matter how “big” or “small” the upgrade is. This behavior\ncan be changed by adding a /etc/gitlab/skip-auto-reconfigure file,\nwhich is only used for updates.\nUpdating\nTo update, check out our update page.\nGitLab subscriptions\nAccess to GitLab Premium and Ultimate features is granted by a paid subscription.\nAlternatively, sign up for GitLab.com\nto use GitLab's own infrastructure.",
          "link": "https://about.gitlab.com/releases/2021/09/17/gitlab-14-2-4-released/",
          "publishedOn": "2021-09-17T00:00:00.000Z",
          "wordCount": 1047,
          "title": "GitLab Patch Release: 14.2.4"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/09/15/qpage-on-the-devops-platform/",
          "author": null,
          "description": "Deployment automation is essential for any company involved in software development to stay competitive. QPage, a company that provides an end-to-end sourcing and recruitment solution for SMEs, realized it quickly and migrated to GitLab’s DevOps Platform to accelerate their deployment process.\nWe spoke with Pouya Lotfi, the co-founder of QPage, to see how they use GitLab at QPage and how it has helped the company.\nWhy GitLab?\nQPage was initially using a local bespoke CI/CD for about the first two months, but they soon realized they needed a more professional DevOps Platform system. Because Pouya and the team at QPage had already used GitLab at a previous employer, they knew it would be the right fit. So, they didn’t consider other options and opted for GitLab straight away.\nEverything you …",
          "link": "https://about.gitlab.com/blog/2021/09/15/qpage-on-the-devops-platform/",
          "publishedOn": "2021-09-15T00:00:00.000Z",
          "wordCount": 2264,
          "title": "How QPage achieved automatic deployment and efficiency using the GitLab DevOps Platform"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/09/14/gitlab-together-with-terratag-open-source-to-help-you-manage-terraform-resources/",
          "author": null,
          "description": "When using infrastructure as code (IaC) on a public cloud provider, it's important to use tags and labels to organize your IaC using their complementary services. Terratag, an open source project developed by env0, can be used with Terraform and placed on top of the GitLab CI/CD platform, making tagging and labeling IaC easier and more efficient.\nGitLab and Terraform make it easy to tag and label infrastructure as code.\nInside your toolbox\nGitLab the industry's leading DevOps platform. Not long ago, we announced the ability to control Terraform deployments, remote state management, private module registry, and merge request integration for Terraform. This gives users a range of solutions for running CI/CD for Terraform code and managing it on a large scale.\nTerraform is the most widely ado…",
          "link": "https://about.gitlab.com/blog/2021/09/14/gitlab-together-with-terratag-open-source-to-help-you-manage-terraform-resources/",
          "publishedOn": "2021-09-14T00:00:00.000Z",
          "wordCount": 3851,
          "title": "How to use Terratag to automatically manage tags and labels for your Terraform Code"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/09/13/lessons-weet-learned-lokalise/",
          "author": null,
          "description": "As a GitLab customer, Weet has fully invested in the premise of \"Iterate faster, innovate together.\" Weet has a low tolerance for processes that don't keep pace with the way they develop and launch. One important process that was slowing the business down – localizing their app.\nLocalization is a key way to drive growth and accelerate product adoption. When done poorly, localization or l10n, as it's commonly known, can slow down your development process, introduce bugs, and make it cumbersome to launch updates. When done right, teams can smooth out the process and continuously localize their app. We unpack how Weet conquered its localization problems using GitLab and Lokalise.\nWhat is Weet?\nWeet is an asynchronous video communication tool designed to reduce the need for meetings. By combin…",
          "link": "https://about.gitlab.com/blog/2021/09/13/lessons-weet-learned-lokalise/",
          "publishedOn": "2021-09-13T00:00:00.000Z",
          "wordCount": 2879,
          "title": "How Weet integrates localization into the GitLab pipeline with Lokalise"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/09/10/setting-up-the-k-agent/",
          "author": null,
          "description": "The GitLab Kubernetes Agent (agentk) is an active in-cluster component for solving GitLab and Kubernetes integration tasks in a secure and cloud native way. The agentk communicates to the GitLab Kubernetes Agent Server (kas) to perform GitOps operations.\nIn many examples, we see the agent being deployed with global-level permissions on your cluster. There are use cases where we want to reduce the scope of what agentk has access to. In this guide I will provide information on deploying agentk on your cluster, limiting what namespaces it can access, as well as using it to deploy your applications.\nPrefer a video? Watch the walkthrough below to learn how to deploy agentk to your cluster:\n\n\nHow it works\nAnytime a developer performs changes to a manifest file managed within GitLab, the agentk w…",
          "link": "https://about.gitlab.com/blog/2021/09/10/setting-up-the-k-agent/",
          "publishedOn": "2021-09-10T00:00:00.000Z",
          "wordCount": 4027,
          "title": "How to deploy the GitLab Kubernetes Agent with limited permissions"
        }
      ]
    },
    {
      "title": "Phoronix",
      "feedUrl": "https://www.phoronix.com/rss.php",
      "siteUrl": "https://www.phoronix.com/",
      "articles": [
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-rc4",
          "author": null,
          "description": "Linus Torvalds has declared Linux 5.15-rc4 as the latest weekly release candidate of the maturing Linux 5.15 codebase...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-rc4",
          "publishedOn": "2021-10-03T21:56:07.000Z",
          "wordCount": 747,
          "title": "Linux 5.15-rc4 Released - The Kernel Is Looking \"Pretty Normal\""
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.16-USB-Audio-LL",
          "author": null,
          "description": "The Linux kernel is trying again to enhance the low-latency playback mode of its USB audio driver...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.16-USB-Audio-LL",
          "publishedOn": "2021-10-03T12:57:19.000Z",
          "wordCount": 921,
          "title": "Linux 5.16 Aims For Better USB Low-Latency Audio Playback"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-AMX-Linux-Kernel-v11",
          "author": null,
          "description": "While Intel Xeon \"Sapphire Rapids\" processors with Advanced Matrix Extensions are set for a Q2'22 ramp in production, one of the key new features that has yet to be properly plumbed in the mainline Linux kernel is for supporting AMX...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-AMX-Linux-Kernel-v11",
          "publishedOn": "2021-10-03T12:26:30.000Z",
          "wordCount": 893,
          "title": "Intel Sends Out 11th Revision Of Linux Kernel Patches For AMX"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Fairphone-4-Linux-Patches",
          "author": null,
          "description": "Announced this week was the Fairphone 4 as the latest iteration of this smartphone focused on being \"sustainable and ethical\" and now the initial patches have been sent out for providing mainline Linux kernel support...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Fairphone-4-Linux-Patches",
          "publishedOn": "2021-10-03T09:48:48.000Z",
          "wordCount": 797,
          "title": "Initial Linux Kernel Patches Posted For The Fairphone 4"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-Compute-21.39.21127",
          "author": null,
          "description": "Intel's newest weekly Compute-Runtime update providing open-source OpenCL and oneAPI Level Zero support for their graphics hardware is now reader with broader support for upcoming Alder Lake S processors...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-Compute-21.39.21127",
          "publishedOn": "2021-10-03T09:30:40.000Z",
          "wordCount": 769,
          "title": "Intel Compute-Runtime 21.39.21127 Brings Broader Alder Lake S Support"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=OpenBLAS-0.3.18-Released",
          "author": null,
          "description": "OpenBLAS 0.3.18 is out today as the latest feature update to this widely-used, open-source BLAS implementation...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=OpenBLAS-0.3.18-Released",
          "publishedOn": "2021-10-02T19:02:53.000Z",
          "wordCount": 730,
          "title": "OpenBLAS 0.3.18 Released With LoongArch64 Support, More Optimizations"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-oneAPI-2021.4",
          "author": null,
          "description": "Intel on Friday formally released their oneAPI Toolkits 2021.4 release as the latest collection of their various software components for a multi-vendor, multi-architecture software platform across CPUs and XPUs (GPUs / accelerators)...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-oneAPI-2021.4",
          "publishedOn": "2021-10-02T17:54:16.000Z",
          "wordCount": 846,
          "title": "Intel oneAPI 2021.4 Released With More Optimizations, Continues LLVM Adoption"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=helloSystem-0.6",
          "author": null,
          "description": "Version 0.6 of helloSystem is now available as the FreeBSD-based open-source operating system project taking design cues from Apple's macOS...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=helloSystem-0.6",
          "publishedOn": "2021-10-02T17:34:57.000Z",
          "wordCount": 750,
          "title": "helloSystem 0.6 Released For macOS-Inspired FreeBSD"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Facebook-Compiler-Gym",
          "author": null,
          "description": "Facebook this week announced the open-sourcing of CompilerGym as their effort to improve compiler performance by leveraging machine learning to tackle optimization work...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Facebook-Compiler-Gym",
          "publishedOn": "2021-10-02T09:53:37.000Z",
          "wordCount": 862,
          "title": "Facebook Is Aiming To Make Compilers Faster Using Machine Learning With CompilerGym"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Plasma-5.23-Less-KWin-Crashes",
          "author": null,
          "description": "Plasma 5.23 stable is due to be released in two weeks while until then KDE developers are scurrying to land more fixes in this next desktop update...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Plasma-5.23-Less-KWin-Crashes",
          "publishedOn": "2021-10-02T09:31:11.000Z",
          "wordCount": 876,
          "title": "Plasma 5.23 Lands More Last-Minute Fixes To Avoid Wayland Crashes"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=R300-Friday-Night-2021",
          "author": null,
          "description": "While earlier this year AMD shifted their Radeon Software driver focus to only supporting Polaris / GCN 1.4 and newer, when it comes to the open-source driver support on Linux there still is occasional activity going back to the ATI Radeon R300 days from nearly two decades ago...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=R300-Friday-Night-2021",
          "publishedOn": "2021-10-01T23:30:30.000Z",
          "wordCount": 1019,
          "title": "Nearly Two Decades Later, ATI Radeon R300 Linux Driver Sees Occasional Improvement"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=PipeWire-Better-Video-2021",
          "author": null,
          "description": "PipeWire from the start was designed around handling the needs of both audio and video streams on Linux. While PipeWire is already in use for screencasting/recording under Wayland and working with Flatpak'ed applications, recently much of PipeWire's focus has been on addressing the use-cases of JACK and PulseAudio on the sound side. Now that the audio support is in quite good shape, Red Hat engineers are back to focusing on improvements to the video support...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=PipeWire-Better-Video-2021",
          "publishedOn": "2021-10-01T17:51:35.000Z",
          "wordCount": 786,
          "title": "Red Hat / Fedora To Focus On Driving New Linux Video Improvements Around PipeWire"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30571",
          "author": null,
          "description": "Given this week's release of Fedora 35 Beta I have begun my benchmarking to look at how this next installment of Fedora Linux is shaping up given that it tends to be at the forefront of open-source innovations given Red Hat's investments. For our initial F35 benchmarking is looking at the Fedora Server 35 Beta performance compared to Fedora 34 on a dual Intel Xeon Platinum 8380 server.",
          "link": "https://www.phoronix.com/vr.php?view=30571",
          "publishedOn": "2021-10-01T13:23:08.000Z",
          "wordCount": 725,
          "title": "Fedora Server 35 Performance Looking Good - Initial Benchmarks With Intel Xeon Ice Lake"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=LLVM-13.0-Released",
          "author": null,
          "description": "LLVM 13.0 was tagged overnight as the latest half-year update to this widely-used, very powerful open-source compiler stack...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=LLVM-13.0-Released",
          "publishedOn": "2021-10-01T13:02:40.000Z",
          "wordCount": 891,
          "title": "LLVM 13.0 Released With Official Flang Binary Packages, Improved OpenCL Clang Support"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=POCL-1.8-RC1-Released",
          "author": null,
          "description": "The first release candidate of the forthcoming PoCL 1.8 \"Portable Computing Language\" implementation is now available for testing...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=POCL-1.8-RC1-Released",
          "publishedOn": "2021-10-01T12:29:09.000Z",
          "wordCount": 769,
          "title": "PoCL 1.8 OpenCL Implementation Coming With LLVM 13 Support, Better SPIR-V On CUDA"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Armv9-GNU-Toolchain-Starting",
          "author": null,
          "description": "Arm engineers have begun landing their Armv9 enablement work in the GNU compiler toolchain...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Armv9-GNU-Toolchain-Starting",
          "publishedOn": "2021-10-01T11:22:00.000Z",
          "wordCount": 733,
          "title": "Arm Begins Adding Armv9 Support To The GNU Compiler Toolchain"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Proton-6.3-7-Plus-DLSS-Exp",
          "author": null,
          "description": "Valve published new versions of Proton and Proton Experimental last night...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Proton-6.3-7-Plus-DLSS-Exp",
          "publishedOn": "2021-10-01T09:10:12.000Z",
          "wordCount": 769,
          "title": "Proton Experimental Enables NVIDIA DLSS For D3D12 Games, Proton Now Handles More Games"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=September-2021-Highlights",
          "author": null,
          "description": "That's a wrap for September with 229 original news articles and another 13 featured Linux hardware reviews / multi-page benchmark articles, all written by your's truly. It was another eventful month with Linux 5.15 moving forward, a lot of driver activity by AMD and Intel, and other open-source milestones like the release of GNOME 41 and the shipping of the Ubuntu 21.10 and Fedora 35 beta releases...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=September-2021-Highlights",
          "publishedOn": "2021-10-01T04:00:00.000Z",
          "wordCount": 2805,
          "title": "Linux 5.15, AMD / Radeon Advancements, Intel SDSi Dominated Discussions This Month"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-CPU-GPU-Prio-Nice-Sched",
          "author": null,
          "description": "Intel's open-source Linux graphics driver engineers are evaluating possible improvements to the Linux kernel for accommodating CPU and GPU synchronized priority scheduling...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-CPU-GPU-Prio-Nice-Sched",
          "publishedOn": "2021-09-30T19:34:31.000Z",
          "wordCount": 1033,
          "title": "Intel Exploring CPU+GPU Synchronized Priority Scheduling For Linux"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-Linux-Audio-Guybrush",
          "author": null,
          "description": "In addition to Linux 5.15 adding a new AMD audio driver for \"Van Gogh\" APUs such as found in the forthcoming Steam Deck, AMD's open-source Linux driver engineers have also been working on other audio improvements -- this time on the Chromebook front...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-Linux-Audio-Guybrush",
          "publishedOn": "2021-09-30T18:58:25.000Z",
          "wordCount": 805,
          "title": "New AMD Linux Audio Driver Patches Posted - Aimed For Enhancing Chromebook Support"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-Loihi-2-Lava",
          "author": null,
          "description": "Intel has some new announcements around their neuromorphic computing research...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-Loihi-2-Lava",
          "publishedOn": "2021-09-30T15:00:00.000Z",
          "wordCount": 836,
          "title": "Intel Announces Loihi 2, Lava Software Framework For Advancing Neuromorphic Computing"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.1M-IOPS-Per-Core",
          "author": null,
          "description": "Linux kernel developers have been working tirelessly to squeeze more performance out of IO_uring and the block / I/O code in general. IO_uring lead developer Jens Axboe who also serves as the Linux block subsystem's maintainer (among other roles and major contributions over the years) has used his system as a baseline for evaluating such kernel improvements. He's now moved to using AMD Zen 3 while sticking to Intel Optane storage and is seeing a mighty speed boost out of AMD's latest processors...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.1M-IOPS-Per-Core",
          "publishedOn": "2021-09-30T13:53:35.000Z",
          "wordCount": 825,
          "title": "Linux Achieves 5.1M IOPS Per-Core With AMD Zen 3 + Intel Optane"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=PostgreSQL-14",
          "author": null,
          "description": "PostgreSQL 14.0 is now officially available as the latest version of this widely-used, open-source SQL server...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=PostgreSQL-14",
          "publishedOn": "2021-09-30T13:19:19.000Z",
          "wordCount": 802,
          "title": "PostgreSQL 14.0 Released With More Performance Improvements"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=VirtIO-Linux-5.16-Ctx-Type",
          "author": null,
          "description": "Google's work on the VirtIO DRM kernel driver around the notion of \"context types\" and being able to initialize different types of contexts is set to be merged for Linux 5.16 in opening up more use-cases for this driver that is an important part of the open-source virtualization graphics stack for graphics...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=VirtIO-Linux-5.16-Ctx-Type",
          "publishedOn": "2021-09-30T12:29:44.000Z",
          "wordCount": 825,
          "title": "Linux 5.16 To Feature More Extensible VirtIO GPU Driver With \"Context Types\" Addition"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Qt-6.2-LTS-Released",
          "author": null,
          "description": "Qt 6.2 LTS is out today as the first long-term support release in the Qt6 series and also with all of the major modules now ported over from Qt5 in aiming to make this a suitable point to transition from Qt 5.15 LTS...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Qt-6.2-LTS-Released",
          "publishedOn": "2021-09-30T10:38:36.000Z",
          "wordCount": 938,
          "title": "Qt 6.2 LTS Released With Qt6 Now Aiming To Be Ready For Widespread Adoption"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=AMDVLK-2021.Q3.7",
          "author": null,
          "description": "AMD has pushed out one more code drop of their AMDVLK official open-source Vulkan driver before ending out the quarter...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=AMDVLK-2021.Q3.7",
          "publishedOn": "2021-09-30T10:09:48.000Z",
          "wordCount": 841,
          "title": "AMDVLK 2021.Q3.7 Driver Released With New Extensions, More Optimizations"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Ampere-Altra-Max-Pricing",
          "author": null,
          "description": "From our Ampere Altra Max M128-30 Linux performance preview earlier this week, one of the questions a number of readers were wondering about and a question I also still had open was on the Altra Max pricing... I've now received the current price list and actually comes in much lower than expected for a 128-core CPU in 2021...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Ampere-Altra-Max-Pricing",
          "publishedOn": "2021-09-30T09:55:28.000Z",
          "wordCount": 919,
          "title": "Ampere Altra Max 128-Core CPU Is Priced Lower Than Flagship Xeon, EPYC CPUs"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-21.2.3-Released",
          "author": null,
          "description": "Succeeding Mesa 21.2.2 from earlier this month that was a much delayed and in turn very large release, Mesa 21.2.3 is out today and it's on the quieter side...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-21.2.3-Released",
          "publishedOn": "2021-09-29T23:27:14.000Z",
          "wordCount": 731,
          "title": "Mesa 21.2.3 Released As A Small Update To This Graphics Driver Stack"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-pkill_on_warn",
          "author": null,
          "description": "A new kernel option was proposed today called \"pkill_on_warn\" that would kill all threads in a process if that process provoked a kernel warning...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-pkill_on_warn",
          "publishedOn": "2021-09-29T19:32:45.000Z",
          "wordCount": 817,
          "title": "\"pkill_on_warn\" Proposed For Killing Linux Processes That Cause A Kernel Warning"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=libcamera-2021",
          "author": null,
          "description": "Libcamera as an open-source camera stack that has been coming together over the past few years has been maturing quite well, broadening its supported hardware and feature set, and more in filling a void in the Linux camera ecosystem...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=libcamera-2021",
          "publishedOn": "2021-09-29T18:30:06.000Z",
          "wordCount": 882,
          "title": "Libcamera Maturing Well As Open-Source Camera Stack"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30568",
          "author": null,
          "description": "Recently I carried out some updated Windows 11 benchmarks against Linux to look at how this forthcoming Microsoft operating system release is competing with Ubuntu. In this article is a fresh look at the Windows Subsystem for Linux (WSL2) performance on the near-final Windows 11 against Ubuntu Linux.",
          "link": "https://www.phoronix.com/vr.php?view=30568",
          "publishedOn": "2021-09-29T13:18:02.000Z",
          "wordCount": 891,
          "title": "Windows 11 WSL2 Performance Is Quite Competitive Against Ubuntu 20.04 LTS / Ubuntu 21.10"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-30x-Energy-Efficiency-2025",
          "author": null,
          "description": "AMD this morning announced a goal of increasing the energy efficiency of EPYC processors running AI training and high performance workloads by 30x... Within the next four years...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-30x-Energy-Efficiency-2025",
          "publishedOn": "2021-09-29T13:09:14.000Z",
          "wordCount": 839,
          "title": "AMD Aims For 30x Energy Efficiency Improvement For AI Training + HPC By 2025"
        }
      ]
    }
  ],
  "cliVersion": "1.11.2"
}