{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": []
    },
    {
      "title": "GitLab",
      "feedUrl": "https://about.gitlab.com/atom.xml",
      "siteUrl": "https://about.gitlab.com/blog/",
      "articles": [
        {
          "id": "https://about.gitlab.com/releases/2021/08/31/security-release-gitlab-14-2-2-released/",
          "author": null,
          "description": "Today we are releasing versions 14.2.2, 14.1.4, and 14.0.9 for GitLab Community Edition (CE) and Enterprise Edition (EE).\nThese versions contain important security fixes, and we strongly recommend that all GitLab installations be upgraded to one of these versions immediately.\nGitLab releases patches for vulnerabilities in dedicated security releases. There are two types of security releases: a monthly, scheduled security release, released a week after the feature release (which deploys on the 22nd of each month), and ad-hoc security releases for critical vulnerabilities. For more information, you can visit our security FAQ. You can see all of our regular and security release blog posts here. In addition, the issues detailing each vulnerability are made public on our issue tracker 30 days a…",
          "link": "https://about.gitlab.com/releases/2021/08/31/security-release-gitlab-14-2-2-released/",
          "publishedOn": "2021-08-31T00:00:00.000Z",
          "wordCount": 2080,
          "title": "GitLab Security Release: 14.2.2, 14.1.4, and 14.0.9"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/08/30/secure-pipeline-with-single-sign-in/",
          "author": null,
          "description": "If there is one thing that recent cyberattacks at companies such as SolarWinds, Codecov, and Kaseya have taught us, it's that software build pipelines are being targeted for attacks more than ever before. Hackers are no longer just attacking the bits and bytes of source code that go into our products, but also the development, testing, and build infrastructure tools that are used to build these products.\nEven if you believe your company is at low risk of an attack, it's also important to think about your customers. Businesses with high profile customers – like government agencies or large, multinational corporations that use your products – might have attackers target them by hacking your company, or more specifically, the software you provide them.\nThe incidents at Solarwinds, Codecov, an…",
          "link": "https://about.gitlab.com/blog/2021/08/30/secure-pipeline-with-single-sign-in/",
          "publishedOn": "2021-08-30T00:00:00.000Z",
          "wordCount": 2770,
          "title": "How to secure your software build pipeline using code signing"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/08/26/its-time-to-upgrade-docker-engine/",
          "author": null,
          "description": "Alpine Linux distribution is the base OS used by many Linux container images. It provides a handy packaging mechanism, new versions of software, and a quick and predictable release cycle – all while being distributed using a minimal image size. It's used by many very popular container images, for example docker:dind,\nwidely used in GitLab CI/CD workloads handling container\nimages building and management in the jobs.\nOn June 15, 2021, Alpine Linux released version 3.14. As documented in the release notes, changes in the musl library require\nan updated version of runc or updated version of\nDocker for the Alpine 3.14-based images to work properly.\nSoftware products across the computer industry have started migrating their Alpine Linux-based container images to 3.14 since it includes significa…",
          "link": "https://about.gitlab.com/blog/2021/08/26/its-time-to-upgrade-docker-engine/",
          "publishedOn": "2021-08-26T00:00:00.000Z",
          "wordCount": 2589,
          "title": "It's time to update Docker Engine"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/08/26/gitlab-14-0-8-released/",
          "author": null,
          "description": "Today we are releasing version 14.0.8 for GitLab Community Edition and Enterprise Edition.\nThis version resolves a number of regressions and bugs in\nthe 14.0 release and\nprior versions.\nGitLab Community Edition and Enterprise Edition\nRevert backfill on ci_build_trace_sections\nResolve \"operator does not exist: integer[] || bigint in app/models/namespace/traversal_hierarchy.rb\"\nFix Sidekiq workers delete each other's metrics\nGeo 2.0 Regression - Add ability to remove primary\nBackport fix for flaky spec to 14.0\nImportant notes on upgrading\nThis version includes a post deploy migration. For multi-node deployments, it should not require any downtime.\nPlease be aware that by default the Omnibus packages will stop, run migrations,\nand start again, no matter how “big” or “small” the upgrade is. This behavior\ncan be changed by adding a /etc/gitlab/skip-auto-reconfigure file,\nwhich is only used for updates.\nUpdating\nTo update, check out our update page.\nGitLab subscriptions\nAccess to GitLab Premium and Ultimate features is granted by a paid subscription.\nAlternatively, sign up for GitLab.com\nto use GitLab's own infrastructure.",
          "link": "https://about.gitlab.com/releases/2021/08/26/gitlab-14-0-8-released/",
          "publishedOn": "2021-08-26T00:00:00.000Z",
          "wordCount": 1047,
          "title": "GitLab Patch Release: 14.0.8"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/08/24/stageless-pipelines/",
          "author": null,
          "description": "GitLab CI/CD technology has historically divided a pipeline into stages based on the typical development workflow. Now that GitLab 14.2 has launched, users can speed up cycle times by using the needs command to write a complete CI/CD pipeline with every job in the single stage. In fact, you can omit stages completely and have a \"stageless\" pipeline that executes entirely based on the needs dependencies.\nUnderstanding stages\nIn GitLab CI/CD, you use stages to group jobs based on the development workflow and control the order of execution for CI/CD jobs.\nPipelines execute each stage in order, where all jobs in a single stage run in parallel. After a stage completes, the pipeline moves on to execute the next stage and runs those jobs, and the process continues like this until the pipeline com…",
          "link": "https://about.gitlab.com/blog/2021/08/24/stageless-pipelines/",
          "publishedOn": "2021-08-24T00:00:00.000Z",
          "wordCount": 2127,
          "title": "Write a stageless CI/CD pipeline using GitLab 14.2"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/08/23/build-cloud-for-macos-beta/",
          "author": null,
          "description": "World-class CI/CD comes as a part of the GitLab DevOps Platform to help streamline how development teams build, test, and deploy their apps. GitLab Runner is the execution engine that \"does the work,\" enabling you, as a developer, to run fast, scalable CI/CD pipelines on your on-premises infrastructure or the cloud. Historically, Apple developers on GitLab SaaS had to set up runners on their own macOS systems to execute CI/CD workflows, introducing additional cost and operational overhead. As organizations and teams develop more apps for the Apple ecosystem, the need to create and deploy quickly becomes more important.\nIntroducing GitLab Build Cloud for macOS Beta\nToday, you can say goodbye to that Mac mini under your desk! We are pleased to announce the GitLab Build Cloud for macOS Beta, …",
          "link": "https://about.gitlab.com/blog/2021/08/23/build-cloud-for-macos-beta/",
          "publishedOn": "2021-08-23T00:00:00.000Z",
          "wordCount": 2010,
          "title": "Introducing GitLab Build Cloud for macOS Beta"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/08/23/gitlab-14-2-1-released/",
          "author": null,
          "description": "Today we are releasing version 14.2.1 for GitLab Community Edition and Enterprise Edition.\nThis version resolves a number of regressions and bugs in\nthis month's 14.2 release and\nprior versions.\nGitLab Community Edition and Enterprise Edition\nAdding upgrade messaging for PK migrations\nDon't override vulnerability feedback UUID anymore\nReorder vulnerability check criteria\nFix \"getAction is undefined\" bug\nDrop un-used db/ci_migrate symlink\nFix migration NameError in rails env helper\nBump Container Registry to v3.9.0-gitlab\nImportant notes on upgrading\nThis version does not include any new migrations, and for multi-node deployments, should not require any downtime.\nPlease be aware that by default the Omnibus packages will stop, run migrations,\nand start again, no matter how “big” or “small” the upgrade is. This behavior\ncan be changed by adding a /etc/gitlab/skip-auto-reconfigure file,\nwhich is only used for updates.\nUpdating\nTo update, check out our update page.\nGitLab subscriptions\nAccess to GitLab Premium and Ultimate features is granted by a paid subscription.\nAlternatively, sign up for GitLab.com\nto use GitLab's own infrastructure.",
          "link": "https://about.gitlab.com/releases/2021/08/23/gitlab-14-2-1-released/",
          "publishedOn": "2021-08-23T00:00:00.000Z",
          "wordCount": 1051,
          "title": "GitLab Patch Release: 14.2.1"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/08/22/gitlab-14-2-released/",
          "author": null,
          "description": "Today, we are excited to announce the release of GitLab 14.2 with  introduction of the Build Cloud for macOS beta, Markdown preview, expanded Gitpod integration, new DevOps adoption metrics, and much more!\nThese are just a few highlights of the 50+ improvements in this release. Read on to check out all of the great updates below.\nTo preview what's coming in next month’s release, check out our Upcoming Releases page, which includes our 14.3 release kickoff video.\nJoin us for an upcoming event\n\n\n\n\n\n\n\n\n\nThis month's Most Valuable Person (MVP) is\nCornelius Ludmann\n\nCornelius added support\nfor opening code changes directly in Gitpod when viewing a merge request. In fact, this\nrelease blog post was created and edited with Gitpod! Cornelius initially helped add an\noption to open a project in Gitp…",
          "link": "https://about.gitlab.com/releases/2021/08/22/gitlab-14-2-released/",
          "publishedOn": "2021-08-22T00:00:00.000Z",
          "wordCount": 7123,
          "title": "GitLab 14.2 released with the Build Cloud for macOS beta and Markdown preview"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/08/20/how-grammatech-and-gitlab-enables-better-devsecops/",
          "author": null,
          "description": "Software development teams that embrace agile and DevSecOps are able to code with a security-first mindset, which is essential for industries that build particularly complicated products where security is paramount, like: Aerospace and defense, automotive, industrial controls, medical devices, and more.\nStatic application security testing (SAST) solutions, like CodeSonar® from GrammaTech, integrate directly into CI/CD pipelines to bake security into every step of the software development life cycle (SDLC) – protecting your products every step of the way. Security solutions like GrammaTech pair well with an all-in-one DevOps Platform like GitLab, and allow development teams to follow best practices and industry standards to develop code that is better quality and more secure.\nThe GrammaTech…",
          "link": "https://about.gitlab.com/blog/2021/08/20/how-grammatech-and-gitlab-enables-better-devsecops/",
          "publishedOn": "2021-08-20T00:00:00.000Z",
          "wordCount": 2606,
          "title": "How a new integration helps GitLab customers secure their code"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/08/19/introducing-spamcheck-data-driven-anti-abuse/",
          "author": null,
          "description": "Spam and abuse are a very real concern for us at GitLab – and likely every company providing services at scale. That's why our Trust and Safety team works hard every day to detect, mitigate, and lessen the effects of spam. Back in October 2020, the GitLab Security team detailed some of the ways they combat spam and abuse and referenced new approaches we were developing and testing to help us better detect and prevent spam.\nWe're excited to introduce Spamcheck, our new anti-spam engine. Spamcheck has been enabled for all projects on GitLab.com, which runs 14.1, and will be included in the 14.2 release for GitLab self-managed coming on August 22.\nThis tool was designed, tested and integrated by our GitLab Security Automation team (with amazing partnership from our Trust and Safety team and o…",
          "link": "https://about.gitlab.com/blog/2021/08/19/introducing-spamcheck-data-driven-anti-abuse/",
          "publishedOn": "2021-08-19T00:00:00.000Z",
          "wordCount": 3131,
          "title": "Introducing Spamcheck: A data-driven, anti-abuse engine"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/08/18/what-the-solarwinds-attack-can-teach-us-about-devsecops/",
          "author": null,
          "description": "One of the cybersecurity keywords for 2021 will undoubtedly be \"software supply chain attacks\". For decades, we've seen a global move toward connected systems and highly complex supply chains. Today these supply chains are under attack, with malicious actors jeopardizing the sensitive data of millions of users through attacks on the public and private sectors.\nAfter public and federal entities were targeted in some high-profile supply chain attacks, the United States government released an executive order with plans to improve the security posture of the nation when it comes to software supply chains. The UK issued a similar call for views on cybersecurity in supply chains around the same time.\nSupply chain security became a global priority after the SolarWinds attack, reminding businesses…",
          "link": "https://about.gitlab.com/blog/2021/08/18/what-the-solarwinds-attack-can-teach-us-about-devsecops/",
          "publishedOn": "2021-08-18T00:00:00.000Z",
          "wordCount": 2920,
          "title": "How DevSecOps can protect businesses from future supply chain attacks"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/08/17/100-runners-in-less-than-10mins-and-less-than-10-clicks/",
          "author": null,
          "description": "Managing elastically scaled or highly available compute infrastructures is one of the key challenges the cloud was built for. Application scaling concerns can be handled by cloud services that are purpose designed, rigorously tested, and continually improved. This article dives into some specific enablement automation that brings the benefits of AWS Autoscaling Groups (ASG) to runner management. There are benefits to both the largest fleets and single instance runners.\nEmbedded in this article is a YouTube video that demonstrates the deployment of 100 GitLab runners on Amazon EC2 Spot compute in less than 10 minutes using less than 10 clicks. The video also shows updating this entire fleet in under 10 minutes to emphasize the time savings of built-in maintenace.\nThe information and automat…",
          "link": "https://about.gitlab.com/blog/2021/08/17/100-runners-in-less-than-10mins-and-less-than-10-clicks/",
          "publishedOn": "2021-08-17T00:00:00.000Z",
          "wordCount": 5291,
          "title": "How to provision 100 AWS Graviton GitLab Spot Runners in 10 Minutes for $2/hour"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/08/17/gitlab-14-1-3-released/",
          "author": null,
          "description": "Today we are releasing version 14.1.3 for GitLab Community Edition and Enterprise Edition.\nThis version resolves a number of regressions and bugs in\nlast month's 14.1 release and\nprior versions.\nGitLab Community Edition and Enterprise Edition\nAS Fix SAML SSO login redirects not working\nBump kas to v14.1.1\nResolve operator does not exist: integer[] || bigint in app/models/namespace/traversal_hierarchy.rb\nGeo 2.0 Regression - Add ability to remove primary\nAdd AES256-GCM-SHA384 to allowed list of Nginx SSL ciphers\nImportant notes on upgrading\nThis version does not include any new migrations, and for multi-node deployments, should not require any downtime.\nPlease be aware that by default the Omnibus packages will stop, run migrations,\nand start again, no matter how “big” or “small” the upgrade is. This behavior\ncan be changed by adding a /etc/gitlab/skip-auto-reconfigure file,\nwhich is only used for updates.\nUpdating\nTo update, check out our update page.\nGitLab subscriptions\nAccess to GitLab Premium and Ultimate features is granted by a paid subscription.\nAlternatively, sign up for GitLab.com\nto use GitLab's own infrastructure.",
          "link": "https://about.gitlab.com/releases/2021/08/17/gitlab-14-1-3-released/",
          "publishedOn": "2021-08-17T00:00:00.000Z",
          "wordCount": 1021,
          "title": "GitLab Patch Release: 14.1.3"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/08/13/understand-highly-technical-spaces/",
          "author": null,
          "description": "As a designer, you're lucky when you get to design an application you're familiar with, such as a supermarket app or a travel website – something we might have already used or even use every day. Most of the time, we are tasked with designing an application or technology that's unfamiliar or highly technical. Sometimes, we may not know what the application we're designing is used for, like creating an interface for an MRI machine controlled by a doctor, or a dashboard used by a professional musician – knowing what all the buttons do is already an achievement.\nOne of the trickiest questions for designers is understanding exactly how much you need to know how to use an application to design the best system for the user. This conundrum is typical for designers that work in a highly technical,…",
          "link": "https://about.gitlab.com/blog/2021/08/13/understand-highly-technical-spaces/",
          "publishedOn": "2021-08-13T00:00:00.000Z",
          "wordCount": 2581,
          "title": "How I use analogy to design for highly technical spaces"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/08/13/five-great-phabricator-features-inspired-gitlab/",
          "author": null,
          "description": "Innovation often happens because competition sparks new ideas. We unpack how Phabricator inspired GitLab to add new features.\nTurning back time a bit, what exactly is Phabricator? Built on the concept of web-based applications, Phabricator enables developers to collaborate with code reviews, repository browser, change monitoring, bug tracking and wiki. On May 29, 2021, Phacility, the maintainer and sponsor of Phabricator announced end-of-life and stopped maintaining Phabricator.\nGitLab co-founder and CEO, Sid Sijbrandij gives credit to Phabricator on HackerNews:\nPhabricator was an inspiration to me when starting GitLab. It is shutting down now. Many of its features were years ahead of its time and there was a lot of humor in the product. As a tribute to it shall we add Clowcoptarize as a w…",
          "link": "https://about.gitlab.com/blog/2021/08/13/five-great-phabricator-features-inspired-gitlab/",
          "publishedOn": "2021-08-13T00:00:00.000Z",
          "wordCount": 4052,
          "title": "5 Great Phabricator features that inspired GitLab"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/08/10/how-to-agentless-gitops-aws/",
          "author": null,
          "description": "In part two of our GitOps series, we described how to use a push-based (or agentless) approach for GitOps by using GitLab scripting capabilities as well as integrating infrastructure-as-code tools into GitOps pipelines. In this third blog post, we’ll also dig deep into how to use a push-based approach, but this time our focus will be on the integrations of Terraform, AWS ECS, and AWS EC2 in GitOps flows. This approach may be preferable when using infrastructure components that aren't Kubernetes, such as VMs, physical devices, and cloud-provider services.\nSimilar to Ansible – an agentless IT automation solution – Terraform can be leveraged by the scripting capabilities of GitLab to shape your infrastructure. GitLab also provides out-of-the-box integrations with Terraform, such as GitLab-man…",
          "link": "https://about.gitlab.com/blog/2021/08/10/how-to-agentless-gitops-aws/",
          "publishedOn": "2021-08-10T00:00:00.000Z",
          "wordCount": 3924,
          "title": "How to use a push-based approach for GitOps with Terraform and AWS ECS and EC2"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/08/10/gitlab-13-12-10-released/",
          "author": null,
          "description": "Today we are releasing version 13.12.10 for GitLab Community Edition and Enterprise Edition.\nThis version resolves a number of regressions and bugs in\nMay's 13.12 release and\nprior versions.\nGitLab Community Edition and Enterprise Edition\nAvailable in GitLab Free, Premium, and Ultimate:\nFix: Sidekiq workers delete each other's metrics\nDo not create audit event for failed logins on read-only DB\nFix validation method regarding MIME type keys\nResolve \"operator does not exist\" in app/models/namespace/traversal_hierarchy.rb\ngitlab-rails: checks/postgresql detect silent NoDatabaseError\nAdding -ubi8 to version to find UBI images\nImportant notes on upgrading\nThis version does not include any new migrations, and for multi-node deployments, should not require any downtime.\nPlease be aware that by default the Omnibus packages will stop, run migrations,\nand start again, no matter how “big” or “small” the upgrade is. This behavior\ncan be changed by adding a /etc/gitlab/skip-auto-reconfigure file,\nwhich is only used for updates.\nUpdating\nTo update, check out our update page.\nGitLab subscriptions\nAccess to GitLab Premium and Ultimate features is granted by a paid subscription.\nAlternatively, sign up for GitLab.com\nto use GitLab's own infrastructure.",
          "link": "https://about.gitlab.com/releases/2021/08/10/gitlab-13-12-10-released/",
          "publishedOn": "2021-08-10T00:00:00.000Z",
          "wordCount": 1030,
          "title": "GitLab Patch Release: 13.12.10"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/08/09/five-ways-to-scale-remote-work/",
          "author": null,
          "description": "At GitLab, we believe that remote work at scale will define not only the future of work, but the future of living. We created REMOTE by GitLab to bring together the remote work community and answer the questions many companies are asking: \"How do we do this, and what's next?\"\nWe heard from some of the top leaders in remote work, from large companies that made the decision to leave the office behind, to teams of experts who have been studying the organizational design for years.\nWe share five lessons from the REMOTE by GitLab event that your team can apply to uplevel your remote practices and culture.\nSet guiding principles for your remote transition (and stick to them)\nAs you navigate the changes that come with implementing remote-first practices, it's important to have a set of values and…",
          "link": "https://about.gitlab.com/blog/2021/08/09/five-ways-to-scale-remote-work/",
          "publishedOn": "2021-08-09T00:00:00.000Z",
          "wordCount": 2136,
          "title": "5 Ways to scale remote work on your team"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/08/05/achieving-23-cost-savings-and-36-performance-gain-using-gitlab-and-gitlab-runner-on-arm-neoverse-based-aws-graviton2-processor/",
          "author": null,
          "description": "Companies in all industries and sectors have significantly invested in digital transformation and increased their software development capabilities. GitLab delivers modern DevOps with a complete DevOps platform. However, some organizations require self-managed GitLab and GitLab Runners, which creates added costs for hosting and running GitLab infrastructure. Our latest cost analysis and performance benchmarks show that customers can realize cost savings of up to 23% and performance gains of up to 36% by deploying the GitLab application and GitLab Runner on the Arm-based Graviton2 when compared to the x86 based M5/C5 EC2 instances.\nArm is a leading provider of silicon intellectual property (IP) for intelligent systems-on-chip (SoC) that power billions of devices. GitLab and Arm have collabo…",
          "link": "https://about.gitlab.com/blog/2021/08/05/achieving-23-cost-savings-and-36-performance-gain-using-gitlab-and-gitlab-runner-on-arm-neoverse-based-aws-graviton2-processor/",
          "publishedOn": "2021-08-05T00:00:00.000Z",
          "wordCount": 2451,
          "title": "23% Cost savings and 36% performance gain by deploying GitLab on Arm-based AWS Graviton2"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/08/04/ubs-gitlab-devops-platform/",
          "author": null,
          "description": "UBS, the largest truly global wealth manager, uses GitLab to power DevCloud, a single DevOps Platform that allows for a cloud-based, service-oriented, software development lifecycle.\n\"GitLab is a fundamental part of DevCloud,\" said Rick Carey, Group Chief Technology Officer at UBS. \"We wouldn't be able to have that seamless experience without GitLab. It allowed us to pull ahead of many of our competitors, and break down the barriers between coding, testing, and deployment.\"\nDuring GitLab Virtual Commit 2021, Rick and Eric Johnson, Chief Technology Officer at GitLab, talked about how building DevCloud on GitLab's DevOps Platform allowed UBS to increase their development velocity, lower their infrastructure costs, and increase collaboration between engineers and non-engineering teams worldwi…",
          "link": "https://about.gitlab.com/blog/2021/08/04/ubs-gitlab-devops-platform/",
          "publishedOn": "2021-08-04T00:00:00.000Z",
          "wordCount": 2323,
          "title": "How UBS created their own open DevOps Platform using GitLab"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/08/03/welcome-to-the-devops-platform-era/",
          "author": null,
          "description": "DevOps has evolved since its infancy, over a decade ago. Swiss developmental psychologist Jean Piaget believed human cognitive development has four stages (sensorimotor, preoperational, concrete operational, and formal operational). Through each of these stages, the human mind obtains new knowledge while building and modifying memories to inform one's understanding of the world around them.\nIn the same way that people go through stages as they grow, markets and industries also go through stages of development. Over the years, DevOps has grown into a mature, business-critical practice.\nAs the DevOps industry expanded, so did the number and complexity of tool-project integrations within an organization. This was the result of three developments in DevOps:\nCompanies moved from monolithic arch…",
          "link": "https://about.gitlab.com/blog/2021/08/03/welcome-to-the-devops-platform-era/",
          "publishedOn": "2021-08-03T00:00:00.000Z",
          "wordCount": 2914,
          "title": "Welcome to the DevOps Platform era"
        }
      ]
    },
    {
      "title": "Phoronix",
      "feedUrl": "https://www.phoronix.com/rss.php",
      "siteUrl": "https://www.phoronix.com/",
      "articles": [
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Chrome-93-Released",
          "author": null,
          "description": "Google is shipping Chrome 93 today as the latest stable version of their web browser...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Chrome-93-Released",
          "publishedOn": "2021-08-31T22:40:24.000Z",
          "wordCount": 873,
          "title": "Chrome 93 Released With WebOTP Cross-Device Support, CSS Module Scripts"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=OpenGL-ES-3.2-Zink",
          "author": null,
          "description": "Mike Blumenkrantz in addition to addressing that big performance problem with Tesseract and other Zink OpenGL-on-Vulkan improvements in recent days has now landed OpenGL ES 3.2 support...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=OpenGL-ES-3.2-Zink",
          "publishedOn": "2021-08-31T20:30:04.000Z",
          "wordCount": 787,
          "title": "Zink Now Achieves OpenGL ES 3.2 Atop Vulkan"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-Btrfs",
          "author": null,
          "description": "The Btrfs file-system updates have landed now in Linux 5.15 mainline with some exciting new features and improvements...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-Btrfs",
          "publishedOn": "2021-08-31T19:08:13.000Z",
          "wordCount": 984,
          "title": "Btrfs Adds Degenerate RAID Support, Performance Improvements With Linux 5.15"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=KSMBD-Lands-In-Linux-5.15",
          "author": null,
          "description": "One of the earliest pull requests sent in for the now-open Linux 5.15 cycle was proposing KSMBD land as the in-kernel SMB3 file server as an alternative on Linux systems to running Samba in user-space. At the time it wasn't clear if Linus Torvalds would pull in this file server code to the Linux kernel but now he has indeed landed it...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=KSMBD-Lands-In-Linux-5.15",
          "publishedOn": "2021-08-31T17:52:31.000Z",
          "wordCount": 851,
          "title": "KSMBD As An In-Kernel SMB3 File Server Merged For Linux 5.15"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=GNU-Linux-Libre-5.14",
          "author": null,
          "description": "GNU Linux-libre 5.14-gnu was released today as the project's re-base on the recently released Linux 5.14 upstream kernel. But prior supported GNU Linux-libre releases also had to be re-spun as it turned out this \"100% free software\" kernel was mistakenly leaving in some non-free kernel bits...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=GNU-Linux-Libre-5.14",
          "publishedOn": "2021-08-31T17:17:59.000Z",
          "wordCount": 960,
          "title": "GNU Linux-libre Was Mistakenly Including Non-Free Code, So Releases Now Re-Spun + 5.14"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30496",
          "author": null,
          "description": "It's been a while since last running benchmarks evaluating the performance of GCC's profile guided optimizations (PGO) for helping to optimize the performance. But stemming from the discussions around PGO'ing the Linux kernel (though that effort is stalled for now), several Phoronix readers inquired about seeing some fresh PGO figures with GCC 11. So here are such benchmarks of GCC 11 with the upcoming Ubuntu 21.10 running on an AMD Ryzen 9 5950X desktop.",
          "link": "https://www.phoronix.com/vr.php?view=30496",
          "publishedOn": "2021-08-31T13:16:23.000Z",
          "wordCount": 867,
          "title": "GCC 11 PGO With The AMD Ryzen 9 5950X For Faster Performance"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-Hardening",
          "author": null,
          "description": "With the Linux 5.15 kernel is a new build-time option to further harden the kernel around side channel attacks and information leakage. Enabling this option can have some (small) performance cost and a slightly larger kernel...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-Hardening",
          "publishedOn": "2021-08-31T12:30:00.000Z",
          "wordCount": 1006,
          "title": "Linux 5.15 Adds Another Knob To Harden Against Side Channel Attacks"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Con-Kolivas-EOL-MuQSS-CK",
          "author": null,
          "description": "Con Kolivas has worked on many patches for the Linux kernel over the past two decades and particularly focused on innovations around desktop performance/interactivity. For over a decade now he's primarily been focused on maintaining his work out-of-tree and not catering to mainline acceptance but now he is thinking of bowing out once more and ending his kernel development effort...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Con-Kolivas-EOL-MuQSS-CK",
          "publishedOn": "2021-08-31T10:30:00.000Z",
          "wordCount": 1075,
          "title": "Con Kolivas Contemplates Ending Kernel Development, Retiring MuQSS & -ck Patches"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-DRM-Pull",
          "author": null,
          "description": "David Airlie submitted today the Direct Rendering Manager (DRM) graphics/display driver updates for the Linux 5.15 merge window...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-DRM-Pull",
          "publishedOn": "2021-08-31T09:36:14.000Z",
          "wordCount": 936,
          "title": "Linux 5.15 Graphics Driver Changes Bring Intel DG2/Alchemist, XeHP, AMD Cyan Skillfish"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Zink-Fixing-Tesseract",
          "author": null,
          "description": "Going from ~11 FPS to ~602 FPS for an open-source game marks the latest work on Zink for OpenGL atop Vulkan within Mesa...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Zink-Fixing-Tesseract",
          "publishedOn": "2021-08-31T08:00:00.000Z",
          "wordCount": 815,
          "title": "Zink OpenGL-On-Vulkan Fixes Up Support For Another Game"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-x86-IRQ",
          "author": null,
          "description": "The x86/IRQ changes for the Linux 5.15 kernel bring some unexpected improvements to old hardware...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-x86-IRQ",
          "publishedOn": "2021-08-31T07:00:00.000Z",
          "wordCount": 748,
          "title": "Linux 5.15 In 2021 Is Still Improving Intel 486 Era Hardware Support"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=PREEMPT-RT-Locking-In-Linux-515",
          "author": null,
          "description": "It looks like the real-time (RT) patches for the Linux kernel are almost to the point of being fully upstream in the mainline Linux kernel. Merged for Linux 5.15 is the PREEMPT_RT locking code that represents a bulk of the outstanding RT patches...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=PREEMPT-RT-Locking-In-Linux-515",
          "publishedOn": "2021-08-30T23:30:00.000Z",
          "wordCount": 806,
          "title": "The PREEMPT_RT Locking Code Is Merged For Linux 5.15"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=RADV-Ray-Tracing-Near-Mainline",
          "author": null,
          "description": "It looks like within the coming days that the Vulkan ray-tracing support for Mesa's \"RADV\" Radeon Vulkan driver will be upstreamed for Mesa 21.3...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=RADV-Ray-Tracing-Near-Mainline",
          "publishedOn": "2021-08-30T20:20:00.000Z",
          "wordCount": 894,
          "title": "Experimental Ray-Tracing For Open-Source Radeon Vulkan Driver Nears Upstream Mesa"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-IO-3.5M-IOPS",
          "author": null,
          "description": "In addition to the block subsystem changes submitted for the Linux 5.15 merge window, Jens Axboe also sent in a separate pull request for this new kernel cycle to provide support for bio recycling. In turn this can enhance the Linux I/O limits by around 10%...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-IO-3.5M-IOPS",
          "publishedOn": "2021-08-30T19:00:00.000Z",
          "wordCount": 856,
          "title": "Linux 5.15 I/O Can Achieve Up To ~3.5M IOPS Per-Core"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Pyston-Joins-Anaconda",
          "author": null,
          "description": "Pyston began many years ago as an open-source JIT-based Python implementation developed by Dropbox. But after Dropbox dropped Pyston development, it went dormant for several years before the developers decided to create their own start-up around it and released Pyston 2.0. The Pyston developers are now joining well known Python organization Anaconda...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Pyston-Joins-Anaconda",
          "publishedOn": "2021-08-30T17:52:29.000Z",
          "wordCount": 804,
          "title": "Pyston Developers Join Anaconda To Continue Their Speedy Python Implementation"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-Block",
          "author": null,
          "description": "Linux block subsystem maintainer and I/O expert Jens Axboe sent in his set of feature pull requests today for the Linux 5.15 kernel cycle...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-Block",
          "publishedOn": "2021-08-30T17:39:18.000Z",
          "wordCount": 783,
          "title": "Linux 5.15 Block Changes From Removing LightNVM To Fixing Up The Floppy Driver"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-Scheduler",
          "author": null,
          "description": "Ingo Molnar began sending in his pull requests bright and early as usual for the just-opened Linux 5.15 merge window. With the scheduler changes for this next kernel version there are some improvements worth mentioning but also worth mentioning is what hasn't found its way to the kernel yet: any software optimizations around Intel Thread Director for upcoming Alder Lake processors...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-Scheduler",
          "publishedOn": "2021-08-30T13:00:00.000Z",
          "wordCount": 1199,
          "title": "Scheduler Changes For Linux 5.15 - Still No Sign Of Any Intel Thread Director Optimizations"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-L1d-Flushing-Mech",
          "author": null,
          "description": "Worked on for more than one year is the patches out of Amazon for allowing opt-in L1 data cache flushing on context switching. This L1d flushing is done in the name of greater security given the various CPU speculative execution hardware vulnerabilities these days and protecting against other possible future vulnerabilities. After trying to get the code merged last summer, Linus Torvalds called it \"beyond stupid\" and reverted the code but now for Linux 5.15 a revised form of it was submitted...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-L1d-Flushing-Mech",
          "publishedOn": "2021-08-30T12:00:00.000Z",
          "wordCount": 998,
          "title": "Opt-In L1 Cache Flushing To Try For Linux 5.15 To Help With The Paranoid, Future CPU Vulnerabilities"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Endeavour-OS-Better-Btrfs",
          "author": null,
          "description": "For those after an easy-to-use desktop distribution built off Arch Linux, Endeavour OS continues filling the void left by the former Antergos project. Endeavour OS is closing out August by releasing new ISOs that include a number of updates to its installer...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Endeavour-OS-Better-Btrfs",
          "publishedOn": "2021-08-30T09:57:37.000Z",
          "wordCount": 910,
          "title": "Endeavour OS ISOs Updated With Better Btrfs Support, Pacman Parallel Downloads"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=SMB3-KSMBD-Linux-5.15-PR",
          "author": null,
          "description": "One of the very first pull requests for Linux 5.15 now that its merge window is open following the Linux 5.14 release is to merge KSMBD, the in-kernel SMB3 protocol file server...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=SMB3-KSMBD-Linux-5.15-PR",
          "publishedOn": "2021-08-30T09:42:07.000Z",
          "wordCount": 970,
          "title": "In-Kernel SMB3 File Server Looks To Land In Linux 5.15"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Vulkan-1.2.190",
          "author": null,
          "description": "Vulkan 1.2.190 resolves several issues with the specification, but most exciting with this routine Vulkan API update is the introduction of two new extensions...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Vulkan-1.2.190",
          "publishedOn": "2021-08-30T04:00:00.000Z",
          "wordCount": 817,
          "title": "Vulkan 1.2.190 Released With SPIR-V Integer Dot Product Support"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.14-Released",
          "author": null,
          "description": "As expected Linus Torvalds promoted Linux 5.14 to stable in providing the latest features, hardware support, and other improvements ahead of the autumn 2021 Linux distribution releases...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.14-Released",
          "publishedOn": "2021-08-29T22:30:20.000Z",
          "wordCount": 951,
          "title": "Linux 5.14 Released With New Hardware Support, Core Scheduling, MEMFD_SECRET"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-HWMON-AMD-YC-WC",
          "author": null,
          "description": "The Linux hardware monitoring \"HWMON\" subsystem for the 5.15 cycle is already seeing the AMD SB-RMI driver and AMD Cezanne Zen 3 APU temperature monitoring while there was also some last-minute additions around AMD next-gen \"Yellow Carp\" temperature reporting and separately support for another water cooling pump...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-HWMON-AMD-YC-WC",
          "publishedOn": "2021-08-29T21:45:34.000Z",
          "wordCount": 1037,
          "title": "AMD Yellow Carp + Another Water Cooling Pump Head To Linux's Hardware Monitoring Code"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-Bz-WiFi-Linux-5.15",
          "author": null,
          "description": "While the Linux 5.15 merge window opening is imminent, merged today to net-next were the latest batch of wireless driver updates for this next kernel version. Notable to this batch of WiFi driver updates was the new Intel material...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-Bz-WiFi-Linux-5.15",
          "publishedOn": "2021-08-29T19:00:43.000Z",
          "wordCount": 810,
          "title": "Yet-To-Be-Released Intel \"Bz\" WiFi Chipset To Be Supported By Linux 5.15"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Floppy-Disk-Linux-5.15-Fix",
          "author": null,
          "description": "Near the beginning of the year was some rare work on Linux's floppy disk driver and -- a half-year later -- it was found out that not only do people with systems using floppy disks still move to newer kernels, but that work earlier in the year had regressed the Linux kernel's floppy disk handling. Now coming for Linux 5.15 is a fix...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Floppy-Disk-Linux-5.15-Fix",
          "publishedOn": "2021-08-29T17:48:15.000Z",
          "wordCount": 1007,
          "title": "Linux 5.15 To Fix Regression In Its Floppy Disk Driver"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-Features-Expected",
          "author": null,
          "description": "If all goes according to plan the Linux 5.14 kernel will be released as stable today. Linux 5.14 has many new features but there is also a lot of work slated for the next cycle, Linux 5.15. Here's a look...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-Features-Expected",
          "publishedOn": "2021-08-29T10:00:51.000Z",
          "wordCount": 1068,
          "title": "Some Of The Features Expected For Linux 5.15: DG2/Alchemist, BPF Timers, DAMON + More"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Chrome-Ozone-X11-Future",
          "author": null,
          "description": "The Chrome/Chromium web browser now has fully-enabled the Ozone/X11 platform support across both beta and stable channels...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Chrome-Ozone-X11-Future",
          "publishedOn": "2021-08-29T07:15:33.000Z",
          "wordCount": 835,
          "title": "Chrome/Chromium's Ozone X11 Code Now Fully Enabled, Old Legacy X11 Code To Be Removed"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Dell-Mario-On-AMD-Linux-Team",
          "author": null,
          "description": "Here should hopefully be a great indication about AMD's Linux efforts moving forward with one of their recent and exciting hires at the company...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Dell-Mario-On-AMD-Linux-Team",
          "publishedOn": "2021-08-28T13:30:00.000Z",
          "wordCount": 1276,
          "title": "A Prominent, Longtime Dell Linux Engineer Recently Joined AMD's Linux Team"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Mesh-Shaders-Mesa-Merged",
          "author": null,
          "description": "In preparation for the support within their Vulkan driver, the Intel-led effort for preparing mesh shader support within Mesa's NIR and SPIR-V code has now been merged...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Mesh-Shaders-Mesa-Merged",
          "publishedOn": "2021-08-28T11:00:00.000Z",
          "wordCount": 970,
          "title": "Intel Lands Initial Code For Mesh Shaders Within Mesa"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Wine-Staging-6.16",
          "author": null,
          "description": "It's been a relatively quiet summer in the Wine-Staging world with not many new patches surfacing for testing/experimental purposes for this more bleeding edge version of Wine. However, with Wine-Staging 6.16 there are at least some new patches now to talk about...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Wine-Staging-6.16",
          "publishedOn": "2021-08-28T09:44:01.000Z",
          "wordCount": 794,
          "title": "Wine-Staging 6.16 Implements Two More D3DX Functions To Help Some Windows Games"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=KDE-Plasma-5.23-Looking-Good",
          "author": null,
          "description": "The Plasma 5.23 desktop release is looking like it will be quite an eventful milestone while KDE developers are finishing August strong with many improvements and fixes across their desktop stack...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=KDE-Plasma-5.23-Looking-Good",
          "publishedOn": "2021-08-28T09:32:11.000Z",
          "wordCount": 876,
          "title": "KDE Plasma 5.23 Will Be Another Exciting Release With Many Improvements Abound"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30491",
          "author": null,
          "description": "Earlier this month was a look at the LLVM Clang 13 performance on EPYC 7003 showing this forthcoming compiler update to be in good shape for AMD Zen 3, but how is the performance looking on the Intel side? This round of benchmarking is looking at the LLVM Clang 11 / 12 / 13 compiler performance on Intel's flagship Xeon Platinum 8380 \"Ice Lake\" 2P server configuration.",
          "link": "https://www.phoronix.com/vr.php?view=30491",
          "publishedOn": "2021-08-26T13:20:00.000Z",
          "wordCount": 940,
          "title": "LLVM Clang 13 Performance Is In Great Shape For Intel Xeon \"Ice Lake\""
        }
      ]
    }
  ],
  "cliVersion": "1.11.0"
}