{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": [
        {
          "id": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.1",
          "author": null,
          "description": "Fixed: Unexpected nested element in author field crashes the parser\nThank you @ad-m",
          "link": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.1",
          "publishedOn": "2021-09-16T06:39:32.000Z",
          "wordCount": 343,
          "title": "v1.11.1"
        }
      ]
    },
    {
      "title": "GitLab",
      "feedUrl": "https://about.gitlab.com/atom.xml",
      "siteUrl": "https://about.gitlab.com/blog/",
      "articles": [
        {
          "id": "https://about.gitlab.com/blog/2021/09/23/best-practices-customer-feature-request/",
          "author": null,
          "description": "Effectively communicating a customer’s private needs to product teams is essential to a product’s success, but it can be a tricky undertaking.\nTeams can face several challenges in communicating and tracking customers' requests, including protecting customer confidentiality, tracking priority and progress, and making sure the product team is getting actionable feedback that can be incorporated into product milestones.\nThis blog post shares GitLab's best practices and lessons learned, as well as a video conversation between GitLab CEO Sid Sijbrandij and Fleet CEO Mike McNeil.\nIn line with GitLab's open core model and transparency value, our product roadmap is public and the product team uses public issue trackers for feature requests and to plan the work. Because the issues are public, custo…",
          "link": "https://about.gitlab.com/blog/2021/09/23/best-practices-customer-feature-request/",
          "publishedOn": "2021-09-23T00:00:00.000Z",
          "wordCount": 2530,
          "title": "How to incorporate private customer needs into a public product roadmap"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/09/23/have-devops-jobs-to-fill-try-these-3-strategies-to-hire-and-retain/",
          "author": null,
          "description": "If every company is a software company, how do you stand out from the crowd when it comes to attracting developer talent and filling DevOps jobs?\nThere’s a well-known, and worldwide, shortage of software developers, especially those with expertise in DevOps. Worse still, demand for those roles is accelerating rapidly: The US Bureau of Labor Statistics predicts employment opportunities for devs and testers will increase 22% between 2020 and 2030. That growth rate means nearly 190,000 net new developer/QA/test jobs will be opening each year, according to the BLS.\nThat’s all a long way of saying things are tough out there. Organizations looking to expand, or even just maintain, their DevOps jobs momentum have to find unique ways to stand out from the crowd because, as many surveys have shown,…",
          "link": "https://about.gitlab.com/blog/2021/09/23/have-devops-jobs-to-fill-try-these-3-strategies-to-hire-and-retain/",
          "publishedOn": "2021-09-23T00:00:00.000Z",
          "wordCount": 1992,
          "title": "Have DevOps jobs to fill? Try these 3 strategies to hire and retain"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/09/22/gitlab-13-12-12-released/",
          "author": null,
          "description": "Today we are releasing version 13.12.12 for GitLab Community Edition and Enterprise Edition.\nThis version resolves a number of regressions and bugs in\nthe 13.12 release and\nprior versions.\nGitLab Community Edition and Enterprise Edition\nDerive virtual storage's filesystem id from its name\nAllow Raspberry Pi builds on Graviton\nStop pinning versions of perl related packages in UBI images\nImportant notes on upgrading\nThis version does not include any new migrations, and for multi-node deployments, should not require any downtime.\nPlease be aware that by default the Omnibus packages will stop, run migrations,\nand start again, no matter how “big” or “small” the upgrade is. This behavior\ncan be changed by adding a /etc/gitlab/skip-auto-reconfigure file,\nwhich is only used for updates.\nUpdating\nTo update, check out our update page.\nGitLab subscriptions\nAccess to GitLab Premium and Ultimate features is granted by a paid subscription.\nAlternatively, sign up for GitLab.com\nto use GitLab's own infrastructure.",
          "link": "https://about.gitlab.com/releases/2021/09/22/gitlab-13-12-12-released/",
          "publishedOn": "2021-09-22T00:00:00.000Z",
          "wordCount": 1037,
          "title": "GitLab Patch Release: 13.12.12"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/09/22/gitlab-14-3-released/",
          "author": null,
          "description": "Today, we are excited to announce the release of GitLab 14.3 with project-level security scan execution policies, next generation SAST to reduce Ruby false positives, group-level permissions for protected environments, group access for the GitLab Kubernetes Agent, and much more!\nThese are just a few highlights from the 40+ improvements in this release. Read on to check out all of the great updates below.\nTo preview what's coming in next month’s release, check out our Upcoming Releases page, which includes our 14.4 release kickoff video.\nJoin us for an upcoming event\n\n\n\n\n\n\n\n\n\nThis month's Most Valuable Person (MVP) is\nfeistel\n\n@feistel started contributing to GitLab Pages in September 2020. In the last 4 months, they have made continuous contributions to improve Pages by adding features, fi…",
          "link": "https://about.gitlab.com/releases/2021/09/22/gitlab-14-3-released/",
          "publishedOn": "2021-09-22T00:00:00.000Z",
          "wordCount": 6022,
          "title": "GitLab 14.3 releases Project Security Policies & Next Gen SAST"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/09/21/how-the-devops-platform-makes-building-accessible-software-easier/",
          "author": null,
          "description": "The earlier a feature or process is introduced in the multi-step software development lifecycle (SDLC), the more likely it is to be fully integrated into the product.\nIt's well documented how security can shift left using a DevOps platform, so it's time to make the case that accessbility needs to be thought about earlier (and, clearly, a DevOps platform can facilitate that too). Although there are laws that require applications to meet certain accessibility requirements, which opens an application up to a broader user base, rarely is accessibility considered a core product requirement. Instead, it is just a test tacked on at the end instead of being built into the DevOps platform process.\n[Learn more about how the open source development community helps build accessible software]\n\"The prob…",
          "link": "https://about.gitlab.com/blog/2021/09/21/how-the-devops-platform-makes-building-accessible-software-easier/",
          "publishedOn": "2021-09-21T00:00:00.000Z",
          "wordCount": 2844,
          "title": "It's time to build more accessible software. A DevOps platform can help"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/09/21/introducing-markdown-live-preview/",
          "author": null,
          "description": "Fostering better, more meaningful collaboration is an integral part of DevOps and a key part of what GitLab, the complete DevOps Platform, unlocks for developers and their teams. While many developers or engineers feel more comfortable working locally on their machines and spend a majority of their time using a CLI to push code changes, with GitLab you can also use the Web Editor or Web IDE to collaborate and edit content in a much easier, faster, and approachable way.\nStarting in GitLab 14.2, editing Markdown content in the Web Editor or Web IDE just got even better.\nIntroducing the realtime Preview Markdown editor\nGitLab Flavored Markdown automatically renders Markdown content in an easy-to-read and easy-to-write plain text language. Although Markdown is inherently more “human-readable” …",
          "link": "https://about.gitlab.com/blog/2021/09/21/introducing-markdown-live-preview/",
          "publishedOn": "2021-09-21T00:00:00.000Z",
          "wordCount": 1602,
          "title": "GitLab's realtime Preview Markdown is an editor for everyone"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/09/17/gitlab-14-2-4-released/",
          "author": null,
          "description": "Today we are releasing version 14.2.4 for GitLab Community Edition and Enterprise Edition.\nThis version resolves a number of regressions and bugs in\nlast month's 14.2 release and\nprior versions.\nGitLab Community Edition and Enterprise Edition\nAvailable in GitLab Free, Premium, and Ultimate:\nRemoves cleanup job from Terraform.latest\nRun AWS Release rake task only if on latest stable tag\nFix Elastic::MigrationWorker current_migration\nDerive virtual storage's filesystem id from its name\nImportant notes on upgrading\nThis version does not include any new migrations, and for multi-node deployments, should not require any downtime.\nPlease be aware that by default the Omnibus packages will stop, run migrations,\nand start again, no matter how “big” or “small” the upgrade is. This behavior\ncan be changed by adding a /etc/gitlab/skip-auto-reconfigure file,\nwhich is only used for updates.\nUpdating\nTo update, check out our update page.\nGitLab subscriptions\nAccess to GitLab Premium and Ultimate features is granted by a paid subscription.\nAlternatively, sign up for GitLab.com\nto use GitLab's own infrastructure.",
          "link": "https://about.gitlab.com/releases/2021/09/17/gitlab-14-2-4-released/",
          "publishedOn": "2021-09-17T00:00:00.000Z",
          "wordCount": 1056,
          "title": "GitLab Patch Release: 14.2.4"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/09/15/qpage-on-the-devops-platform/",
          "author": null,
          "description": "Deployment automation is essential for any company involved in software development to stay competitive. QPage, a company that provides an end-to-end sourcing and recruitment solution for SMEs, realized it quickly and migrated to GitLab’s DevOps Platform to accelerate their deployment process.\nWe spoke with Pouya Lotfi, the co-founder of QPage, to see how they use GitLab at QPage and how it has helped the company.\nWhy GitLab?\nQPage was initially using a local bespoke CI/CD for about the first two months, but they soon realized they needed a more professional DevOps Platform system. Because Pouya and the team at QPage had already used GitLab at a previous employer, they knew it would be the right fit. So, they didn’t consider other options and opted for GitLab straight away.\nEverything you …",
          "link": "https://about.gitlab.com/blog/2021/09/15/qpage-on-the-devops-platform/",
          "publishedOn": "2021-09-15T00:00:00.000Z",
          "wordCount": 2254,
          "title": "How QPage achieved automatic deployment and efficiency using the GitLab DevOps Platform"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/09/14/gitlab-together-with-terratag-open-source-to-help-you-manage-terraform-resources/",
          "author": null,
          "description": "When using infrastructure as code (IaC) on a public cloud provider, it's important to use tags and labels to organize your IaC using their complementary services. Terratag, an open source project developed by env0, can be used with Terraform and placed on top of the GitLab CI/CD platform, making tagging and labeling IaC easier and more efficient.\nGitLab and Terraform make it easy to tag and label infrastructure as code.\nInside your toolbox\nGitLab the industry's leading DevOps platform. Not long ago, we announced the ability to control Terraform deployments, remote state management, private module registry, and merge request integration for Terraform. This gives users a range of solutions for running CI/CD for Terraform code and managing it on a large scale.\nTerraform is the most widely ado…",
          "link": "https://about.gitlab.com/blog/2021/09/14/gitlab-together-with-terratag-open-source-to-help-you-manage-terraform-resources/",
          "publishedOn": "2021-09-14T00:00:00.000Z",
          "wordCount": 3837,
          "title": "How to use Terratag to automatically manage tags and labels for your Terraform Code"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/09/13/lessons-weet-learned-lokalise/",
          "author": null,
          "description": "As a GitLab customer, Weet has fully invested in the premise of \"Iterate faster, innovate together.\" Weet has a low tolerance for processes that don't keep pace with the way they develop and launch. One important process that was slowing the business down – localizing their app.\nLocalization is a key way to drive growth and accelerate product adoption. When done poorly, localization or l10n, as it's commonly known, can slow down your development process, introduce bugs, and make it cumbersome to launch updates. When done right, teams can smooth out the process and continuously localize their app. We unpack how Weet conquered its localization problems using GitLab and Lokalise.\nWhat is Weet?\nWeet is an asynchronous video communication tool designed to reduce the need for meetings. By combin…",
          "link": "https://about.gitlab.com/blog/2021/09/13/lessons-weet-learned-lokalise/",
          "publishedOn": "2021-09-13T00:00:00.000Z",
          "wordCount": 2868,
          "title": "How Weet integrates localization into the GitLab pipeline with Lokalise"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/09/10/setting-up-the-k-agent/",
          "author": null,
          "description": "The GitLab Kubernetes Agent (agentk) is an active in-cluster component for solving GitLab and Kubernetes integration tasks in a secure and cloud native way. The agentk communicates to the GitLab Kubernetes Agent Server (kas) to perform GitOps operations.\nIn many examples, we see the agent being deployed with global-level permissions on your cluster. There are use cases where we want to reduce the scope of what agentk has access to. In this guide I will provide information on deploying agentk on your cluster, limiting what namespaces it can access, as well as using it to deploy your applications.\nPrefer a video? Watch the walkthrough below to learn how to deploy agentk to your cluster:\n\n\nHow it works\nAnytime a developer performs changes to a manifest file managed within GitLab, the agentk w…",
          "link": "https://about.gitlab.com/blog/2021/09/10/setting-up-the-k-agent/",
          "publishedOn": "2021-09-10T00:00:00.000Z",
          "wordCount": 4016,
          "title": "How to deploy the GitLab Kubernetes Agent with limited permissions"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/09/10/adopt-agile-and-devops-for-ibm-z/",
          "author": null,
          "description": "As more organizations adopt open source software, DevOps and cloud computing, teams are moving towards a hybrid approach to application development and deployments. This is a particular challenge for siloed mainframe development teams that typically work within their own development tools – and those tools are are not the same ones used by their distributed developer counterparts. These disparate toolsets are not integrated between build, package, test, and deploy steps. GitLab aims to provide a unified enterprise-wide DevOps platform with enhanced support for IBM z/OS® applications. Here are three critical areas to focus on that can help bridge the gap between mainframe and \"modern\" DevOps development.\nCommon workflows for hybrid environments\nDevOps is naturally aligned to Agile processes…",
          "link": "https://about.gitlab.com/blog/2021/09/10/adopt-agile-and-devops-for-ibm-z/",
          "publishedOn": "2021-09-10T00:00:00.000Z",
          "wordCount": 2348,
          "title": "The benefits of DevOps practices for IBM Z"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/09/09/5-code-review-features/",
          "author": null,
          "description": "This is the second in a series of blog posts looking at the challenges of code review and the ways a DevOps platform can help. Read the first post.\nCode review can be one of the most deceivingly difficult things in delivering software faster. Given the high stakes involved, we've made some key additions to our DevOps Platform that focus on making the code review process as seamless and effective as possible. We believe the number one way to make code reviews effective is to provide context. Too often we think of code reviews as only \"reading\" and commenting on others' code - but what a good code reviewer does is understand the entire context of the proposed change. Context-driven code reviews should include factors like the issue that spurred on the change, how the change impacts non-obvio…",
          "link": "https://about.gitlab.com/blog/2021/09/09/5-code-review-features/",
          "publishedOn": "2021-09-09T00:00:00.000Z",
          "wordCount": 2691,
          "title": "How GitLab's 5 new code review features will make life easier"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/09/08/making-the-case-for-a-devops-platform-what-data-and-customers-say/",
          "author": null,
          "description": "In the struggle to release safer software faster, development teams are increasingly choosing a DevOps platform to help them get there. In our 2021 Global DevSecOps Survey we asked respondents what their DevOps practices included and a \"DevOps platform\" was among the top four choices, right next to CI/CD, test automation, and DevSecOps.\nWe're of course bullish on the idea of a DevOps platform, but we're far from alone. Here's a fresh look at how the data – and the customers – support the optimistic trajectory of a DevOps platform.\nDevOps is hot\nThe DevOps market was worth $6 billion in 2020, according to Global Industry Analysts, and five-year growth forecasts range from $17 billion to as much as $23 billion, depending on the firm. \n[Watch a deep dive into GitLab's DevOps Platform]\nThis pr…",
          "link": "https://about.gitlab.com/blog/2021/09/08/making-the-case-for-a-devops-platform-what-data-and-customers-say/",
          "publishedOn": "2021-09-08T00:00:00.000Z",
          "wordCount": 2123,
          "title": "Making the case for a DevOps platform: What data and customers say"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/09/08/write-vulnerability-detection-rules/",
          "author": null,
          "description": "In summer 2021, the Vulnerability Research and Static Analysis\nteams launched the Google Summer of Code (GSoC) project: Write vulnerability detection rules for SAST.\nFor this project, we built and implemented a framework to helps transition GitLab away from our current SAST tools over to Semgrep. Semgrep is a language-agnostic SAST tool that is gaining popularity in CI/CD environments.\nBefore replacing an analyzer with the corresponding Semgrep configuration (called rule-sets), we need to ensure that they are equivalent – in that they yield the same set of findings.\nFor this purpose, we built a testing framework that helps us assess the quality of a Semgrep rule-set. This framework has been used to guide the replacement of flawfinder, a C/C++ analyzer with a corresponding Semgrep rule-set.…",
          "link": "https://about.gitlab.com/blog/2021/09/08/write-vulnerability-detection-rules/",
          "publishedOn": "2021-09-08T00:00:00.000Z",
          "wordCount": 5402,
          "title": "How to write and continuously test vulnerability detection rules for SAST"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/09/07/why-are-developers-vulnerable-to-driveby-attacks/",
          "author": null,
          "description": "As someone who spends a lot of time working with computers, I know how easy it is to grow over-confident with regards to security. My systems are patched, my firewall rules are tight, and I’m vigilant when it comes to just about anything that looks out of the ordinary.\nNo one’s hacking their way into my workstation, that’s for sure.\nBut my experience working as a hacker myself has shown me that the opposite is often true. Those of us who are more technical are often much more vulnerable to an attack due to the complexity of our working environments.\nIn this blog, we’re going to dive into the anatomy of something called a “drive-by attack,” where malicious code hidden within a website uses your own browser to attack your computer.\nAs an example, I’ll show you how our own Red Team was able t…",
          "link": "https://about.gitlab.com/blog/2021/09/07/why-are-developers-vulnerable-to-driveby-attacks/",
          "publishedOn": "2021-09-07T00:00:00.000Z",
          "wordCount": 6130,
          "title": "Why are developers so vulnerable to drive-by attacks?"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/09/03/the-code-review-struggle-is-real-heres-what-you-need-to-know/",
          "author": null,
          "description": "When making a list of the reasons to consider moving to a DevOps Platform, don't forget about code review, a critical piece of the process that's also an incredible source of frustration and delays to developers and their teams.\nIn our 2021 Global DevSecOps Survey, respondents told us code quality was the number one reason they chose DevOps. But, when asked what was most likely to delay a product release, code review – vital to code quality – was one of the top four culprits (the others were testing, planning and code development). \nThe fact that code review is a pain point is hardly surprising, given that it can often require context-switching, communication, collaboration, and of course subject matter expertise. At a time when it's never been more urgent to release secure code as quickly…",
          "link": "https://about.gitlab.com/blog/2021/09/03/the-code-review-struggle-is-real-heres-what-you-need-to-know/",
          "publishedOn": "2021-09-03T00:00:00.000Z",
          "wordCount": 2301,
          "title": "The code review struggle is real. Here's what you need to know"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/09/02/the-journey-to-a-devops-platform/",
          "author": null,
          "description": "In a recent blog post about the importance of a DevOps Platform, GitLab CEO Sid Sijbrandij outlined four phases through which organizations frequently travel as their practice matures. It’s a painful journey we see again and again when we meet new customers. It spans every industry and every company size, and it’s the most mature DevOps teams with the most at stake who’ve felt the most pain. \nHistorically, if you wanted DevOps to work, you had to be prepared to pay for it. Just managing the backbone of DevOps – the toolchain -– has been a grind. Your “Jenkins Team,” your “GitHub Team,” or even, as one of our customers described, your “Duct Tape Team” (designed to hold it all together and patch holes), added no end value beyond keeping everything from falling apart. That’s a lot of investme…",
          "link": "https://about.gitlab.com/blog/2021/09/02/the-journey-to-a-devops-platform/",
          "publishedOn": "2021-09-02T00:00:00.000Z",
          "wordCount": 2124,
          "title": "The journey to a DevOps Platform"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/09/02/specialized-sidekiq-configuration-lessons-from-gitlab-dot-com/",
          "author": null,
          "description": "Sidekiq in GitLab works perfectly well out-of-the-box in most use cases, but it requires a little more attention in larger deployments or other specialized cases. We've learned a lot about how to configure Sidekiq in large deployments by maintaining GitLab.com – one of the largest instances of GitLab in existence. We added some critical features to GitLab.com in the past year to make it easier to configure Sidekiq in a manner more consistent with the maintainer's guidance, having strayed from this path for some time.\nWe are publishing two blog posts devoted to this topic. In this first post, we will unpack how we configured Sidekiq for GitLab.com, and in our second post, we will explain how to apply this to your GitLab instance.\n[Learn more about how we iterated on Sidekiq background jobs]…",
          "link": "https://about.gitlab.com/blog/2021/09/02/specialized-sidekiq-configuration-lessons-from-gitlab-dot-com/",
          "publishedOn": "2021-09-02T00:00:00.000Z",
          "wordCount": 5327,
          "title": "What we learned about configuring Sidekiq from GitLab.com"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/09/02/gitlab-13-12-11-released/",
          "author": null,
          "description": "Today we are releasing version 13.12.11 for GitLab Community Edition and Enterprise Edition.\nThis version resolves a number of regressions and bugs in\nthe 13.12 release and\nprior versions.\nGitLab Community Edition and Enterprise Edition\nThe main purpose of this release is to resolve high CPU usage by the Gitaly\nserver:\nOnly activate Git pack-objects hook if cache is enabled\nBackport improved replication logic\nImportant notes on upgrading\nThis version does not include any new migrations, and for multi-node deployments, should not require any downtime.\nPlease be aware that by default the Omnibus packages will stop, run migrations,\nand start again, no matter how “big” or “small” the upgrade is. This behavior\ncan be changed by adding a /etc/gitlab/skip-auto-reconfigure file,\nwhich is only used for updates.\nUpdating\nTo update, check out our update page.\nGitLab subscriptions\nAccess to GitLab Premium and Ultimate features is granted by a paid subscription.\nAlternatively, sign up for GitLab.com\nto use GitLab's own infrastructure.",
          "link": "https://about.gitlab.com/releases/2021/09/02/gitlab-13-12-11-released/",
          "publishedOn": "2021-09-02T00:00:00.000Z",
          "wordCount": 1044,
          "title": "GitLab Patch Release: 13.12.11"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/09/02/gitlab-14-0-10-released/",
          "author": null,
          "description": "Today we are releasing versions 14.0.10 and 14.1.5 for GitLab Community Edition and Enterprise Edition.\nThese versions resolve a number of regressions and bugs in the\n14.0 and\n14.1 releases.\nGitLab Community Edition and Enterprise Edition\nThe main purpose of these two releases is to resolve high CPU usage by the\nGitaly server:\nOnly activate Git pack-objects hook if cache is enabled\nBackport improved replication logic\nAdditionally, 14.1.5 includes the following fixes:\nGeo: Replicate multi-arch containers\nRun AWS Release rake task only if on latest stable tag\nImportant notes on upgrading\nThese versions do not include any new migrations, and for multi-node deployments, should not require any downtime.\nPlease be aware that by default the Omnibus packages will stop, run migrations,\nand start again, no matter how “big” or “small” the upgrade is. This behavior\ncan be changed by adding a /etc/gitlab/skip-auto-reconfigure file,\nwhich is only used for updates.\nUpdating\nTo update, check out our update page.\nGitLab subscriptions\nAccess to GitLab Premium and Ultimate features is granted by a paid subscription.\nAlternatively, sign up for GitLab.com\nto use GitLab's own infrastructure.",
          "link": "https://about.gitlab.com/releases/2021/09/02/gitlab-14-0-10-released/",
          "publishedOn": "2021-09-02T00:00:00.000Z",
          "wordCount": 1075,
          "title": "GitLab Patch Release: 14.0.10 and 14.1.5"
        }
      ]
    },
    {
      "title": "Phoronix",
      "feedUrl": "https://www.phoronix.com/rss.php",
      "siteUrl": "https://www.phoronix.com/",
      "articles": [
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-Regression-Fixed",
          "author": null,
          "description": "As a follow-up to A Fix Is Pending For That Linux 5.15 Performance Regression, Linus Torvalds decided to pull the fix directly into Linux 5.15 Git today for addressing this real-world, measurable performance regression...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-Regression-Fixed",
          "publishedOn": "2021-09-23T23:24:14.000Z",
          "wordCount": 769,
          "title": "Linux 5.15 Lands Memcg Performance Regression Fix"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=BPFILTER-2021",
          "author": null,
          "description": "Generating much excitement back in 2018 was bpfilter for the potential to better Linux's firewall and packet filtering by making it more robust and performance. Recently work on this BPF-based firewall solution was renewed and the performance potential over iptables and nftables is looking very good for the future...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=BPFILTER-2021",
          "publishedOn": "2021-09-23T20:00:00.000Z",
          "wordCount": 837,
          "title": "BPF-Based Linux Firewall \"bpfilter\" Shows Impressive Performance Potential"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Easy-Anti-Cheat-Linux",
          "author": null,
          "description": "Not too surprising given the Steam Deck is inching closer towards release and we've known Valve has been working to improve the anti-cheat situation for games on Linux, but today EAC owner Epic Games officially announced Easy Anti-Cheat for both Linux and macOS...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Easy-Anti-Cheat-Linux",
          "publishedOn": "2021-09-23T18:40:59.000Z",
          "wordCount": 775,
          "title": "Epic Games Announces Easy Anti-Cheat For Linux - Including Wine/Proton"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=FUTEX2-futex_waitv-v2",
          "author": null,
          "description": "The promising FUTEX2 work focused on improving the Linux performance for running Windows games via Wine/Proton by extending futex to wait on multiple locks is still moving forward...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=FUTEX2-futex_waitv-v2",
          "publishedOn": "2021-09-23T18:16:02.000Z",
          "wordCount": 804,
          "title": "Updated \"FUTEX2\" futex_waitv Patches Posted To Address Latest Feedback"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30536",
          "author": null,
          "description": "Last week was the article on noticing various workloads performing slower on the Linux 5.15 development kernel. There is now a patch pending that in testing so far does indeed correct the performance drop on this forthcoming kernel.",
          "link": "https://www.phoronix.com/vr.php?view=30536",
          "publishedOn": "2021-09-23T13:15:19.000Z",
          "wordCount": 696,
          "title": "A Fix Is Pending For That Linux 5.15 Performance Regression"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Microsoft-CLOn12-Mesa-SPIR-V",
          "author": null,
          "description": "Microsoft's \"CLOn12\" effort to allow OpenCL over DirectX 12 by leveraging Mesa now has landed a major rework to its code within Mesa...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Microsoft-CLOn12-Mesa-SPIR-V",
          "publishedOn": "2021-09-23T13:09:48.000Z",
          "wordCount": 766,
          "title": "Microsoft's \"CLOn12\" Mesa Code Adds SPIR/SPIR-V Support"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=GCC-12-Better-Security",
          "author": null,
          "description": "Qing Zhao of Oracle presented yesterday during the LPC2021 GNU Tools Track around the work they and others have been engaged in for improving the security of the GNU Compiler Collection (GCC)...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=GCC-12-Better-Security",
          "publishedOn": "2021-09-23T11:17:23.000Z",
          "wordCount": 832,
          "title": "GCC 12 Adds Stack Variable Auto-Initialization, Other Security Improvements Forthcoming"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-FDE-Auth-Boot-Lacking",
          "author": null,
          "description": "Most Linux distributions are currently coming up short from offering adequate security around full disk encryption and authenticated boot. Prominent Linux developer Lennart Poettering even argues that your data is \"probably more secure if stored on current ChromeOS, Android, Windows or macOS devices.\"..",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-FDE-Auth-Boot-Lacking",
          "publishedOn": "2021-09-23T10:23:47.000Z",
          "wordCount": 885,
          "title": "Lennart: Linux Comes Up Short Around Disk Encryption, Authenticated Boot Security"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.16-panel-edp",
          "author": null,
          "description": "The latest batch of miscellaneous Direct Rendering Manager changes are on their way to DRM-Next for Linux 5.16. Notable from this new drm-misc-next batch is the new \"panel-edp\" driver...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.16-panel-edp",
          "publishedOn": "2021-09-23T10:12:38.000Z",
          "wordCount": 819,
          "title": "\"panel-edp\" Driver On Its Way To Linux 5.16 To Make For Less Hard-Coded eDP Panel Configs"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=systemd-oomd-2021",
          "author": null,
          "description": "Systemd-oomd as the out-of-memory daemon originally developed by Facebook has been maturing nicely since being merged last year and then its most notable deployment to date has been with Fedora 34's debut earlier this year. Anita Zhang of Facebook provided an update today on the systemd-oomd effort...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=systemd-oomd-2021",
          "publishedOn": "2021-09-23T04:00:00.000Z",
          "wordCount": 924,
          "title": "systemd OOMD Maturing Nicely, Adds Support For User Services"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Steam-Deck-FAQ",
          "author": null,
          "description": "Valve today published a \"Steam Deck FAQ\" page sharing some additional information on this forthcoming Arch Linux powered handheld game system that will begin shipping at the end of Q4...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Steam-Deck-FAQ",
          "publishedOn": "2021-09-23T00:18:02.000Z",
          "wordCount": 831,
          "title": "Valve Publishes New Steam Deck FAQ With A Few New Details Shared"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Android-Linux-Upstream-First",
          "author": null,
          "description": "Google's Android had been notorious for all of its downstream patches carried by the mobile operating system as well as various vendor/device kernel trees while in recent years more of that code has been upstreamed. Google has also been shifting to the Android Generic Kernel Image (GKI) as the basis for all their product kernels to further reduce the fragmentation. Looking ahead, Google is now talking of an \"upstream first\" approach for pushing new kernel features...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Android-Linux-Upstream-First",
          "publishedOn": "2021-09-22T18:38:46.000Z",
          "wordCount": 883,
          "title": "Google Finally Shifting To \"Upstream First\" Linux Kernel Approach For Android Features"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-RADV-RT-For-Older-GPUs",
          "author": null,
          "description": "Merged yesterday for Mesa 21.3 was open-source Vulkan ray-tracing for AMD RDNA2 / RX 6000 series GPUs with the RADV driver. Opened today now is a merge request that would provide Vulkan ray-tracing with RADV to pre-RDNA2 GPUs on this driver going back to the likes of Polaris, granted the performance is another story...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-RADV-RT-For-Older-GPUs",
          "publishedOn": "2021-09-22T17:14:25.000Z",
          "wordCount": 909,
          "title": "Mesa Merge Pending For Vulkan Ray-Tracing On Older AMD GPUs"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=GNOME-41-Released",
          "author": null,
          "description": "GNOME 41 is out as the latest half-year update to this open-source desktop environment...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=GNOME-41-Released",
          "publishedOn": "2021-09-22T15:23:58.000Z",
          "wordCount": 668,
          "title": "GNOME 41 Released With Wayland Improvements, More Performance Tuning"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30535",
          "author": null,
          "description": "Earlier this month AMD posted their initial public patches for the AMD P-State CPU frequency scaling driver that leverages ACPI CPPC for ultimately aiming to provide better power efficiency and more responsive CPU frequency scaling / performance state decisions on Zen 3 (and Zen 2 eventually) processors. This is part of the effort around AMD and Valve collaborating for better Linux efficiency especially with the AMD-powered Steam Deck.",
          "link": "https://www.phoronix.com/vr.php?view=30535",
          "publishedOn": "2021-09-22T13:38:59.000Z",
          "wordCount": 868,
          "title": "An Early Look At The AMD P-State CPPC Driver Performance vs. ACPI CPUFreq"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=GCC-Better-OpenACC-Performance",
          "author": null,
          "description": "While the GNU Compiler Collection has supported OpenACC for a few years now as this parallel programming standard popular with GPUs/accelerators, the current implementation has been found to be inadequate for many real-world HPC workloads leveraging OpenACC. Fortunately, Siemens has been working to improve GCC's OpenACC kernels support...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=GCC-Better-OpenACC-Performance",
          "publishedOn": "2021-09-22T10:40:26.000Z",
          "wordCount": 797,
          "title": "Better Support & Performance For OpenACC Kernels Is Coming To GCC"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Aya-LPC2021-Update",
          "author": null,
          "description": "Aya was presented during this week's Linux Plumbers Conference for improving the eBPF developer experience by allowing Rust programs to easily run within the kernel...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Aya-LPC2021-Update",
          "publishedOn": "2021-09-22T09:57:22.000Z",
          "wordCount": 732,
          "title": "Aya Makes It Easy To Write Rust-Based eBPF Programs For The Linux Kernel"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Ubuntu-Touch-OTA-19",
          "author": null,
          "description": "UBports on Tuesday released Ubuntu Touch OTA-19 as the latest refinement to this Ubuntu Linux spin for smartphones and tablets...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Ubuntu-Touch-OTA-19",
          "publishedOn": "2021-09-22T07:40:00.000Z",
          "wordCount": 821,
          "title": "Ubuntu Touch OTA-19 Released - Still Based On Ubuntu 16.04"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-21.2.2",
          "author": null,
          "description": "Mesa point releases generally come every two weeks but for the past month have fallen off the wagon. Mesa 21.2.1 came in mid-August and on Tuesday was finally succeeded by Mesa 21.2.2 as a \"late and very large\" update...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-21.2.2",
          "publishedOn": "2021-09-22T04:00:00.000Z",
          "wordCount": 833,
          "title": "Mesa 21.2.2 Released \"Late & Very Large\""
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=X.Org-Server-21.1-RC1",
          "author": null,
          "description": "More than three years after X.Org Server 1.20 was released, it's set to finally be succeeded soon by X.Org Server 21.1 under its new versioning scheme. Out today is the X.org Server 21.1 release candidate...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=X.Org-Server-21.1-RC1",
          "publishedOn": "2021-09-21T22:55:00.000Z",
          "wordCount": 867,
          "title": "X.Org Server 21.1 RC1 Released With VRR Support For Modesetting Driver, Other Features"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=AMDGPU-Device-Enumeration-IP",
          "author": null,
          "description": "AMD's open-source Linux graphics driver engineers are working to overhaul how the initial driver loading with device enumeration happens to ultimately make it more robust. In the process though PCI IDs become less important and in turn less of an avenue for exposing possible indicators of new graphics cards...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=AMDGPU-Device-Enumeration-IP",
          "publishedOn": "2021-09-21T21:00:00.000Z",
          "wordCount": 1149,
          "title": "AMDGPU Linux Driver To Overhaul Its Approach To Device Enumeration"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Blender-3.0-Lands-Cycles-X",
          "author": null,
          "description": "Cycles X as a modernizing of Blender's Cycles rendering engine has now landed in the latest development code for Blender 3.0. Cycles X brings big performance improvements but does eliminate OpenCL support in the process...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Blender-3.0-Lands-Cycles-X",
          "publishedOn": "2021-09-21T19:33:07.000Z",
          "wordCount": 895,
          "title": "Cycles X Merged Into Blender 3.0 With NVIDIA CUDA/OptiX Support, AMD HIP Pending"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Chrome-94-Released",
          "author": null,
          "description": "Chrome 94 is available today as another exciting update for Google's web browser...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Chrome-94-Released",
          "publishedOn": "2021-09-21T18:48:29.000Z",
          "wordCount": 776,
          "title": "Chrome 94 Released With WebGPU For Testing, WebCodecs API Now Official"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=GNU-Profiler-gprofng",
          "author": null,
          "description": "Oracle engineers have been working on \"gprofng\" as a next-generation GNU Profiler that can analyze production binaries. Oracle talked up Gprofng today during the GNU Tools Track as part of Linux Plumbers Conference 2021...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=GNU-Profiler-gprofng",
          "publishedOn": "2021-09-21T18:21:41.000Z",
          "wordCount": 776,
          "title": "Oracle's Next-Generation GNU Profiler \"gprofng\" Is Looking Great For Developers"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-Foundation-PaSh",
          "author": null,
          "description": "The Linux Foundation announced today they will be hosting the PaSh project that is focused on automatically parallelizing POSIX shell scripts...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-Foundation-PaSh",
          "publishedOn": "2021-09-21T17:16:59.000Z",
          "wordCount": 796,
          "title": "Linux Foundation To Host PaSh For Automatic Parallelizing Of Shell Scripts"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Samba-4.15",
          "author": null,
          "description": "While there is now KSMBD with Linux 5.15 for offering an in-kernel SMB file server, its scope is much more limited than that of the Samba project in user-space. With that said, Samba 4.15 is out now with its latest batch of features and improvements for open-source SMB/CIFS support on Linux and other platforms...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Samba-4.15",
          "publishedOn": "2021-09-21T12:40:31.000Z",
          "wordCount": 814,
          "title": "Samba 4.15 Released With Improved CLI Experience, Modernized VFS Interface"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Ubuntu-14.04-16.04-Ten-Years",
          "author": null,
          "description": "Canonical is announcing this morning they are extending the Ubuntu 14.04 LTS \"Trusty Tahr\" and Ubuntu 16.04 LTS \"Xenial Xerus\" releases to a ten year lifespan...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Ubuntu-14.04-16.04-Ten-Years",
          "publishedOn": "2021-09-21T12:00:00.000Z",
          "wordCount": 821,
          "title": "Canonical Extending Ubuntu 14.04/16.04 LTS Support To Ten Years"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Vulkan-Video-XDC2021",
          "author": null,
          "description": "Going public back in April was the provisional specification around the Vulkan Video extensions as a new industry-standard video encode/decode interface. While several months have passed, there hasn't been much activity yet in the open-source space around Vulkan Video...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Vulkan-Video-XDC2021",
          "publishedOn": "2021-09-21T10:33:48.000Z",
          "wordCount": 834,
          "title": "Vulkan Video Decoding Still In The Early Stages For Open-Source"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-21.3-RADV-Ray-Tracing",
          "author": null,
          "description": "Landing overnight into Mesa 21.3 was experimentally enabling the Vulkan ray-tracing extensions within the open-source Radeon \"RADV\" driver...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-21.3-RADV-Ray-Tracing",
          "publishedOn": "2021-09-21T09:25:36.000Z",
          "wordCount": 730,
          "title": "Mesa 21.3 Lands Initial Radeon Ray-Tracing Support In Open-Source RADV Vulkan Driver"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-Extending-DWARF-GPUs",
          "author": null,
          "description": "In addition to AMD's increasing Linux kernel contributions, they are also contributing more improvements in user-space too thanks to their super-computing wins and other big enterprise deployments that are Linux-based. One of the areas talked about this week at the Linux Plumbers Conference with the GNU Tools track is how they are working to extend the DWARF debug format to better handle GPU debugging...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-Extending-DWARF-GPUs",
          "publishedOn": "2021-09-21T04:00:00.000Z",
          "wordCount": 815,
          "title": "AMD Extending DWARF To Better Handle GPU Debugging, Continues Collaborating With GCC & LLVM"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Oktoberfest-2021-Special",
          "author": null,
          "description": "While Oktoberfest was once again cancelled due to the COVID-19 pandemic (then again, due to the state of the ad industry / ad-block users we haven't had any European meet-up / open-source gathering in years), the wiesn would have kicked off this past weekend. So as is tradition, there is the Phoronix Premium Oktoberfest sale where you can join the ad-free service as a reduced rate. If you enjoy the daily, original Linux and open-source content on Phoronix with plenty of benchmarking, you can do so at a reduced rate...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Oktoberfest-2021-Special",
          "publishedOn": "2021-09-21T03:59:36.000Z",
          "wordCount": 996,
          "title": "Phoronix Ad-Free/Premium Special For Oktoberfest 2021"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-ENQCMD-Restoring-Patches",
          "author": null,
          "description": "While Intel is normally quite good with their new hardware support being in good shape well ahead of launch, their new code for supporting the ENQCMD functionality for the Data Streaming Accelerator (DSA) with Xeon \"Sapphire Rapids\" has been an exception. This summer the mainline Linux kernel disabled ENQCMD support since the code was \"broken beyond repair\" while now Intel engineers have sent out a new series looking to get it re-enabled...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-ENQCMD-Restoring-Patches",
          "publishedOn": "2021-09-20T20:25:44.000Z",
          "wordCount": 894,
          "title": "Intel Posts New Linux Patches Looking To Re-Enable ENQCMD Ahead Of Sapphire Rapids"
        }
      ]
    }
  ],
  "cliVersion": "1.11.1"
}