{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": [
        {
          "id": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.0",
          "author": null,
          "description": "Added: support an experimental template for YouTube feed 📺 Demo | Source\n\nAggregate content from any YouTube channel rss url https://www.youtube.com/feeds/videos.xml?channel_id=<replace_with_channel_id>\nVideos are embedded via iframe and loading accelerated by youtube-lite-embed\nAds are reduced thanks to YouTube's policy for embedded videos 🙃\nWorks on mobile devices with butter smooth horizontal scroll.\nCaveat: the template works only with YouTube content. You cannot mix textual RSS feed or other video sources such as Vimeo.\nChanged: Default HTML template meta tag adjusted to match convention\nChanged: sources in template data is now ordered by last update timestamp (as opposed to alphabetical)\nThank you @PiyushLosalka",
          "link": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.0",
          "publishedOn": "2021-06-23T05:57:59.000Z",
          "wordCount": 370,
          "title": "v1.11.0"
        },
        {
          "id": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.10.2",
          "author": null,
          "description": "Added: testing and CI/CD workflows",
          "link": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.10.2",
          "publishedOn": "2021-06-01T04:39:30.000Z",
          "wordCount": 263,
          "title": "v1.10.2"
        }
      ]
    },
    {
      "title": "GitLab",
      "feedUrl": "https://about.gitlab.com/atom.xml",
      "siteUrl": "https://about.gitlab.com/blog/",
      "articles": [
        {
          "id": "https://about.gitlab.com/releases/2021/06/24/gitlab-14-0-1-released/",
          "author": null,
          "description": "Today we are releasing version 14.0.1 for GitLab Community Edition and Enterprise Edition.\nThis version resolves a number of regressions and bugs in\nthis month's 14.0 release and\nprior versions.\nGitLab Community Edition and Enterprise Edition\nAvailable in GitLab Free, Premium, and Ultimate:\nUpdate Geo UI screenshots in docs page\nUpdate admin docs with new admin area access info\nAdd Helm-2to3.gitlab-ci.yml to Auto DevOps\nUpdate docs for new Members page location on GitLab navigation\nDevOps Adoption - ensure displayNamespaceId is included\nRemove add button from Devops Adoption\nGeo: Add Terraform Module to datatypes doc\nCreate 14.0 What's New entry\nToggle codequality diff annotations flag\nBump kas to v14.0.1\nExempt unicorn 'svlogd_prefix' from deprecation check\nImportant notes on upgrading\nThis version does not include any new migrations, and for multi-node deployments, should not require any downtime.\nPlease be aware that by default the Omnibus packages will stop, run migrations,\nand start again, no matter how “big” or “small” the upgrade is. This behavior\ncan be changed by adding a /etc/gitlab/skip-auto-reconfigure file,\nwhich is only used for updates.\nUpdating\nTo update, check out our update page.\nGitLab subscriptions\nAccess to GitLab Premium and Ultimate features is granted by a paid subscription.\nAlternatively, sign up for GitLab.com\nto use GitLab's own infrastructure.",
          "link": "https://about.gitlab.com/releases/2021/06/24/gitlab-14-0-1-released/",
          "publishedOn": "2021-06-24T00:00:00.000Z",
          "wordCount": 1072,
          "title": "GitLab Patch Release: 14.0.1"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/06/23/how-to-use-agent-based-gitops/",
          "author": null,
          "description": "In the previous post, titled 3 ways to approach GitOps, we discussed the many benefits and options that GitLab supports for fulfilling the GitOps requirements of customers, whose IT environments are composed of heterogeneous technologies and infrastructures. This post is a 3-part series, in which we delve deeper into these options. In this first part, we cover the pull-based or agent-based approach.\nAbout a pull-based or agent-based approach\nIn this approach, an agent is installed in your infrastructure components to pull changes whenever there is a drift from the desired configuration, which resides in GitLab. Although the infrastructure components could be anything from a physical server or router to a VM or a database, we will focus on a Kubernetes cluster in this section.\nIn the follow…",
          "link": "https://about.gitlab.com/blog/2021/06/23/how-to-use-agent-based-gitops/",
          "publishedOn": "2021-06-23T00:00:00.000Z",
          "wordCount": 3514,
          "title": "How to use a pull-based (agent-based) approach for GitOps"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/06/22/gitlab-14-modern-devops/",
          "author": null,
          "description": "The DevOps era began with a big idea – dissolve silos to deliver better software, faster. In the transition from classic software paradigms, DIY DevOps toolchains were built with parts that were never designed to work together. That DIY DevOps era left many trapped in new silos, without visibility, and mired in maintenance. Business outcomes suffered as the potential of DevOps was never fully realized.\nThe next iteration of DevOps\nThere is a better way to build software. GitLab 14 delivers modern DevOps with a complete DevOps platform, for a streamlined experience that unleashes the power of DevOps. Over the past year, GitLab has shipped advanced DevOps platform capabilities that enable any team to build and deliver software with velocity, trust, and visibility – no matter their size, indu…",
          "link": "https://about.gitlab.com/blog/2021/06/22/gitlab-14-modern-devops/",
          "publishedOn": "2021-06-22T00:00:00.000Z",
          "wordCount": 2659,
          "title": "GitLab 14 signals shift to modern DevOps: A DevOps platform with velocity, trust, and visibility"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/06/22/gitlab-14-0-released/",
          "author": null,
          "description": "When we think of everything released in the year since GitLab 13.0, we could not be more proud of our community and our team. This month, we celebrate our release of GitLab 14.0 by first taking a step back.\nTogether, we’ve made so much progress over the last year that we want to talk about everything it took to get to GitLab 14.\nWe use semantic versioning so a point release, like 14.0, represents everything new in this month. GitLab 14 is the culmination of the past year. Even more than that, GitLab 14 represents the future of GitLab, and the future of DevOps.\nWith GitLab 14, teams of all sizes are moving from maintaining DIY DevOps toolchains to adopting modern DevOps. GitLab 14 is a complete DevOps platform with security embedded in its DNA, visibility and insights enabled by its single …",
          "link": "https://about.gitlab.com/releases/2021/06/22/gitlab-14-0-released/",
          "publishedOn": "2021-06-22T00:00:00.000Z",
          "wordCount": 12300,
          "title": "GitLab 14.0 released with a celebration of GitLab 14"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/06/21/usage-ping-configuration-bug-for-self-managed-instances/",
          "author": null,
          "description": "We recently discovered a Usage Ping  configuration bug for self-managed instances and have since published a patch release to fix the bug. The issue affects the ability to disable Usage Ping for self-managed GitLab via text configuration files, resulting in the collection and transmission of Usage Ping events from the instance. This bug affects any instance running GitLab version 9.3 to version 13.12.3, and was patched in 13.12.4.\nWhat does this mean for existing users?\nThis issue does not affect customers who have disabled Usage Ping via the user interface or any users of our SaaS product.\nYou can check your instance configuration settings to see if this issue may have affected you. We’ve published more detailed instructions here.\nWhat should I do?\nSince we do not collect any configuration data from your instance, we have no way to detect if you unintentionally shared data with GitLab. Out of an abundance of caution, we ask that you fill out this form if you suspect that Usage Ping data was shared after taking steps to opt-out in your GitLab configuration file. We will purge data from our systems and follow up with confirmation.\nPlease share your questions and feedback with us on the community forum.",
          "link": "https://about.gitlab.com/blog/2021/06/21/usage-ping-configuration-bug-for-self-managed-instances/",
          "publishedOn": "2021-06-21T00:00:00.000Z",
          "wordCount": 1152,
          "title": "Usage Ping configuration bug for self-managed instances"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/06/21/how-to-become-more-productive-with-gitlab-ci/",
          "author": null,
          "description": "CI/CD pipelines are the preeminent solution to mitigate potential risks while integrating code changes into the repository. CI/CD pipelines help isolate the impact of potential errors, making it easier to fix them. Top that with a tool that provides effective visibility into the running tasks and there you have a recipe for success.\nSince the primary purpose of CI/CD pipelines is to speed up the development process and provide value to the end user faster, there's always room to make the process more efficient. This blog post unpacks some strategies that can help you get the most out of your pipeline definition in GitLab CI.\nHow Directed Acyclic Graphs (DAG) enable concurrent pipelines\n\nBy using the \"Needs\" keyword you can define dependencies for jobs that need to be used from previous sta…",
          "link": "https://about.gitlab.com/blog/2021/06/21/how-to-become-more-productive-with-gitlab-ci/",
          "publishedOn": "2021-06-21T00:00:00.000Z",
          "wordCount": 2627,
          "title": "How to become more productive with Gitlab CI"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/06/21/gitlab-13-12-5-released/",
          "author": null,
          "description": "Today we are releasing version 13.12.5 for GitLab Community Edition and Enterprise Edition.\nThis version resolves a number of regressions and bugs in\nthis month's 13.12 release and\nprior versions.\nGitLab Community Edition and Enterprise Edition\nAvailable in GitLab Free, Premium, and Ultimate:\nOnly update required instance ci template when the parameter is present\nFix Password expired error on git fetch via SSH for LDAP user\nAdvanced Search Settings page does not load if the ES url is unreachable\nImportant notes on upgrading\nThis version does not include any new migrations, and for multi-node deployments, should not require any downtime.\nPlease be aware that by default the Omnibus packages will stop, run migrations,\nand start again, no matter how “big” or “small” the upgrade is. This behavior\ncan be changed by adding a /etc/gitlab/skip-auto-reconfigure file,\nwhich is only used for updates.\nUpdating\nTo update, check out our update page.\nGitLab subscriptions\nAccess to GitLab Premium and Ultimate features is granted by a paid subscription.\nAlternatively, sign up for GitLab.com\nto use GitLab's own infrastructure.",
          "link": "https://about.gitlab.com/releases/2021/06/21/gitlab-13-12-5-released/",
          "publishedOn": "2021-06-21T00:00:00.000Z",
          "wordCount": 1043,
          "title": "GitLab Patch Release: 13.12.5"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/06/16/gpg-key-used-to-sign-gitlab-runner-packages-rotated/",
          "author": null,
          "description": "GitLab uses a GPG key to sign official GitLab Runner packages. We recently became aware of an instance where this key and other tokens used to distribute official GitLab Runner packages and binaries were not secured according to GitLab’s security policies.\nWe have not found any evidence of unauthorized modification of the packages or access to the services storing them. Our team has audited and investigated integrity hashes, bucket logs and versioning, and pipeline history and concluded that the unauthorized modification of any packages is exceedingly unlikely.\nOut of an abundance of caution, the GPG key used for release signing and verification has been rotated along with all other tokens that were improperly secured.\nIf you use GitLab.com shared runners, this does not impact you.\nAs of J…",
          "link": "https://about.gitlab.com/blog/2021/06/16/gpg-key-used-to-sign-gitlab-runner-packages-rotated/",
          "publishedOn": "2021-06-16T00:00:00.000Z",
          "wordCount": 1579,
          "title": "The GPG key used to sign GitLab Runner packages has been rotated"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/06/15/why-we-are-building-the-gitlab-environment-toolkit-to-help-deploy-gitlab-at-scale/",
          "author": null,
          "description": "Last year I wrote about how the Quality Engineering Enablement team was building up the performance testing of GitLab with the GitLab Performance Tool (GPT). Last year, the biggest challenge with performance testing wasn't so much the testing but rather setting up the right large scale GitLab environments to test against.\nLike any server application, deploying at scale is challenging. That's why we built another toolkit that automates the deployment of GitLab at scale: The GitLab Environment Toolkit (GET).\n\nGitLab Environment Toolkit logo\nInternally called the \"Performance Environment Builder\" (PEB), GET grew alongside GPT as we continued to expand our performance testing efforts. Over time we built a toolkit that was quite capable in its own right of deploying GitLab at scale, which is wh…",
          "link": "https://about.gitlab.com/blog/2021/06/15/why-we-are-building-the-gitlab-environment-toolkit-to-help-deploy-gitlab-at-scale/",
          "publishedOn": "2021-06-15T00:00:00.000Z",
          "wordCount": 4881,
          "title": "The next step in performance testing? The GitLab Environment Toolkit"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/06/14/gitlab-13-12-4-released/",
          "author": null,
          "description": "Today we are releasing version 13.12.4 for GitLab Community Edition and Enterprise Edition.\nThis version resolves a number of regressions and bugs in\nthis month's 13.12 release and\nprior versions.\nGitLab Community Edition and Enterprise Edition\nAvailable in GitLab Free, Premium, and Ultimate:\nFix double render in project's git URL redirect\nFix MR diff compare with previous version\nAdd alias method usage_ping_enabled?\nDo not show Praefect deprecation if Praefect is disabled\nUpdate Mattermost to 5.34.4\nImportant notes on upgrading\nThis version does not include any new migrations, and for multi-node deployments, should not require any downtime.\nPlease be aware that by default the Omnibus packages will stop, run migrations,\nand start again, no matter how “big” or “small” the upgrade is. This behavior\ncan be changed by adding a /etc/gitlab/skip-auto-reconfigure file,\nwhich is only used for updates.\nUpdating\nTo update, check out our update page.\nGitLab subscriptions\nAccess to GitLab Premium and Ultimate features is granted by a paid subscription.\nAlternatively, sign up for GitLab.com\nto use GitLab's own infrastructure.",
          "link": "https://about.gitlab.com/releases/2021/06/14/gitlab-13-12-4-released/",
          "publishedOn": "2021-06-14T00:00:00.000Z",
          "wordCount": 1034,
          "title": "GitLab Patch Release: 13.12.4"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/06/11/how-i-use-gitlab-to-help-my-hack/",
          "author": null,
          "description": "GitLab is best known as a complete open source DevOps platform, delivered as a single application, but it also offers powerful project management and collaboration capabilities. In fact, every GitLab team uses GitLab to develop, track and collaborate on projects, processes, and programs.\nBut, what about… other uses? Say … hacking, for instance. 🤷‍♀️\nCan GitLab help a hacker fine-tune their craft? Through our Ask a Hacker AMA series we discovered that there are some bug bounty hunters who use GitLab to streamline their research process. And, like so many cool and awesome things, we learned on Twitter about another contributor using GitLab for bug bounty hunting.  So, we followed up to learn more.\nMeet our hackers\nAlex Chapman\n\nAlex has been hacking for 14 years professionally, but his inte…",
          "link": "https://about.gitlab.com/blog/2021/06/11/how-i-use-gitlab-to-help-my-hack/",
          "publishedOn": "2021-06-11T00:00:00.000Z",
          "wordCount": 4813,
          "title": "How do bug bounty hunters use GitLab to help their hack?"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/06/10/how-to-get-gitops-right-with-iac-security/",
          "author": null,
          "description": "In today's competitive digital era, it is imperative for organizations to undergo a digital transformation to effectively compete. For many, achieving a digital transformation means transitioning toward a DevOps model.\nDevOps has been around for many years, and the development side of the house has benefitted from the core practices of DevOps. However, the infrastructure side of the house has been lagging behind, particularly when it comes to speed. With infrastructure as code (IaC) and GitOps, infrastructure teams have been able to apply the same disciplines and quality gates that are used to manage application code to the infrastructure - to deliver products faster, with more predictability and at scale.\nSecurity slowing down delivery\nWhile the GitOps concept promises faster and more fre…",
          "link": "https://about.gitlab.com/blog/2021/06/10/how-to-get-gitops-right-with-iac-security/",
          "publishedOn": "2021-06-10T00:00:00.000Z",
          "wordCount": 2150,
          "title": "How to get GitOps right with infrastructure as code security"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/06/09/how-to-protect-your-source-code-with-gitlab-and-jscrambler/",
          "author": null,
          "description": "Development teams are building, testing, and shipping code faster than ever before. Today, we know that security has a role to play at the early stages of the DevOps workflow, but these security controls are mostly centered around finding and fixing bugs and vulnerabilities during development.\nIn this tutorial, we will explore the importance of protecting client-side application code at runtime and guide you through implementing it in your GitLab instance using the integration with Jscrambler.\nThe importance of runtime code protection\nWith web and mobile applications dealing with increasingly sensitive data, addressing the application's attack surface requires considering additional threats that are not directly linked to vulnerabilities.\nThis concern has been widely covered in NIST, ISO 2…",
          "link": "https://about.gitlab.com/blog/2021/06/09/how-to-protect-your-source-code-with-gitlab-and-jscrambler/",
          "publishedOn": "2021-06-09T00:00:00.000Z",
          "wordCount": 2946,
          "title": "How to protect your source code with GitLab and Jscrambler"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/06/07/tuto-mac-m1-gitlab-ci/",
          "author": null,
          "description": "GitLab's complete DevOps platform comes with built-in continuous integration (CI) and continuous delivery (CD) via GitLab CI/CD. GitLab CI/CD is a great solution to increase developer productivity and motivation to write higher-quality code without sacrificing speed. It runs a series of tests every time a commit is pushed, providing immediate visibility into the results of changes in the codebase. While it is not a hassle to set up a CI using Linux-based machines, iOS and macOS developers may find it is more complicated to have access to a Mac that is connected and available 24 hours a day.\nGitLab Runners, provided on GitLab.com, are the engine that executes CI workflows. Due to various requirements, some users may opt to self-host runners on public cloud VMs. This is super easy if the bui…",
          "link": "https://about.gitlab.com/blog/2021/06/07/tuto-mac-m1-gitlab-ci/",
          "publishedOn": "2021-06-07T00:00:00.000Z",
          "wordCount": 3295,
          "title": "How to use Scaleway to self-host your GitLab Runners"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/06/07/gitlab-13-12-3-released/",
          "author": null,
          "description": "Today we are releasing version 13.12.3 for GitLab Community Edition and Enterprise Edition.\nThis version resolves a number of regressions and bugs in\nlast month's 13.12 release and\nprior versions.\nGitLab Community Edition and Enterprise Edition\nFix maven & gradle examples in the docs, enabling line-by-line display of test coverage in merge requests out-of-the-box (for java &\nkotlin)\nFix issue with frames not loading in Safari\nImprove SSH key expiration warning emails\nAdd an option to expose description_html in Release API [RUN ALL RSPEC] [RUN AS-IF-FOSS]\nFix CSP issues related to captchas\nSet CSP back to disabled by default\nFix referrer option passed to Akismet client\nFix passing environment variables for migrations\nImportant notes on upgrading\nThis version does not include any new migrations, and for multi-node deployments, should not require any downtime.\nPlease be aware that by default the Omnibus packages will stop, run migrations,\nand start again, no matter how “big” or “small” the upgrade is. This behavior\ncan be changed by adding a /etc/gitlab/skip-auto-reconfigure file,\nwhich is only used for updates.\nUpdating\nTo update, check out our update page.\nGitLab subscriptions\nAccess to GitLab Premium and Ultimate features is granted by a paid subscription.\nAlternatively, sign up for GitLab.com\nto use GitLab's own infrastructure.",
          "link": "https://about.gitlab.com/releases/2021/06/07/gitlab-13-12-3-released/",
          "publishedOn": "2021-06-07T00:00:00.000Z",
          "wordCount": 1075,
          "title": "GitLab Patch Release: 13.12.3"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/06/04/managing-global-projects-requiring-rapid-response-continuously/",
          "author": null,
          "description": "I am an Engineering Manager working on a distributed engineering team at GitLab. Our team is distributed globally, and we have engineers working in India, Germany, Australia, New Zealand, and the United States. I am located in the U.S. in Pacific Standard Time (PST). In coordination with other globally distributed engineering teams, we recently responded to an abuse issue which was causing disruptions for legitimate GitLab.com users, and required a rapid response.\nGlobal distribution as an advantage\nMany managers view global team distribution as a constraint (because synchronous communication becomes more difficult), but it is possible to embrace the constraint and turn it into an advantage. When teams are globally distributed it is possible for work to continue around-the-clock, uninterru…",
          "link": "https://about.gitlab.com/blog/2021/06/04/managing-global-projects-requiring-rapid-response-continuously/",
          "publishedOn": "2021-06-04T00:00:00.000Z",
          "wordCount": 2351,
          "title": "How to leverage distributed engineering teams for rapid response"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/06/04/gitlab-moving-to-14-breaking-changes/",
          "author": null,
          "description": "GitLab 14.0: Our annual major release\nGitLab 14.0 is coming to GitLab.com. Along with the exciting new features, it also includes planned deprecations because it is the major version release for 2021. We try to minimize breaking changes, but some changes are needed to improve workflows, performance, scalability, and more.\nThese changes will go live on GitLab.com sometime between May 23 – June 22, through our daily deployments, leading up to the official release of 14.0 on June 22. Keep reading to learn more about these important changes.\nGitLab 14.0 for self-managed users will also be released on June 22, read on for more information about deprecations and removals for self-managed instances.\nPlan\nRemoved deprecated GraphQL fields\nIn accordance with our GraphQL deprecation process, the fol…",
          "link": "https://about.gitlab.com/blog/2021/06/04/gitlab-moving-to-14-breaking-changes/",
          "publishedOn": "2021-06-04T00:00:00.000Z",
          "wordCount": 6797,
          "title": "GitLab.com is moving to 14.0 with a few breaking changes"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/06/01/advanced-search-data-migrations/",
          "author": null,
          "description": "For some time now, GitLab has been working on enabling the Elasticsearch\nintegration on GitLab.com to allow as many GitLab.com users as possible access\nto the Advanced Global Search\nfeatures. Last year, after enabling Advanced Search for all licensed customers on\nGitLab.com we were thinking how to simplify the rollout of some Advanced Search\nfeatures that require changing the data in Elasticsearch.\n(If you're interested in the lessons we learned on our road to Enabling\nElasticsearch for GitLab.com, you can read all about it.\nThe data migration process problem\nSometimes we need to change mappings of an index or backfill a field, and\nreindexing everything from scratch or using Zero downtime reindexing\nmight seem like an obvious solution. However, this is not a scalable option for\nbig GitLab …",
          "link": "https://about.gitlab.com/blog/2021/06/01/advanced-search-data-migrations/",
          "publishedOn": "2021-06-01T00:00:00.000Z",
          "wordCount": 3507,
          "title": "GitLab's data migration process for Advanced Search"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/06/01/gitlab-is-setting-standard-for-devsecops/",
          "author": null,
          "description": "Debate always swirls over what term is best: DevSecOps, SecDevOps, or even to drop “sec” altogether since it should be ubiquitous. At GitLab, we have a strong point of view on this: DevSecOps places security in the middle of the DevOps effort, which is where it rightly belongs. While transparent and a natural part of the process, it should be top of mind and not buried. Security needs to be everyone’s responsibility. With automation of processes and policies, it can be much easier to arm developers and security pros alike with the information they need in order to meet this responsibility.\nOur DevSecOps platform is the end-to-end secure software solution that helps you plan, create, deploy, secure, and manage your modern software and the infrastructure upon which it relies. GitLab provides…",
          "link": "https://about.gitlab.com/blog/2021/06/01/gitlab-is-setting-standard-for-devsecops/",
          "publishedOn": "2021-06-01T00:00:00.000Z",
          "wordCount": 2891,
          "title": "GitLab is setting the standard for DevSecOps"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/06/01/security-release-gitlab-13-12-2-released/",
          "author": null,
          "description": "Today we are releasing versions 13.12.2, 13.11.5, and 13.10.5 for GitLab Community Edition (CE) and Enterprise Edition (EE).\nThese versions contain important security fixes, and we strongly recommend that all GitLab installations be upgraded to one of these versions immediately.\nGitLab releases patches for vulnerabilities in dedicated security releases. There are two types of security releases: a monthly, scheduled security release, released a week after the feature release (which deploys on the 22nd of each month), and ad-hoc security releases for critical vulnerabilities. For more information, you can visit our security FAQ. You can see all of our regular and security release blog posts here. In addition, the issues detailing each vulnerability are made public on our issue tracker 30 day…",
          "link": "https://about.gitlab.com/releases/2021/06/01/security-release-gitlab-13-12-2-released/",
          "publishedOn": "2021-06-01T00:00:00.000Z",
          "wordCount": 2454,
          "title": "GitLab Security Release: 13.12.2, 13.11.5, and 13.10.5"
        }
      ]
    },
    {
      "title": "Phoronix",
      "feedUrl": "https://www.phoronix.com/rss.php",
      "siteUrl": "https://www.phoronix.com/",
      "articles": [
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.13-Released",
          "author": null,
          "description": "Linus Torvalds has just released the Linux 5.13 kernel as stable...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.13-Released",
          "publishedOn": "2021-06-27T22:34:50.000Z",
          "wordCount": 885,
          "title": "Linux 5.13 Released With Apple M1 Bringup, Landlock, FreeSync HDMI + Much More"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=randomize_kstack_offset-perf",
          "author": null,
          "description": "Of the many new features in Linux 5.13 one of the prominent security features is the ability to randomize the kernel stack offset at each system call. With Linux 5.13 stable imminent, here are some performance benchmarks of the impact from enabling this security feature...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=randomize_kstack_offset-perf",
          "publishedOn": "2021-06-27T14:00:00.000Z",
          "wordCount": 995,
          "title": "Linux's New \"randomize_kstack_offset\" Security Feature Having Minimal Performance Impact"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-2021-H1-Highlights",
          "author": null,
          "description": "With the half-way point for the year upon us, here is a look back at the most exciting Mesa open-source graphics driver news so far in 2021 with exciting contributions from Microsoft, AMD and Intel continuing to be the most open-source friendly graphics vendors, Zink making remarkable progress for OpenGL over Vulkan, performance optimizations galore, more embedded Vulkan drivers coming about, and other milestones for open-source Linux graphics...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-2021-H1-Highlights",
          "publishedOn": "2021-06-27T13:37:34.000Z",
          "wordCount": 1574,
          "title": "Mesa's Exciting Milestones So Far In 2021 From Zink To Great Intel/AMD Open-Source Work"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-Block-Global-Counter",
          "author": null,
          "description": "Microsoft and systemd developers are proposing a global counter for block device changes for the Linux kernel to better track changes and having a unique system-wide number for disk and other block device changes rather than on a per-disk basis...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-Block-Global-Counter",
          "publishedOn": "2021-06-27T11:40:57.000Z",
          "wordCount": 948,
          "title": "Linux Developers Discuss A Global Counter For Block/Disk Changes"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-HID-Programmable-Buttons",
          "author": null,
          "description": "The hid-input kernel driver with Linux 5.14 is set to see support for \"Programmable Buttons\" as outlined by the USB HID specification...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-HID-Programmable-Buttons",
          "publishedOn": "2021-06-27T10:35:11.000Z",
          "wordCount": 756,
          "title": "Linux 5.14 HID Input Driver To Handle Programmable Buttons"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=More-XeHP-Mesa-21.2",
          "author": null,
          "description": "Back in April was the last time we saw much XeHP specificc ode land in the open-source Mesa driver code while this week there was a fresh batch of code merged...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=More-XeHP-Mesa-21.2",
          "publishedOn": "2021-06-27T10:08:01.000Z",
          "wordCount": 873,
          "title": "More Intel Xe-HP Enablement Code Lands In Mesa 21.2"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Fedora-35-Crypt-Optimal-Size",
          "author": null,
          "description": "With this autumn's Fedora 35 release there should be better performance out-of-the-box for those employing LUKS/dm-crypt encryption while using 4K sector size based storage...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Fedora-35-Crypt-Optimal-Size",
          "publishedOn": "2021-06-27T00:25:13.000Z",
          "wordCount": 797,
          "title": "Fedora 35 To Automatically Use Optimal Encryption Sector Size For Better I/O Performance"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.14-Early-Look",
          "author": null,
          "description": "Linux 5.13 will debut tomorrow if Linus Torvalds is comfortable with the state of the code-base, which in turn will mark the opening of the Linux 5.14 merge window. Here is a look at what is on the table for this next follow-on version of the Linux kernel...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.14-Early-Look",
          "publishedOn": "2021-06-26T14:00:00.000Z",
          "wordCount": 1123,
          "title": "Linux 5.14 Set To See Many New Features, New GPU Support, Other Exciting Changes"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-Hardware-Timestamp",
          "author": null,
          "description": "A proposal by NVIDIA engineers for the mainline Linux kernel would introduce the Hardware Timestamping Engine (HTE) subsystem...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-Hardware-Timestamp",
          "publishedOn": "2021-06-26T13:45:11.000Z",
          "wordCount": 838,
          "title": "NVIDIA Proposes The Linux Hardware Timestamping Engine"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=DragonFlyBSD-Better-LL-Perf",
          "author": null,
          "description": "Software running on DragonFlyBSD and making use of pthreads is set to see better performance around low-level locks when heavily contested...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=DragonFlyBSD-Better-LL-Perf",
          "publishedOn": "2021-06-26T11:17:17.000Z",
          "wordCount": 788,
          "title": "DragonFlyBSD To See Better Low-Level Lock Performance When Heavily Contested"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Huawei-In-Kernel-Trans-DB",
          "author": null,
          "description": "While some Huawei engineers are currently facing criticism for submitting superfluous kernel patches in an effort to boost their own or the company's standing in the kernel community, other engineers at Huawei are working on more substantive kernel patches. Here's a rather peculiar new patch series out on Friday where a Huawei engineer is effectively proposing an in-kernel transactional database...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Huawei-In-Kernel-Trans-DB",
          "publishedOn": "2021-06-26T10:28:54.000Z",
          "wordCount": 768,
          "title": "Huawei Proposes In-Kernel Transactional Database For Security Purposes"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=KDE-Akademy-2021-Week",
          "author": null,
          "description": "Even with Akademy 2021 this week as the annual KDE developer conference, thanks in part to it being a virtual event the KDE developers still managed to remain quite productive on new code changes...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=KDE-Akademy-2021-Week",
          "publishedOn": "2021-06-26T10:00:16.000Z",
          "wordCount": 794,
          "title": "KDE Pushes More Plasma Wayland Improvements, Plug-in System For The Konsole"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Coreboot-FSP-T-Not-Needed",
          "author": null,
          "description": "Coreboot making progress on its temporary RAM initialization code (cache as RAM) means that its usage of the FSP-T binary blob is increasingly unnecessary...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Coreboot-FSP-T-Not-Needed",
          "publishedOn": "2021-06-25T19:45:27.000Z",
          "wordCount": 972,
          "title": "Coreboot Is Ridding Its Need For Intel's FSP-T Blob"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Proton-6.3-5-Released",
          "author": null,
          "description": "Valve and their partners have issued a new version of Proton for powering Steam Play to enjoy Windows games on Linux...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Proton-6.3-5-Released",
          "publishedOn": "2021-06-25T18:40:12.000Z",
          "wordCount": 805,
          "title": "Proton 6.3-5 Released  With A Number Of Improvements For Windows Games On Linux"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30294",
          "author": null,
          "description": "Earlier this month were benchmarks looking at GCC 11 performance with varying optimization levels and features like link-time optimizations. Stemming from reader requests, here are now similar reference benchmarks off LLVM Clang 12.0 on the same system with going from -O0 to -Ofast and toggling -march=native and LTO usage.",
          "link": "https://www.phoronix.com/vr.php?view=30294",
          "publishedOn": "2021-06-25T16:00:00.000Z",
          "wordCount": 808,
          "title": "LLVM Clang 12 Benchmarks At Varying Optimization Levels, LTO"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=systemd-249-rc2",
          "author": null,
          "description": "Earlier this month systemd 249-rc1 arrived with a variety of new features and improvements. Now for closing out the month is a second release candidate...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=systemd-249-rc2",
          "publishedOn": "2021-06-25T15:00:55.000Z",
          "wordCount": 719,
          "title": "systemd 249-rc2 Released With New \"ConditionOSRelease\" Directive"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.13-Features",
          "author": null,
          "description": "If all is looking well on Sunday, Linus Torvalds will be releasing Linux 5.13 as stable rather than going with a 5.13-rc8 test release and pushing the final version back by an additional release. In either case, Linux 5.13 is coming out soon and with many new features in tow...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.13-Features",
          "publishedOn": "2021-06-25T14:07:33.000Z",
          "wordCount": 1031,
          "title": "The 13 Most Interesting Changes Of Linux 5.13 From Apple M1 To Security Enhancements"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=MyGNUHealth-1.0",
          "author": null,
          "description": "Among the many projects under the GNU umbrella, the GNU Health official project has been about working on the libre digital health ecosystem and their most recent effort is on MyGNUHealth as an effort around libre personal health records...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=MyGNUHealth-1.0",
          "publishedOn": "2021-06-25T12:44:42.000Z",
          "wordCount": 798,
          "title": "MyGNUHealth 1.0 - GNU Looks To Get More Involved With Personal Health Records"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=AMDVLK-2021.Q2.6",
          "author": null,
          "description": "Following the announcement this week that AMD is dropping pre-Polaris GPU support (or pre-Raven Ridge support for APUs) from their mainline Radeon Software driver on Windows, the AMDVLK open-source Vulkan driver has also now similarly discontinued that older GPU support...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=AMDVLK-2021.Q2.6",
          "publishedOn": "2021-06-25T10:08:08.000Z",
          "wordCount": 969,
          "title": "AMDVLK 2021.Q2.6 Vulkan Driver Released - Removes Pre-Polaris / Pre-Raven Support"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-SFH-Next-Gen-Patches",
          "author": null,
          "description": "There's the next chapter to the unfortunately rather sad state of the AMD Sensor Fusion Hub (SFH) driver support under Linux...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-SFH-Next-Gen-Patches",
          "publishedOn": "2021-06-25T05:02:05.000Z",
          "wordCount": 1032,
          "title": "AMD SFH Linux Driver Updated For \"Next Gen\" Ryzen Laptops"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Sway-1.6.1-Wayland-Compositor",
          "author": null,
          "description": "Simon Ser has released Sway 1.6.1 as the newest version of this popular i3-inspired Wayland compositor...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Sway-1.6.1-Wayland-Compositor",
          "publishedOn": "2021-06-25T04:00:00.000Z",
          "wordCount": 781,
          "title": "Sway 1.6.1 Wayland Compositor Released With WLROOTS 0.14"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30288",
          "author": null,
          "description": "Since Crocus was merged into mainline Mesa last week we have been looking at benchmarks of this new open-source Intel Gallium3D driver designed exclusively for older Intel graphics hardware (i965 Gen4 through Haswell Gen7, plus Cherrvyiew and experimental Gen8 Broadwell) compared to the existing open-source i965 classic driver. Prior articles have looked at the quite good performance with Haswell while Sandy Bridge is in somewhat rough shape. Today's testing is going in the middle and looking at the Crocus vs. i965 OpenGL driver performance for Ivy Bridge with the once great Core i7 3770K.",
          "link": "https://www.phoronix.com/vr.php?view=30288",
          "publishedOn": "2021-06-24T20:00:00.000Z",
          "wordCount": 737,
          "title": "Another Test Drive With Crocus Gallium3D On Old Intel Hardware"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Dell-BIOS-Disconnect-Vuln",
          "author": null,
          "description": "For those wondering about the recent skyrocketing in LVFS/FWUPD usage for Linux firmware updates, it appears to be attributed to Dell pushing out a massive number of updates with more than one hundred models impacted by newly-disclosed BIOS/UEFI vulnerabilities...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Dell-BIOS-Disconnect-Vuln",
          "publishedOn": "2021-06-24T16:07:36.000Z",
          "wordCount": 835,
          "title": "Dell BIOS/UEFI Under Attack From New Vulnerabilities - Use FWUPD For The Latest Updates"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Windows-11-Announcement",
          "author": null,
          "description": "As expected this morning Microsoft officially lifted the curtain on Windows 11 as the latest evolutionary step to their operating system past Windows 10...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Windows-11-Announcement",
          "publishedOn": "2021-06-24T16:00:00.000Z",
          "wordCount": 805,
          "title": "Microsoft Announces Windows 11 - Benchmarks Against Linux To Begin Soon"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=AWS-BugBust",
          "author": null,
          "description": "Amazon today launched AWS BugBust as a global coding challenge where they are hoping to see one million software bugs addressed and to reduce technical debt by over $100 million USD...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=AWS-BugBust",
          "publishedOn": "2021-06-24T15:30:00.000Z",
          "wordCount": 766,
          "title": "Amazon Launches AWS BugBust With A Goal To Fix One Million Software Bugs"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Google-Vulnerability-Schema",
          "author": null,
          "description": "As part of Google's latest work on trying to enhance open-source software security, months after starting their own open-source vulnerability database they are now looking to push an open-source vulnerability interchange schema to make it easier to exchange information on vulnerabilities and making it easier for automated analysis...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Google-Vulnerability-Schema",
          "publishedOn": "2021-06-24T13:15:25.000Z",
          "wordCount": 810,
          "title": "Google Proposes An Open-Source Vulnerability Interchange Schema"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-BPF-Spectre-33624",
          "author": null,
          "description": "With the latest mainline Git kernel as well as the newest stable point releases as of Wednesday, a Spectre issue with the kernel's  BPF subsystem has been addressed...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-BPF-Spectre-33624",
          "publishedOn": "2021-06-24T13:00:18.000Z",
          "wordCount": 864,
          "title": "Linux Kernel's BPF Fixed Up Against Spectre Vulnerability Bypass"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=SM4-AVX-AES-NI-Kernel",
          "author": null,
          "description": "Alibaba engineers are looking to mainline an x86_64 tuned version of the SM4 cipher that with making use of AVX and AES-NI can allow for a dramatic performance speed-up...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=SM4-AVX-AES-NI-Kernel",
          "publishedOn": "2021-06-24T11:00:01.000Z",
          "wordCount": 741,
          "title": "~5x Faster SM4 Cipher Performance With AVX/AES-NI Tuned Linux Kernel Code"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=ODF-1.3-OASIS-Approved",
          "author": null,
          "description": "The OASIS standards organization has now officially approved of the ODF 1.3 revision of the OpenDocument Format as their newest ratified standard...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=ODF-1.3-OASIS-Approved",
          "publishedOn": "2021-06-24T10:14:45.000Z",
          "wordCount": 791,
          "title": "OpenDocument Format 1.3 Approved As OASIS Standard"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Dota-2-FidelityFX-Super-Res",
          "author": null,
          "description": "Valve's Dota 2 game is the latest adding support for AMD FidelityFX Super Resolution and the first time having a Linux-native game support FSR for enhanced image upscaling...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Dota-2-FidelityFX-Super-Res",
          "publishedOn": "2021-06-24T10:01:05.000Z",
          "wordCount": 896,
          "title": "Valve's Dota 2 Adds AMD FidelityFX Super Resolution"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=XMM-Fast-Hypercalls-KVM-5.14",
          "author": null,
          "description": "With the KVM code set to be merged in the coming weeks for the Linux 5.14 kernel, support for fast XMM hypercalls is coming for its Hyper-V guest support in allowing for some performance benefits...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=XMM-Fast-Hypercalls-KVM-5.14",
          "publishedOn": "2021-06-24T04:00:00.000Z",
          "wordCount": 746,
          "title": "Linux 5.14 To Support XMM Fast Hypercalls For Hyper-V On KVM"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-PSF-Control-Still-Waiting",
          "author": null,
          "description": "It's been three months since AMD published a security whitepaper outlining the possibility of a side channel attack with PSF. The Predictive Store Forwarding functionality is new to AMD Zen 3 (Ryzen 5000 / EPYC 7003 series) processors and as part of their security analysis they are allowing users the ability to opt-out of using this feature in the name of greater security but the feature still hasn't been picked up for the mainline Linux kernel...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-PSF-Control-Still-Waiting",
          "publishedOn": "2021-06-23T17:45:54.000Z",
          "wordCount": 1112,
          "title": "AMD PSF Control Support Still Awaiting The Mainline Linux Kernel"
        }
      ]
    }
  ],
  "cliVersion": "1.11.0"
}