{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": []
    },
    {
      "title": "GitLab",
      "feedUrl": "https://about.gitlab.com/atom.xml",
      "siteUrl": "https://about.gitlab.com/blog/",
      "articles": [
        {
          "id": "https://about.gitlab.com/blog/2021/07/29/velocity-with-confidence/",
          "author": null,
          "description": "How DevOps and NFS changed the game\nWhat if I told you that one of the best-selling racing video game franchises of all time, the \"Need For Speed\" (NFS), and DevOps have more in common with each other than you think? Yes, you read that correctly, probably not the NFS (Network File System) you were expecting.\nAn appetite for change\nFor context, the NFS series originally set out to redefine a saturated, yet unsophisticated, racing video game market. Motivated by an appetite for change, the NFS user experience reflected the human connection to real cars and how they behaved, which was a big challenge for developers in the 1990s. Nearly 30 years ago, \"The Need for Speed\" forever changed the landscape of racing games, selling 150 million copies since its debut.\n\nThe original Need For Speed vide…",
          "link": "https://about.gitlab.com/blog/2021/07/29/velocity-with-confidence/",
          "publishedOn": "2021-07-29T00:00:00.000Z",
          "wordCount": 3056,
          "title": "How GitLab 14 satisfies the need for speed with modern DevOps"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/07/29/how-orange-uses-gitlab-ci-cd-for-modern-devops/",
          "author": null,
          "description": "CI/CD is a foundational piece to modern software development. It's a major brick in the DevOps \"Automation\" pillar and every company involved in IT has to implement CI/CD or they're already quite far behind the curve.\nBut implementing CI/CD can be challenging especially for growing or large companies. Some of those challenges include:\nDevOps expertise and technical skills\nDevSecOps\nStandardization\nThree key hurdles that come with implementing CI/CD\nThis blog post unpackes these challenges and explains how Orange overcame them using GitLab.\nDevOps and technical skills\nNo matter which CI/CD tool you're using, it requires some amount of expertise to implement it right.\nDevOps expertise is important because your team needs some experience with Git workflows, deployment, environments, secrets m…",
          "link": "https://about.gitlab.com/blog/2021/07/29/how-orange-uses-gitlab-ci-cd-for-modern-devops/",
          "publishedOn": "2021-07-29T00:00:00.000Z",
          "wordCount": 3811,
          "title": "How Orange made a first step toward CI/CD standardization with GitLab"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/07/28/secure-container-images-with-gitlab-and-grype/",
          "author": null,
          "description": "The importance of container image security\nThanks to containers, what it means to \"ship software\" has changed dramatically. Engineering teams have shifted to produce container images and use these container images to deploy their software. Because of this change teams are now shipping significantly more software alongside their app – whether they realize it or not.\nBesides packaging an application, container images also include hundreds of binaries and libraries. These binaries and libraries are included in the container image produced by the team because the process of creating a container image requires teams to select a base image. A base image is a preexisting container image on which to \"base\" their own container image. In doing so, all software contained in the base image is inherite…",
          "link": "https://about.gitlab.com/blog/2021/07/28/secure-container-images-with-gitlab-and-grype/",
          "publishedOn": "2021-07-28T00:00:00.000Z",
          "wordCount": 2230,
          "title": "How to secure your container images with GitLab and Grype"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/07/28/gitlab-14-1-1-released/",
          "author": null,
          "description": "Today we are releasing version 14.1.1 for GitLab Community Edition and Enterprise Edition.\nThis version resolves a number of regressions and bugs in\nthis month's 14.1 release and\nprior versions.\nGitLab Community Edition and Enterprise Edition\nAvailable in GitLab Free, Premium, and Ultimate:\nExtend RackAttack basic authentication detection for rate limiting\nEnable bulk dismissal checkboxes on group vulnerability report\"\nFix syntax highlighting inline background on darkmode\nFix: Sidekiq workers delete each other's metrics\nPrevent terms from being created if blank\nRemove backfill migration for ci_build_trace_sections\nGeo: Fix snippet verification by replicating the HEAD ref\nRemove securityScansSucceeded from DevOps adoption\nFix markdown in development docs\nFix deployer task\nDon't ask users to upgrade to PG 13 yet\nImportant notes on upgrading\nThis version does not include any new migrations, and for multi-node deployments, should not require any downtime.\nPlease be aware that by default the Omnibus packages will stop, run migrations,\nand start again, no matter how “big” or “small” the upgrade is. This behavior\ncan be changed by adding a /etc/gitlab/skip-auto-reconfigure file,\nwhich is only used for updates.\nUpdating\nTo update, check out our update page.\nGitLab subscriptions\nAccess to GitLab Premium and Ultimate features is granted by a paid subscription.\nAlternatively, sign up for GitLab.com\nto use GitLab's own infrastructure.",
          "link": "https://about.gitlab.com/releases/2021/07/28/gitlab-14-1-1-released/",
          "publishedOn": "2021-07-28T00:00:00.000Z",
          "wordCount": 1082,
          "title": "GitLab Patch Release: 14.1.1"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/07/26/gitlab-helm-package-registry/",
          "author": null,
          "description": "Cloud native application architectures use containerization, microservices, and Kubernetes to run reliably at cloud-scale. With a built-in container registry and Kubernetes integration, GitLab is the best way to develop and deploy cloud native applications. GitLab version 14.1 also includes a Helm registry, which allows users to publish, install, and share Helm charts and packages from within our single application for the entire DevOps lifecycle.\nWhat is Helm?\nHelm is a package manager for Kubernetes. A Chart is a Helm package that contains the resource definitions required to run an application inside a Kubernetes cluster. Helm allows you to manage complex applications by storing the application definition in a chart that can be versioned, shared, and collaborated on.\nThe differences bet…",
          "link": "https://about.gitlab.com/blog/2021/07/26/gitlab-helm-package-registry/",
          "publishedOn": "2021-07-26T00:00:00.000Z",
          "wordCount": 1927,
          "title": "Introducing the GitLab Helm Package Registry"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/07/23/how-to-agentless-gitops-vars/",
          "author": null,
          "description": "In part one of our GitOps series, we described how to use a pull-based (or agent-based) approach. In this second blog post, we'll dig deep into how to use a push-based approach. The agentless approach may be preferable for situations with non-Kubernetes infrastructure components or when you don't want to install, run, and maintain agents in each infrastructure component for GitOps. In this post, we will discuss how the scripting capabilities of GitLab can be used in GitOps workflows, and how to use predefined GitLab variables to shape infrastructure components.\nAbout a push-based or agentless approach\nWith the agentless approach, infrastructure expressed and managed as code on GitLab, and updates and drift detection are automated and handled by GitLab without having to install any agents o…",
          "link": "https://about.gitlab.com/blog/2021/07/23/how-to-agentless-gitops-vars/",
          "publishedOn": "2021-07-23T00:00:00.000Z",
          "wordCount": 1840,
          "title": "How to use a push-based approach for GitOps with GitLab scripting and variables"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/07/23/announcing-package-hunter/",
          "author": null,
          "description": "Modern programming ecosystems make code reuse exceptionally easy. No matter the\nprogramming task at hand, chances are there is a package in a public registry\nsuch as rubygems.org or npmjs.com that implements that task.\nWhile the reuse of publicly available packages reduces the time necessary to write an app, this reuse\nbrings its own set of challenges. Apps quickly depend on hundreds of packages,\nand programmers often simply just trust that these packages don't contain malicious code.\nIn an ideal world, all depended-upon code is thoroughly vetted before being included in a program – however, this is often unfeasible in practice due to the sheer amount of dependency code that needs to be reviewed and the lack of existing tools to help with vetting dependency code.\nMalicious code in the wild…",
          "link": "https://about.gitlab.com/blog/2021/07/23/announcing-package-hunter/",
          "publishedOn": "2021-07-23T00:00:00.000Z",
          "wordCount": 1959,
          "title": "Meet Package Hunter: A tool for detecting malicious code in your dependencies"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/07/22/gitlab-14-1-released/",
          "author": null,
          "description": "Today, we are excited to announce the release of GitLab 14.1 with the ability to build, publish, and share Helm charts, create escalation policies to page responders, connect GitLab Runners to your Kubernetes clusters, enforce code coverage decisions, and much more!\nThese are just a few highlights from the 50+ improvements in this release. Read on to check out all of the great updates below.\nTo preview what's coming in next month’s release, check out our Upcoming Releases page, which includes our 14.2 release kickoff video.\nJoin us for GitLab Commit Virtual to learn how DevOps teams increase collaboration.\n\n\n\n\n\n\n\n\n\nThis month's Most Valuable Person (MVP) is\nAndrew Smith\n\nAndrew actively contributed numerous merge requests in the GitLab 14.1 release to help improve GitLab’s planning capabil…",
          "link": "https://about.gitlab.com/releases/2021/07/22/gitlab-14-1-released/",
          "publishedOn": "2021-07-22T00:00:00.000Z",
          "wordCount": 7914,
          "title": "GitLab 14.1 released with Helm Chart Registry and Escalation Policies"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/07/21/optimizing-devops-visibility-in-gitlab-14/",
          "author": null,
          "description": "DevOps makes teams and work more efficient, more consistent, and more productive – but how much more?\nOn its surface, the answer is simple. We need to measure workflow from idea to delivery, identify and remove blockers, and benchmark improvements in a manner that is consistent and replicable. The challenge is the way we've typically built the systems that hold the data we're trying to understand.\nEnhanced visibility tools are essential to measuring and optimizing modern DevOps processes, and mapping the work output to ensure the business outcomes that matter are achieved.\nThe failure of DIY DevOps\nMost businesses operate and maintain a multi-product \"DIY DevOps\" toolchain, but stitched-together applications with bespoke integrations don't lend themselves to visibility. Each component in t…",
          "link": "https://about.gitlab.com/blog/2021/07/21/optimizing-devops-visibility-in-gitlab-14/",
          "publishedOn": "2021-07-21T00:00:00.000Z",
          "wordCount": 1903,
          "title": "Optimize DevOps with enhanced visibility tools in GitLab 14"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/07/20/are-you-ready-for-the-newest-era-of-devsecops/",
          "author": null,
          "description": "Security is on everyone's radar, from board members to inquisitive grandparents. Everyone wants to know what software development teams are doing to protect their applications from attacks like that of Colonial Pipeline, Solarwinds, and others. With the launch of GitLab 14, we accelerated modern DevOps by bringing velocity with confidence, built-in security, and visibility, into DevOps success.\nThe modern DevOps solution is platform-driven, has a unified data store, and has security embedded throughout the software development lifecycle (SDLC). We find that it is these three attributes that drive demand for a modern DevOps solution among many different types of businesses.\nSecurity in the modern DevOps solution goes beyond just shifting security features left to empower the developers to f…",
          "link": "https://about.gitlab.com/blog/2021/07/20/are-you-ready-for-the-newest-era-of-devsecops/",
          "publishedOn": "2021-07-20T00:00:00.000Z",
          "wordCount": 2461,
          "title": "Are you ready for the newest era of DevSecOps?"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/07/20/improved-billing-and-subscription-management/",
          "author": null,
          "description": "What you need to know\nGitLab moves from annual true-ups to quarterly subscription reconciliation\nIntroduces cloud licensing and auto-renewals for improved license management\nRequires collection of operational data for customer success services\nApplicable to new customers from August 1, 2021 and existing customers at their next renewal\nToday, we are announcing changes to improve the billing and subscription management experience for customers. While quarterly subscription reconciliation benefits both our SaaS and self-managed customers, the three other improvements, including the collection of operational data for customer success services, auto-renewals, and cloud licensing, will enhance the product and service experience for self-managed customers.\nWhile other vendors are shifting to only…",
          "link": "https://about.gitlab.com/blog/2021/07/20/improved-billing-and-subscription-management/",
          "publishedOn": "2021-07-20T00:00:00.000Z",
          "wordCount": 2391,
          "title": "GitLab introduces updates to paid tiers for improved billing and subscription management"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/07/20/gitlab-14-0-6-released/",
          "author": null,
          "description": "Today we are releasing version 14.0.6 for GitLab Community Edition and Enterprise Edition.\nThis version resolves a number of regressions and bugs in\nthis month's 14.0 release and\nprior versions.\nGitLab Community Edition and Enterprise Edition\nAvailable in GitLab Free, Premium, and Ultimate:\nReplace Excon with Faraday for requesting object storage\nFix LFS objects not downloading with Bitbucket\nResolve \"Terraform module usage instructions are incorrect\"\nGeo: Fix snippet verification by replicating the HEAD ref\nFix validation method regarding MIME type keys\ncoordinator: Fix repo creation/removal race for up-to-date secondaries for 14-0-stable\nImportant notes on upgrading\nThis version does not include any new migrations, and for multi-node deployments, should not require any downtime.\nPlease be aware that by default the Omnibus packages will stop, run migrations,\nand start again, no matter how “big” or “small” the upgrade is. This behavior\ncan be changed by adding a /etc/gitlab/skip-auto-reconfigure file,\nwhich is only used for updates.\nUpdating\nTo update, check out our update page.\nGitLab subscriptions\nAccess to GitLab Premium and Ultimate features is granted by a paid subscription.\nAlternatively, sign up for GitLab.com\nto use GitLab's own infrastructure.",
          "link": "https://about.gitlab.com/releases/2021/07/20/gitlab-14-0-6-released/",
          "publishedOn": "2021-07-20T00:00:00.000Z",
          "wordCount": 1063,
          "title": "GitLab Patch Release: 14.0.6"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/07/19/teams-gitpod-integration-gitlab-speed-up-development/",
          "author": null,
          "description": "Turn back time a bit and try to remember the first project you started or joined, and the onboarding experience. How long did it take to install the development environment on your local machine?\nWe talked about our own onboarding experiences into software development, and thought about sharing our favorite tips with GitLab users.\nA developer's tale\nEveryone starts fresh, and often best practices are just \"learning by doing,\" requiring documentation in the same moment. Programming languages and application architectures are also different - a C++ backend environment has different requirements than a Ruby on Rails web application.\nStart with defining the requirements and stages. Oftentimes they are equivalent to CI/CD pipeline stages but executed in your own environment.\nCompile/build the a…",
          "link": "https://about.gitlab.com/blog/2021/07/19/teams-gitpod-integration-gitlab-speed-up-development/",
          "publishedOn": "2021-07-19T00:00:00.000Z",
          "wordCount": 5481,
          "title": "How teams can use the Gitpod integration in GitLab to speed up their development process"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/07/12/gitops-as-the-evolution-of-operations/",
          "author": null,
          "description": "GitOps is a hot topic in the world of operations, but what does it provide to workflows that we didn’t have already? Looking at the evolution of the operations space, there have been many big changes in the past 20 years, and I argue that GitOps is not a change, rather a summary of best practices. So, how do we describe the major phenomenon in Ops over the past 20 years?\nBefore 2000, the primary approach to operations was to hire a System Administrator or empower Lead Developers to do Ops work. System Administrators knew a lot about networking and server optimisations, and a good sysadmin can do most of their work through code, using Bash, Perl or Python scripts. While every software engineer likely knows at least the basics of shell scripting, even many backend engineers would not be comf…",
          "link": "https://about.gitlab.com/blog/2021/07/12/gitops-as-the-evolution-of-operations/",
          "publishedOn": "2021-07-12T00:00:00.000Z",
          "wordCount": 3710,
          "title": "GitOps viewed as part of the Ops evolution"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/07/09/creating-a-threat-model-that-works-for-gitlab/",
          "author": null,
          "description": "This is the first in a series of three blog posts where we discuss threat modeling and how we’re using it at GitLab to help secure our product, our company, and most importantly our customer’s data. As usual, we’re doing things a bit differently, but when you hear why it will make a lot of sense.\nThreat modeling\nLet’s start with the basics, what is threat modeling?\nThreat modeling is the process of risk assessment for a particular project, asset, procedure, or product. While it can apply to nearly any established or new procedure, it seems to most often get applied to software. For GitLab, this would mainly apply to our source code.\nAs assessing risk has historically been the domain of the security department of most organizations, the threat modeling process has been nearly exclusively ha…",
          "link": "https://about.gitlab.com/blog/2021/07/09/creating-a-threat-model-that-works-for-gitlab/",
          "publishedOn": "2021-07-09T00:00:00.000Z",
          "wordCount": 3187,
          "title": "How we’re creating a threat model framework that works for GitLab"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/07/08/two-bugs-and-a-quick-fix-in-gitpod/",
          "author": null,
          "description": "While looking at GitLab's Gitpod integration, I came across two rather critical flaws in Gitpod itself. In this post, I'll cover the process of identifying the vulnerabilities and some background on Gitpod. The more critical issue was fixed and the fix was pushed to production by the Gitpod team in less than five hours from my initial report. Huge kudos to the Gitpod team for that quick turnaround.\nWhat is Gitpod?\nFirst, let's see what Gitpod actually is – taken straight from gitpod.io:\nSpin up fresh, automated dev environments for each task, in the cloud, in seconds.\nThat quote sums it up really well. You can login to Gitpod with your GitLab, GitHub, or Bitbucket account and then use a pretty full-blown, web-based development environment to work on your code, run tests, or even spin up se…",
          "link": "https://about.gitlab.com/blog/2021/07/08/two-bugs-and-a-quick-fix-in-gitpod/",
          "publishedOn": "2021-07-08T00:00:00.000Z",
          "wordCount": 2919,
          "title": "A brief look at Gitpod, two bugs, and a quick fix"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/07/08/gitlab-14-0-5-released/",
          "author": null,
          "description": "Today we are releasing version 14.0.5 for GitLab Community Edition and Enterprise Edition.\nThis version resolves a number of regressions and bugs in\nthis month's 14.0 release and\nprior versions.\nGitLab Community Edition and Enterprise Edition\nResolve \"404 for package details link under Infrastructure Registry for projects nested under 2 group levels\"\nResolve \"Terraform module usage instructions are incorrect\"\nAdd documentation for boards epic create\nInitialize conversion of ci_builds_metadata.id for bigint migration\nFix git clone for projects with a trailing dot over HTTP\nDo not create audit event for failed logins on read-only DB\nAdd prefix to autocomplete path\nReturn empty strings for Jira links when URL is not set\nFix libmagic not being able to find magic files\nImportant notes on upgrading\nThis version does not include any new migrations, and for multi-node deployments, should not require any downtime.\nPlease be aware that by default the Omnibus packages will stop, run migrations,\nand start again, no matter how “big” or “small” the upgrade is. This behavior\ncan be changed by adding a /etc/gitlab/skip-auto-reconfigure file,\nwhich is only used for updates.\nUpdating\nTo update, check out our update page.\nGitLab subscriptions\nAccess to GitLab Premium and Ultimate features is granted by a paid subscription.\nAlternatively, sign up for GitLab.com\nto use GitLab's own infrastructure.",
          "link": "https://about.gitlab.com/releases/2021/07/08/gitlab-14-0-5-released/",
          "publishedOn": "2021-07-08T00:00:00.000Z",
          "wordCount": 1090,
          "title": "GitLab Patch Release: 14.0.5"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/07/07/critical-security-release-gitlab-14-0-4-released/",
          "author": null,
          "description": "Today we are releasing versions 14.0.4, 13.12.8, and 13.11.7 for GitLab Community Edition (CE) and Enterprise Edition (EE).\nThese versions contain important security fixes, and we strongly recommend that all GitLab installations be upgraded to one of these versions immediately.\nGitLab releases patches for vulnerabilities in dedicated security releases. There are two types of security releases: a monthly, scheduled security release, released a week after the feature release (which deploys on the 22nd of each month), and ad-hoc security releases for critical vulnerabilities. For more information, you can visit our security FAQ. You can see all of our regular and security release blog posts here. In addition, the issues detailing each vulnerability are made public on our issue tracker 30 days…",
          "link": "https://about.gitlab.com/releases/2021/07/07/critical-security-release-gitlab-14-0-4-released/",
          "publishedOn": "2021-07-07T00:00:00.000Z",
          "wordCount": 1250,
          "title": "GitLab Critical Security Release: 14.0.4, 13.12.8, and 13.11.7"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/07/06/gitlab-14-0-3-released/",
          "author": null,
          "description": "Today we are releasing version 14.0.3 for GitLab Community Edition and Enterprise Edition.\nThis version resolves a number of regressions and bugs in\nthis month's 14.0 release and\nprior versions.\nGitLab Community Edition and Enterprise Edition\nReintroduce recursive_approach_for_all_projects default-enabled\nFix pages deployment storage migration\nFix frequent items timestamps not updated\nFix bug where Milestone page led to console error\nFix broken Time Tracking Reports on Issuable sidebar\nGeo - Fix state value in the lfs_object_registry table\nRevert a 14.0 change in the deployments API\nDevOps Adoption - ensure displayNamespaceId is included\nGeo - Move migration to a pre-deployment migration\nRun batched migrations on self-managed instances\nFix deploy keys not working with LFS auth check\nRepository: Fix repo replication with transactions\nRepository: Fix excessive voting in CreateRepositoryFromBundle\nImportant notes on upgrading\nThis version does not include any new migrations, and for multi-node deployments, should not require any downtime.\nPlease be aware that by default the Omnibus packages will stop, run migrations,\nand start again, no matter how “big” or “small” the upgrade is. This behavior\ncan be changed by adding a /etc/gitlab/skip-auto-reconfigure file,\nwhich is only used for updates.\nUpdating\nTo update, check out our update page.\nGitLab subscriptions\nAccess to GitLab Premium and Ultimate features is granted by a paid subscription.\nAlternatively, sign up for GitLab.com\nto use GitLab's own infrastructure.",
          "link": "https://about.gitlab.com/releases/2021/07/06/gitlab-14-0-3-released/",
          "publishedOn": "2021-07-06T00:00:00.000Z",
          "wordCount": 1097,
          "title": "GitLab Patch Release: 14.0.3"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/07/05/gitlab-13-12-7-released/",
          "author": null,
          "description": "Today we are releasing version 13.12.7 for GitLab Community Edition and Enterprise Edition.\nThis version resolves a number of regressions and bugs in\nthis month's 13.12 release and\nprior versions.\nGitLab Community Edition and Enterprise Edition\nAvailable in GitLab Free, Premium, and Ultimate:\nFix pages deployment storage migration\nReintroduce recursive_approach_for_all_projects default-enabled\nExempt unicorn['svlogd_prefix'] from deprecation check\nGitaly: fixes to issues with strong consistency/transactional voting\nGeo - Fix state value in the lfs_object_registry table\nImportant notes on upgrading\nThis version does not include any new migrations, and for multi-node deployments, should not require any downtime.\nPlease be aware that by default the Omnibus packages will stop, run migrations,\nand start again, no matter how “big” or “small” the upgrade is. This behavior\ncan be changed by adding a /etc/gitlab/skip-auto-reconfigure file,\nwhich is only used for updates.\nUpdating\nTo update, check out our update page.\nGitLab subscriptions\nAccess to GitLab Premium and Ultimate features is granted by a paid subscription.\nAlternatively, sign up for GitLab.com\nto use GitLab's own infrastructure.",
          "link": "https://about.gitlab.com/releases/2021/07/05/gitlab-13-12-7-released/",
          "publishedOn": "2021-07-05T00:00:00.000Z",
          "wordCount": 1043,
          "title": "GitLab Patch Release: 13.12.7"
        }
      ]
    },
    {
      "title": "Phoronix",
      "feedUrl": "https://www.phoronix.com/rss.php",
      "siteUrl": "https://www.phoronix.com/",
      "articles": [
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-SB-RMI-Linux-Sensor",
          "author": null,
          "description": "AMD continues pushing new code out for Linux in better exposing their platform's capabilities in the open-source world. The latest AMD driver work now queued via \"-next\" branches for introduction this autumn in Linux 5.15 is SB-RMI sensor support...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-SB-RMI-Linux-Sensor",
          "publishedOn": "2021-08-02T20:00:12.000Z",
          "wordCount": 988,
          "title": "AMD SB-RMI Driver Coming For Linux 5.15"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=WireGuardNT-Windows-Kernel",
          "author": null,
          "description": "The excellent WireGuard open-source secure VPN tunnel has been seeing growing adoption on Linux now that it's been in the mainline kernel for a while and also seeing continued progress on the BSDs. While there has been beta WireGuard for Windows in user-space, \"WireGuardNT\" was announced today as a native high-performance port to the Windows kernel...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=WireGuardNT-Windows-Kernel",
          "publishedOn": "2021-08-02T18:13:20.000Z",
          "wordCount": 950,
          "title": "WireGuard Sees Native, High-Performance Port To The Windows Kernel"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=FWUPD-1.6.2",
          "author": null,
          "description": "While FWUPD 1.5.12 released last week with expanded support for Poly web cameras, FWUPD 1.6.2 is out today as the newest feature release in their latest series. FWUPD 1.6.2 brings several significant improvements for advancing open-source firmware update capabilities on Linux...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=FWUPD-1.6.2",
          "publishedOn": "2021-08-02T17:54:20.000Z",
          "wordCount": 817,
          "title": "FWUPD 1.6.2 Released With Exciting Improvements For Hardware Firmware Updates On Linux"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-Valve-New-CPU-Freq",
          "author": null,
          "description": "Along with other optimizations to benefit the Steam Deck, AMD and Valve have been jointly working on CPU frequency/power scaling improvements to enhance the Steam Play gaming experience on modern AMD platforms running Linux...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-Valve-New-CPU-Freq",
          "publishedOn": "2021-08-02T12:00:00.000Z",
          "wordCount": 1079,
          "title": "AMD + Valve Working On New Linux CPU Performance Scaling Design"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Debian-Installer-Bullseye-RC3",
          "author": null,
          "description": "Debian 11 \"Bullseye\" is set to be released mid-August while out this morning is the third release candidate of the Debian Bullseye installer. With this installer update is more documentation for users letting them know the risks of modern graphics cards and the like that are often inoperable unless loading firmware that isn't considered free software...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Debian-Installer-Bullseye-RC3",
          "publishedOn": "2021-08-02T10:38:21.000Z",
          "wordCount": 901,
          "title": "Debian Improves Docs To Inform Users Their Systems Might Not Work Without Non-Free Firmware"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Task-Isolation-Interface-2021",
          "author": null,
          "description": "Red Hat's Marcelo Tosatti has submitted his latest patches implementing a basic task isolation interface for the Linux kernel that would be particularly useful for real-time workloads and high-bandwidth networking applications making use of user-space drivers...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Task-Isolation-Interface-2021",
          "publishedOn": "2021-08-02T10:09:34.000Z",
          "wordCount": 793,
          "title": "Work Is Back Underway On A Task Isolation Interface For The Linux Kernel"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=GNU-C-Library-Glibc-2.34",
          "author": null,
          "description": "Version 2.34 of the GNU C Library (glibc) is now available with a wide variety of changes that accumulated over the past six months...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=GNU-C-Library-Glibc-2.34",
          "publishedOn": "2021-08-02T09:53:21.000Z",
          "wordCount": 928,
          "title": "GNU C Library 2.34 Released With More Functionality Squeezed Into libc"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=X.Org-xeyes-1.2",
          "author": null,
          "description": "Several X.Org/X11 components saw new releases on Sunday for kicking off August, including the xeyes program seeing its first non-point release in eleven years...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=X.Org-xeyes-1.2",
          "publishedOn": "2021-08-02T09:29:52.000Z",
          "wordCount": 780,
          "title": "X.Org's XEyes 1.2 Released, Other Updated X11 Components Too"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Dav1d-0.9.1-Released",
          "author": null,
          "description": "Dav1d 0.9.1 was released on Sunday as the newest feature update to this leading open-source CPU-based AV1 video decoder...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Dav1d-0.9.1-Released",
          "publishedOn": "2021-08-02T07:00:00.000Z",
          "wordCount": 876,
          "title": "dav1d 0.9.1 Released With More Optimizations - Particularly For Older CPUs"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.14-rc4-Released",
          "author": null,
          "description": "Linux 5.14-rc4 is available today as a rather smooth update with nothing too worrisome but just a decent amount of fixes and nothing that is causing Linux creator Linus Torvalds to be frustrated...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.14-rc4-Released",
          "publishedOn": "2021-08-02T00:30:13.000Z",
          "wordCount": 963,
          "title": "Linux 5.14-rc4 Released With Change Following Some Broken Android Apps, Other Fixes"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Steam-Linux-July-2021",
          "author": null,
          "description": "Not only did Valve announce Steam Deck in July but the overall Linux gaming marketshare according to the Steam Survey also hit a multi-year high...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Steam-Linux-July-2021",
          "publishedOn": "2021-08-02T00:15:15.000Z",
          "wordCount": 854,
          "title": "Steam Survey Shows Linux Marketshare Hitting 1.0%"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-MCTP",
          "author": null,
          "description": "Linux 5.15 is positioned now to see a Management Component Transport Protocol (MCTP) implementation with the code now queued in net-next with this being a protocol for communication between management controllers and managed devices...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-MCTP",
          "publishedOn": "2021-08-01T18:42:33.000Z",
          "wordCount": 869,
          "title": "Linux 5.15 Adding Management Component Transport Protocol (MCTP)"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=ReactOS-AMD64-Multi-Monitor",
          "author": null,
          "description": "ReactOS as the long-running open-source project striving for Windows ABI compatibility has been making some significant progress this summer on various endeavors...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=ReactOS-AMD64-Multi-Monitor",
          "publishedOn": "2021-08-01T11:21:08.000Z",
          "wordCount": 817,
          "title": "ReactOS \"Open-Source Windows\" Making Progress On x86_64, Multi-Monitor"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=LibreOffice-7.2-RC2",
          "author": null,
          "description": "LibreOffice 7.2 is preparing to ship this month while out today is LibreOffice 7.2 RC2 for facilitating last minute testing of this leading open-source office suite...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=LibreOffice-7.2-RC2",
          "publishedOn": "2021-08-01T11:13:45.000Z",
          "wordCount": 817,
          "title": "LibreOffice 7.2 RC2 Up For Testing With Its Initial GTK4 Work, Command Pop-Up / HUD"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=July-2021-Highlights",
          "author": null,
          "description": "July was a pretty damn exciting summer month amid the pandemic thanks to many interesting Linux software and hardware announcements...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=July-2021-Highlights",
          "publishedOn": "2021-08-01T10:36:21.000Z",
          "wordCount": 2512,
          "title": "LE9, Canonical's Profits, Steam Deck, & Loongson 3A5000 Made For An Exciting July"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=SDL-2.0.16-Coming",
          "author": null,
          "description": "SDL 2.0.16 is being prepared for release as the successor to SDL 2.0.14. Particularly for Linux users this SDL 2.0.16 update is significant with some key enhancements for this library that is common to multi-platform games and part of the Steam runtime...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=SDL-2.0.16-Coming",
          "publishedOn": "2021-08-01T10:12:12.000Z",
          "wordCount": 895,
          "title": "SDL 2.0.16 Is On The Way With Better Wayland Support, Improved PipeWire Integration"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Lutris-0.5.9-Beta",
          "author": null,
          "description": "Lutris 0.5.9-beta1 is out this Sunday as a rather significant update to this open-source Linux game manager. With this new version there are many new features for this centralized game launcher...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Lutris-0.5.9-Beta",
          "publishedOn": "2021-08-01T09:35:09.000Z",
          "wordCount": 825,
          "title": "Lutris 0.5.9 Beta Released With Epic Games Store Support, DXVK-NVAPI/DLSS, Gamescope"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-Broke-Android-Apps-Pipe",
          "author": null,
          "description": "At the end of 2019 a rework to the Linux kernel's pipe code saw some of its logic reworked to only wake up readers if needed and avoid a possible thundering herd problem. But it turns out some Android libraries abused the functionality and this has led to broken Android applications when moving to recent kernels. While the user-space software is in the wrong, the kernel is sticking to its policy of not breaking user-space and as such Linus Torvalds has changed the code's behavior for Linux 5.14 and to be back-ported to prior stable kernels...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-Broke-Android-Apps-Pipe",
          "publishedOn": "2021-07-31T16:10:45.000Z",
          "wordCount": 924,
          "title": "Linux Changes Pipe Behavior After Breaking Problematic Android Apps On Recent Kernels"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=New-NTFS-Likely-For-Linux-5.15",
          "author": null,
          "description": "It's looking like the new NTFS file-system kernel driver developed by Paragon Software and over the past year revised more than two dozen times could be ready for mainlining in the kernel in about one month's time when the Linux 5.15 merge window opens. Everything is finally aligning and looking like the code is in good enough shape for its initial merging though not necessarily replacing the existing NTFS driver at this point...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=New-NTFS-Likely-For-Linux-5.15",
          "publishedOn": "2021-07-31T13:37:23.000Z",
          "wordCount": 1171,
          "title": "The New NTFS Driver Looks Like It Will Finally Be Ready With Linux 5.15"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Alpha-Specific-x86-Loader-Drop",
          "author": null,
          "description": "As a weekend blast from the past, the Linux 5.14 kernel saw some Alpha CPU architecture updates -- including various fixes and the removal of an Alpha-specific binary loader for running a decades dated x86 software emulator...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Alpha-Specific-x86-Loader-Drop",
          "publishedOn": "2021-07-31T13:21:48.000Z",
          "wordCount": 993,
          "title": "Linux 5.14 Drops Old DEC Alpha-Specific Binary Loader Used For x86 Binary Emulation"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-FWUPD-1.5.12",
          "author": null,
          "description": "For those looking to purchase a high-end Linux-friendly web camera for your home office or other environment, there are a few more options now compatible with Linux's fwupd if interested in having the capability of updating the camera firmware under Linux...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-FWUPD-1.5.12",
          "publishedOn": "2021-07-31T10:42:50.000Z",
          "wordCount": 881,
          "title": "Linux's FWUPD Expands Poly High-End Web Camera Support"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.14-RT-Updates",
          "author": null,
          "description": "The real-time (RT) patches for the Linux kernel still appear a ways off from mainline but at least there is movement on this important patch series for embedded and other use-cases needing real-time support...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.14-RT-Updates",
          "publishedOn": "2021-07-31T10:06:18.000Z",
          "wordCount": 936,
          "title": "More RT Code Out For Review, RT Patches Updated Against Linux 5.14"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=KDE-X11-Better-HiDPI-2021",
          "author": null,
          "description": "While KDE on Wayland has generally enjoyed good HiDPI support, it's now taken until 2021 for KDE's X11 HiDPI support to be in a position of greater usability after evolving over the years...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=KDE-X11-Better-HiDPI-2021",
          "publishedOn": "2021-07-31T09:39:24.000Z",
          "wordCount": 863,
          "title": "KDE's HiDPI Scaling Support For X11 Is Getting Into Better Shape"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Freespire-7.7-Released",
          "author": null,
          "description": "What started off as Lindows twenty years ago as an easy-to-use Linux-based operating system with great Wine integration and easy application support but then changed to Linspire following a Microsoft lawsuit has had quite a journey. PC/OpenSystems LLC revived Linspire after a multi-year gap following the closure of Xandros and since then it's been a rather peculiar platform. Today they are now shifting focus once again...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Freespire-7.7-Released",
          "publishedOn": "2021-07-31T00:50:00.000Z",
          "wordCount": 1156,
          "title": "Linspire-Based Freespire Announces \"Entirely New Direction\" With Cloud Apps..."
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Wine-6.14",
          "author": null,
          "description": "Wine developers have popped open a new bi-weekly development snapshot of this software that allows Windows games/applications to run on Linux and macOS along with being what powers Valve's Steam Play (Proton) and CodeWeavers' CrossOver...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Wine-6.14",
          "publishedOn": "2021-07-30T20:00:00.000Z",
          "wordCount": 807,
          "title": "Wine 6.14 Implements More 32-bit To 64-bit Thunks, Updated Mono"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-Compute-21.30.20482",
          "author": null,
          "description": "Intel's Compute-Runtime stack for providing open-source OpenCL and Level Zero compute for their graphics hardware under Linux is out with a new release...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-Compute-21.30.20482",
          "publishedOn": "2021-07-30T18:00:00.000Z",
          "wordCount": 855,
          "title": "Intel Compute-Runtime 21.30.20482 Brings Initial WSL2 Support"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=xf86-video-amdgpu-21.0.0",
          "author": null,
          "description": "For those making use of Radeon graphics on Linux with an X.Org-based environment and not using the generic xf86-video-modesetting DDX but rather than the xf86-video-amdgpu driver, AMD today put out a rare update to that diminishing driver component...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=xf86-video-amdgpu-21.0.0",
          "publishedOn": "2021-07-30T17:45:42.000Z",
          "wordCount": 804,
          "title": "xf86-video-amdgpu 21.0.0 Released For Radeon Linux Users Still On X.Org"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Cyan-Skillfish-Linux-AMDGPU-5.15",
          "author": null,
          "description": "AMD driver engineers have submitted their latest batch of AMDGPU feature updates to DRM-Next for queuing ahead of the Linux 5.15 merge window opening up in about one month's time. With this latest pull request the big addition is the new \"Cyan Skillfish\" GPU support...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Cyan-Skillfish-Linux-AMDGPU-5.15",
          "publishedOn": "2021-07-30T13:30:01.000Z",
          "wordCount": 829,
          "title": "Radeon \"Cyan Skillfish\" Navi 1x APU Submitted For Linux 5.15 Plus Many Fixes"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=VMware-ESXi-Nasty-Linux-5.13",
          "author": null,
          "description": "VMware has found the Linux 5.13 kernel that was released as stable one month ago has led to a serious performance regression for their ESXi enterprise hypervisor...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=VMware-ESXi-Nasty-Linux-5.13",
          "publishedOn": "2021-07-30T13:00:00.000Z",
          "wordCount": 927,
          "title": "VMware Hits A Nasty Performance Regression With Linux 5.13"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=OpenGL-Drivers-2021-Faking-It",
          "author": null,
          "description": "Years ago particularly when the open-source Linux GPU drivers were in their infancy it was known in some cases having to fake/spoof the GPU driver name or model in order to workaround artificial bugs / problematic code paths targeted to a particular OpenGL driver or even to achieve greater performance. With a new Mesa merge request called \"Unleash the dragon!\", this is still very much a problem in 2021 even now in the Android space...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=OpenGL-Drivers-2021-Faking-It",
          "publishedOn": "2021-07-30T11:00:00.000Z",
          "wordCount": 921,
          "title": "OpenGL Drivers In 2021 Still Sadly Benefit From Faking Their Driver Name / GPU"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30401",
          "author": null,
          "description": "AMD just lifted the embargo on the Radeon RX 6600 XT, its newest entry in their RDNA2 line-up and optimized for delivering a superior 1080p gaming performance against the NVIDIA GeForce RTX 3060 series. The RX 6600 XT isn't hitting retail availability until August and that is when we'll be able to publish benchmarks, but for now here is an overview of this new graphics card launching at the $379 price point.",
          "link": "https://www.phoronix.com/vr.php?view=30401",
          "publishedOn": "2021-07-30T03:30:00.000Z",
          "wordCount": 1144,
          "title": "AMD Radeon RX 6600 XT Launching For 1080p RDNA2 Gaming At ~$379 USD"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30395",
          "author": null,
          "description": "Following the recent benchmarks seeing how AMD's new AOCC 3.1 compiler has brought some performance improvements over the prior AOCC 3.0 release that introduced initial Zen 3 optimizations, here are some benchmarks looking at how that latest AMD Optimizing C/C++ Compiler performance compares to the upstream LLVM Clang 12 compiler for which it is based as well as against GCC 11 as the latest GNU compiler release that remains common to Linux systems.",
          "link": "https://www.phoronix.com/vr.php?view=30395",
          "publishedOn": "2021-07-29T12:50:00.000Z",
          "wordCount": 846,
          "title": "AOCC 3.1 Compiler Performance Against Clang 12, GCC 11 On AMD EPYC"
        }
      ]
    }
  ],
  "cliVersion": "1.11.0"
}