{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": [
        {
          "id": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.2",
          "author": null,
          "description": "Fixed: unicode characters in URL caused download error\nFixed: project root npm install error\nAdded: unit test library\nChore: Dependency updates\nThank you: @CaptNo1",
          "link": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.2",
          "publishedOn": "2021-09-26T18:45:39.000Z",
          "wordCount": 354,
          "title": "v1.11.2"
        },
        {
          "id": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.1",
          "author": null,
          "description": "Fixed: Unexpected nested element in author field crashes the parser\nThank you @ad-m",
          "link": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.1",
          "publishedOn": "2021-09-16T06:39:32.000Z",
          "wordCount": 344,
          "title": "v1.11.1"
        }
      ]
    },
    {
      "title": "GitLab",
      "feedUrl": "https://about.gitlab.com/atom.xml",
      "siteUrl": "https://about.gitlab.com/blog/",
      "articles": [
        {
          "id": "https://about.gitlab.com/blog/2021/10/14/gitlab-inc-takes-the-devops-platform-public/",
          "author": null,
          "description": "Today, GitLab Inc. announced the next milestone in our journey as we become a publicly traded company on the Nasdaq Global Market (NASDAQ: GTLB). GitLab was the first company to publicly live stream the entire end-to-end listing day at Nasdaq.\nIn a world where software defines the speed of innovation, every company must become a software company or they’ll be disrupted by a software company. We believe that GitLab, the DevOps Platform, helps companies to deliver software faster and more efficiently, while strengthening security and compliance. And it all happens inside our single platform where engineering, security, and operations teams can collaborate together.\nIn my Founder’s Letter, which you can read below, I told GitLab’s origin story. GitLab did not start in a tech incubator, garage…",
          "link": "https://about.gitlab.com/blog/2021/10/14/gitlab-inc-takes-the-devops-platform-public/",
          "publishedOn": "2021-10-14T00:00:00.000Z",
          "wordCount": 7210,
          "title": "GitLab Inc. takes The DevOps Platform public"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/10/12/open-shift-ga/",
          "author": null,
          "description": "Today, GitLab is pleased to announce the general availability (GA) of the GitLab-supported GitLab Operator, with the ability to run production instances of GitLab on Kubernetes platforms, including Red Hat OpenShift.\nIT organizations that rely on Red Hat OpenShift can now deploy and run GitLab on the same infrastructure they trust for their other shared services. For many organizations in the public sector and regulated industries that only use Red Hat OpenShift, the Operator unlocks the ability to use GitLab, the DevOps Platform, allowing them to move out of the DIY DevOps stage and embrace modern DevOps practices with greater speed, efficiency, and improved security.\n \n\n\n\nWhy did we build the GitLab Operator?\nWe believe user expectations are at an all-time high. They expect always-on app…",
          "link": "https://about.gitlab.com/blog/2021/10/12/open-shift-ga/",
          "publishedOn": "2021-10-12T00:00:00.000Z",
          "wordCount": 2090,
          "title": "GitLab’s Kubernetes Operator with support for Red Hat OpenShift is now generally available"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/10/12/gitlab-updates-its-cookie-management-tool/",
          "author": null,
          "description": "We recently completed a review of our cookie management tool and have decided to take this opportunity to improve the overall experience for our users by unifying our cookie management tool across all GitLab Inc. domains.\nGitLab committed to not sending  service usage data from our products (GitLab SaaS and self-managed) to a third-party product analytics service and we keep that commitment with this update.\nWhat is changing?\nWe’re unifying our cookie management tool across all GitLab Inc. domains to improve the user experience. Starting on 2021-10-12 we will deploy the OneTrust Cookie Management Tool to manage cookies across all gitlab.com sites. This change will provide users with a central location to opt in or out of cookies that are not strictly necessary for our site and its subdomains, including docs.gitlab.com, about.gitlab.com and customers.gitlab.com.\nWe also plan to add  a cookie to our trial signup flow and to our commerce flows located inside the gitlab.com application to enable us to understand how visitors are engaging with these pages and to help analyze and and improve these flows and resolve any technical issues.  This cookie will not be used for any tracking of how you use the functionality of our SaaS or self-managed products, and users can opt in or out of this cookie through our cookie management tool.\nWhat won’t change\nWe will not be adding additional metrics or mechanisms to collect analytics data from our core product (including all GitLab features and categories). We will continue to honor the Do Not Track (DNT) mechanism in web browsers for both GitLab.com and GitLab Self-Managed users.\nTimeline and implementation\nWe plan to roll  out the new cookie management tool on 2021-10-12. This will replace our current cookie tool and will require users to review a new cookie notice and manage the settings of cookies on their next visit. Those settings will be retained per-device and per browser and can be modified after the original selection.",
          "link": "https://about.gitlab.com/blog/2021/10/12/gitlab-updates-its-cookie-management-tool/",
          "publishedOn": "2021-10-12T00:00:00.000Z",
          "wordCount": 1393,
          "title": "GitLab updates its cookie management tool"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/10/12/gitlab-14-3-3-released/",
          "author": null,
          "description": "Today we are releasing version 14.3.3 for GitLab Community Edition and Enterprise Edition.\nThis version resolves a number of regressions and bugs in\nthis month's 14.3 release and\nprior versions.\nGitLab Community Edition and Enterprise Edition\nFix dependency proxy image prefix\nDrop taggings index if exists during migration\nFix 2FA setup for users with no password\nDisable caching of MergeToRefService call in mergeability check\nDelay praefect database_*_no_proxy removals\nUpdate cacerts to 2021-09-30\nSymlink OpenSSL default cert file to Debian cert path\nImportant notes on upgrading\nThis version does not include any new migrations, and for multi-node deployments, should not require any downtime.\nPlease be aware that by default the Omnibus packages will stop, run migrations,\nand start again, no matter how “big” or “small” the upgrade is. This behavior\ncan be changed by adding a /etc/gitlab/skip-auto-reconfigure file,\nwhich is only used for updates.\nUpdating\nTo update, check out our update page.\nGitLab subscriptions\nAccess to GitLab Premium and Ultimate features is granted by a paid subscription.\nAlternatively, sign up for GitLab.com\nto use GitLab's own infrastructure.",
          "link": "https://about.gitlab.com/releases/2021/10/12/gitlab-14-3-3-released/",
          "publishedOn": "2021-10-12T00:00:00.000Z",
          "wordCount": 1056,
          "title": "GitLab Patch Release: 14.3.3"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/10/11/threat-modeling-kubernetes-agent/",
          "author": null,
          "description": "Threat modeling is more common in people’s everyday lives than they might think.  Each of us performs some level of threat modeling every time we’re in a situation where we’re evaluating threats. An everyday example I really like: crossing the street. Before we cross the street we look both ways, we evaluate the speed of each oncoming vehicle and verify the driver has seen us. Finally, if the lights are green, we cross the street. This is threat modeling!\nIf you’re interested in learning more about what threat modeling is and how we’re developing our threat model here at GitLab, you can read about “How we’re creating a threat model framework that works for GitLab“ by my teammate Mark Loveless.\nThreat modeling IRL\nIn this blog post I’ll talk about how we put our threat modeling process into…",
          "link": "https://about.gitlab.com/blog/2021/10/11/threat-modeling-kubernetes-agent/",
          "publishedOn": "2021-10-11T00:00:00.000Z",
          "wordCount": 3579,
          "title": "Threat modeling the Kubernetes Agent: from MVC to continuous improvement"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/10/11/notice-for-gitkraken-users-with-gitlab/",
          "author": null,
          "description": "We’re sharing details on a vulnerability found with the Axosoft GitKraken software. Axosoft found a defect in the key gen package used by GitKraken versions 7.6.0 to 8.0.0 that could generate weak or duplicate SSH keys. This could enable an attacker to gain unauthorized access to an account or repositories on GitLab.com or a self-managed instance.\nBased on our investigations to date, there is no indication that GitLab.com or any projects on GitLab.com that use the GitKraken tool have been impacted by this vulnerability.\nWho is affected?\nThis vulnerability affects GitKraken users who created SSH keys using GitKraken releases from May 12, 2021 (7.6.0) to the week of September 27, 2021 (8.0.0).\nGitKraken 8.0.1, released on September 28, 2021, fixes the bug.\nAction we have taken\nWe have emailed users with affected keys earlier today, October 11, 2021.\nFor GitLab.com customers, we have already blocked known weak keys.\nIf affected, action you need to take\nIf you used a version of GitKraken prior to 8.0.1 to generate SSH keys, we highly recommend that you take the following actions:\nSelf-managed customers:\nRevoke the SSH keys immediately. For additional instructions, see: https://docs.gitlab.com/ee/user/admin_area/credentials_inventory.html#delete-a-users-ssh-key\nUpdate GitKraken to the latest version: https://support.gitkraken.com/release-notes/current/\nGenerate new SSH keys: https://support.gitkraken.com/integrations/gitlab/#generating-an-ssh-key-for-gitlab\nGitLab.com customers:\nUpdate GitKraken to the latest version: https://support.gitkraken.com/release-notes/current/\nGenerate new SSH keys: https://support.gitkraken.com/integrations/gitlab/#generating-an-ssh-key-for-gitlab\nMore information can be found in Axosoft’s disclosure: https://www.gitkraken.com/blog/weak-ssh-key-fix \nand in CVE-2021-41117.\nFor questions or concerns regarding GitKraken or its use with GitLab, please contact Axosoft (support@gitkraken.com). For questions concerning your GitLab account, please contact our Support department.",
          "link": "https://about.gitlab.com/blog/2021/10/11/notice-for-gitkraken-users-with-gitlab/",
          "publishedOn": "2021-10-11T00:00:00.000Z",
          "wordCount": 1293,
          "title": "Notice for GitKraken users with GitLab"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/10/11/how-ten-steps-over-ten-years-led-to-the-devops-platform/",
          "author": null,
          "description": "The first commit to GitLab (!!) was 10 years ago. Today, it’s an entirely different world: DevOps is increasingly mainstream and there's a DevOps platform revolution.\nWe didn’t have a crystal ball back then, but we did try to create a product, a culture and a company that reflected what we thought mattered most. Here’s a look back at 10 key decisions we made that still have impact:\nWork in parallel: When we started, it was clear the waterfall method of software development - where one stage waited on another stage and nothing happened independently - slowed everything. We decided right from the beginning that a “work in parallel” philosophy would be fundamental to our culture and our behaviors. Also, such a philosophy naturally supported everything else we did, including bringing CI and CD…",
          "link": "https://about.gitlab.com/blog/2021/10/11/how-ten-steps-over-ten-years-led-to-the-devops-platform/",
          "publishedOn": "2021-10-11T00:00:00.000Z",
          "wordCount": 2197,
          "title": "How ten steps over ten years led to the DevOps Platform"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/10/08/updates-to-de-identifying-service-usage-data/",
          "author": null,
          "description": "GitLab has been working on a process to intentionally limit our own ability to identify individual users from Service Usage Data in order to protect user privacy even better. Earlier this year, we solicited input on plans to de-identify GitLab’s Service Usage Data. We are now ready to move forward with a new system to de-identify SaaS usage data before it enters GitLab’s internal analytics environment.\nWhat isn’t changing?\nThe service usage data policy for SaaS and Self-Managed remains unchanged.\nWhat is changing?\nWith user privacy in mind, we are building a pseudonymization process to run against our SaaS service usage data.\nWe have determined that we do not need fully identifiable information anymore for our analytics environment, and as such we are pursuing this approach that will result in better privacy for GitLab users.\nWe’ll create a one-way hash or transform directly identifiable data. This means that the data will be hashed at the collection layer before it is sent to our analytics environment.\nYou can read more details about our pseudonymization solution here. Once our pseudonymization solution is in place, we will update data we collect to ensure it follows the  solution. You can read more about what data we collect and its de-identification state here.\nTimeline and implementation\nWe’re planning to roll out these changes in October 2021. Keep an eye on our Product Intelligence roadmap to monitor our progress. Once complete, we’ll update this blog post with the final status.\nMore information\nPlease find more information about our privacy policy. Further details on how service usage data is used for product improvement can be found on our Product Direction page. Also see  GitLab’s analytics environment and SaaS Data Collection Catalog.\nPlease share your questions on the community forum.",
          "link": "https://about.gitlab.com/blog/2021/10/08/updates-to-de-identifying-service-usage-data/",
          "publishedOn": "2021-10-08T00:00:00.000Z",
          "wordCount": 1337,
          "title": "Updates to de-identifying Service Usage Data"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/10/07/a-look-at-devops-salaries/",
          "author": null,
          "description": "This is the first in an occasional series of blog posts looking at DevOps salaries and careers.\nDespite the COVID-19 pandemic and the subsequent economic crisis that has disrupted lives and business across industries and around the world, demand for DevOps professionals remains strong and salaries continue to increase.\nThe IT industry, in general, fared better than many during the economic uncertainty of 2020 and 2021. With a strong IT infrastructure already in place and IT professionals accustomed to working remotely, increased demand and short supply for IT workers meant IT salaries held steady or rose in turbulent times, reported Randstad, a multinational human resources consulting firm. \nAnd DevOps professionals did even better than most in IT.\nDevOps salaries are on the rise\nDevOps, s…",
          "link": "https://about.gitlab.com/blog/2021/10/07/a-look-at-devops-salaries/",
          "publishedOn": "2021-10-07T00:00:00.000Z",
          "wordCount": 1888,
          "title": "DevOps salaries in 2021: where do you rank?"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/10/06/gitlab-cnh-for-50k-users/",
          "author": null,
          "description": "If you have spent time reviewing GitLab Reference Architectures, you may have noticed the flexibility of the GitLab codebase; it's possible to support a broad range of implementations from a single box for under one hundred users to horizontal hyper-scaled setups for 50,000 or more.\nScaling to massive sizes requires the services within GitLab to be broken out into dedicated compute and storage layers so they can each expand cost effectively based on high loading and an organization's specific usage patterns.\nThose who provision large scale systems on the cloud generally turn to Infrastructure as Code (IaC) to ensure consistency and to allow easy setup of pre-production environments for the target system. Until recently, GitLab implementers have had to craft this code from scratch.\nNow, tha…",
          "link": "https://about.gitlab.com/blog/2021/10/06/gitlab-cnh-for-50k-users/",
          "publishedOn": "2021-10-06T00:00:00.000Z",
          "wordCount": 2386,
          "title": "How to provision Ready-To-Run GitLab for 50,000 users with the AWS Quick Start"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/10/05/gitpod-desktop-app-personal-activities/",
          "author": null,
          "description": "Keeping track of everything that is happening in your GitLab projects and groups can be quite overwhelming. Often times you care about not only one project, but multiple ones. Even worse, these projects might even belong to different groups, making everything more complex.\nAs an example, product designers at GitLab might work on all of these different projects over the course of just one week:\ngitlab-org/gitlab (our product)\ngitlab-com/www-gitlab-com (our handbook)\ngitlab-org/gitlab-design (space for discussions)\ngitlab-org/gitlab-services/design.gitlab.com (our design system)\ngitlab-org/ux-research (research studies)\nUser-centric vs. project-centric navigation\nOne of our product design managers (@jackib) created a visualization that shows the current project-centric navigation model that …",
          "link": "https://about.gitlab.com/blog/2021/10/05/gitpod-desktop-app-personal-activities/",
          "publishedOn": "2021-10-05T00:00:00.000Z",
          "wordCount": 2103,
          "title": "Why we built GitDock, our desktop app to navigate your GitLab activities"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/10/04/how-to-status-checks/",
          "author": null,
          "description": "The external status checks for merge requests capability was recently introduced in GitLab and it allows the integration of third-party systems and applications with GitLab merge requests.\nWhat are \"external status checks for merge requests\"?\nExternal status checks are API calls to systems or applications that sit outside GitLab. These API calls are invoked during merge requests, which display a widget with the status of each external check. With external status checks, you can integrate GitLab with third-party systems, e.g. Salesforce, PeopleSoft, Microsoft Dynamics, etc., that require manual approval for merge requests. This makes it easy to see that merge requests have met external requirements before being merged, adding an extra method to ensure compliance and audit requirements are m…",
          "link": "https://about.gitlab.com/blog/2021/10/04/how-to-status-checks/",
          "publishedOn": "2021-10-04T00:00:00.000Z",
          "wordCount": 3399,
          "title": "How to use external status checks for merge requests"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/10/01/join-us-for-hacktoberfest-2021/",
          "author": null,
          "description": "It’s October 2021, and we have quite a few treats in store. In addition to celebrating the 10th anniversary of the GitLab open source project, GitLab Inc. will be participating in Hacktoberfest, an event dedicated to increasing contributions to open source projects that's now in its eighth year. This has been widely requested by the open source community for years, so we’re thrilled to see GitLab support rolled out!\nThanks to DigitalOcean, the organization behind Hacktoberfest, people can now contribute to open source projects that are hosted on GitLab.com.\nIt’s easy, sign up on the Hacktoberfest website using your GitLab account and explore the available projects to contribute.\nProject maintainers who want their projects to participate in Hacktoberfest should follow the steps described on…",
          "link": "https://about.gitlab.com/blog/2021/10/01/join-us-for-hacktoberfest-2021/",
          "publishedOn": "2021-10-01T00:00:00.000Z",
          "wordCount": 1497,
          "title": "Join us for Hacktoberfest 2021!"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/10/01/gitlab-14-3-2-released/",
          "author": null,
          "description": "Today we are releasing version 14.3.2 GitLab Community Edition and Enterprise Edition.\nThis version resolves a number of regressions and bugs in\nthe 14.3 release and\nprior versions.\nGitLab Community Edition and Enterprise Edition\nAdd OR REPLACE when creating function\nTop 7 Highlight items for 14.3\nUpdate GitLab Shell to v13.21.1\nRemove feature flag check for candece finder\nRemove unexpected FK prior to swapping columns\nAllow ee images to be skipped on CE pipelines\nBump kas to v14.3.3\nImportant notes on upgrading\nThese versions do not include any new migrations, and for multi-node deployments, should not require any downtime.\nPlease be aware that by default the Omnibus packages will stop, run migrations,\nand start again, no matter how “big” or “small” the upgrade is. This behavior\ncan be changed by adding a /etc/gitlab/skip-auto-reconfigure file,\nwhich is only used for updates.\nUpdating\nTo update, check out our update page.\nGitLab subscriptions\nAccess to GitLab Premium and Ultimate features is granted by a paid subscription.\nAlternatively, sign up for GitLab.com\nto use GitLab's own infrastructure.",
          "link": "https://about.gitlab.com/releases/2021/10/01/gitlab-14-3-2-released/",
          "publishedOn": "2021-10-01T00:00:00.000Z",
          "wordCount": 1062,
          "title": "GitLab Patch Release: 14.3.2"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/09/30/personal-profile/",
          "author": null,
          "description": "The GitLab user profile contains information about you and your GitLab activity. You can select what information to display.\nWe recently added a few new settings to make you user profile more personal:\nUser pronouns\nUser pronunciation guides\nUser local times\nUser pronouns\nYou can now set pronouns to your GitLab user profile. The pronoun appears:\nNext to your user name in your public profile.\nOn the snapshot view of your user profile when someone hovers over your name on an issue or\nmerge request.\nBesides being more inclusive, GitLab wants to help you use the correct pronouns when replying\nto comments to respect people's identity. You can:\nDecide whether or not to add pronouns to your profile.\nSelf-identify and enter whatever pronouns you want, without having to select from a pre-defined list.\nRead more about adding\npronouns to your profile.\nUser pronunciation\nYou can now add a pronunciation guide to your user profile. In distributed teams where team\nmembers are from different countries, it can be difficult to determine how to say someone's\nname correctly. You can now help people know how to pronounce your name.\nRead more about adding a\npronunciation guide to your profile.\nUser local time\nYour local time is now displayed on your profile. Previously, you could set your time\nzone but your local time was not visible throughout GitLab. This improvement helps\nothers know when you are likely to be available.\nRead more about adding a\nlocal time zone to your profile.\nAdditional settings for user profiles\nIn the upcoming milestone, we are planning to add your timezone to the snapshot view of the GitLab user profile.\nIn GitLab, everyone can contribute. If you would like to see even\nmore additions to user profiles, you can:\nOpen an issue with your request.\nUpvote an existing issue. Read more in our Users direction page.\nEven code it yourself!\nCover image by Ben Sweet on Unsplash",
          "link": "https://about.gitlab.com/blog/2021/09/30/personal-profile/",
          "publishedOn": "2021-09-30T00:00:00.000Z",
          "wordCount": 1403,
          "title": "GitLab user profiles have just become more personal"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/09/30/want-faster-releases-your-answer-lies-in-automated-software-testing/",
          "author": null,
          "description": "For three years in a row, our Global DevSecOps Survey found testing was the number one reason (by large margins) for release delays. A lack of automated software testing, combined with too many manual tests conducted too late in the process, was a story told time after time, and it certainly was one without any kind of happy ending.\nDespite the undeniable progress DevOps has brought to software development, integrating automated software testing into the lifecycle has remained an elusive goal for many teams. Here’s a look at why testing is such a difficult step to get right, and how an integrated DevOps Platform can bring much-needed structure to the process.\nThe state of automated software testing\nAccording to our 2021 Survey, it’s safe to say respondents are frustrated with software test…",
          "link": "https://about.gitlab.com/blog/2021/09/30/want-faster-releases-your-answer-lies-in-automated-software-testing/",
          "publishedOn": "2021-09-30T00:00:00.000Z",
          "wordCount": 2127,
          "title": "Want faster releases? Your answer lies in automated software testing"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/09/30/security-release-gitlab-14-3-1-released/",
          "author": null,
          "description": "Today we are releasing versions 14.3.1, 14.2.5, and 14.1.7 for GitLab Community Edition (CE) and Enterprise Edition (EE).\nThese versions contain important security fixes, and we strongly recommend that all GitLab installations be upgraded to one of these versions immediately.\nGitLab releases patches for vulnerabilities in dedicated security releases. There are two types of security releases: a monthly, scheduled security release, released a week after the feature release (which deploys on the 22nd of each month), and ad-hoc security releases for critical vulnerabilities. For more information, you can visit our security FAQ. You can see all of our regular and security release blog posts here. In addition, the issues detailing each vulnerability are made public on our issue tracker 30 days a…",
          "link": "https://about.gitlab.com/releases/2021/09/30/security-release-gitlab-14-3-1-released/",
          "publishedOn": "2021-09-30T00:00:00.000Z",
          "wordCount": 3572,
          "title": "GitLab Security Release: 14.3.1, 14.2.5, and 14.1.7"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/09/29/why-we-spent-the-last-month-eliminating-postgresql-subtransactions/",
          "author": null,
          "description": "Since last June, we noticed the database on GitLab.com would\nmysteriously stall for minutes, which would lead to users seeing 500\nerrors during this time. Through a painstaking investigation over\nseveral weeks, we finally uncovered the cause of this: initiating a\nsubtransaction via the SAVEPOINT SQL query while\na long transaction is in progress can wreak havoc on database\nreplicas. Thus launched a race, which we recently completed, to\neliminate all SAVEPOINT queries from our code. Here's what happened,\nhow we discovered the problem, and what we did to fix it.\nThe symptoms begin\nOn June 24th, we noticed that our CI/CD runners service reported a high\nerror rate:\n\nA quick investigation revealed that database queries used to retrieve\nCI/CD builds data were timing out and that the unprocessed b…",
          "link": "https://about.gitlab.com/blog/2021/09/29/why-we-spent-the-last-month-eliminating-postgresql-subtransactions/",
          "publishedOn": "2021-09-29T00:00:00.000Z",
          "wordCount": 7264,
          "title": "Why we spent the last month eliminating PostgreSQL subtransactions"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/09/28/generic-semantic-version-processing/",
          "author": null,
          "description": "The semantic versioning (SemVer) specification can be\nconsidered the de-facto standard for tracking software states during its\nevolution. Unfortunately, in reality many languages/ecosystems practice \"SemVer versioning\" and have not adopted\nthe standard as-is; instead we can find many different semantic versioning\nflavors that are not necessarily compatible with the original SemVer spec. SemVer Versioning has\nled to the creation of a variety of different semantic versioning schemes.\nGitLab provides a Dependency Scanning (DS)\nfeature that automatically detects vulnerabilities in the dependencies of a\nsoftware project for a variety of different languages. DS relies on the\nGitLab security advisory database\nthat is updated on a daily basis providing information about\nvulnerable packages that is…",
          "link": "https://about.gitlab.com/blog/2021/09/28/generic-semantic-version-processing/",
          "publishedOn": "2021-09-28T00:00:00.000Z",
          "wordCount": 7740,
          "title": "SemVer versioning: how we handled it with linear interval arithmetic"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/09/27/how-to-configure-sidekiq-for-gitlab-at-scale/",
          "author": null,
          "description": "Configuring Sidekiq in your own deployment of GitLab is a little complicated, but entirely possible. In this blog post, we share how to set up Sidekiq for GitLab in special cases and at a large scale by sharing some exmaples that may be useful to you.\nWhy consider special configuration?\nWhile Sidekiq (both in general, and in a GitLab deployment) will usually just work most of the time, there can be some sharp edges and limits. Raw scale is a clear and obvious driver for needing to take action, and although it may be fine to simply scale out multiple Sidekiq nodes each listening to all the queues, at some point:\nThe uniqueness of workload distribution and job characteristics may require dedicated workers, either sharded on job attributes (as for GitLab.com), or specific workers (based on yo…",
          "link": "https://about.gitlab.com/blog/2021/09/27/how-to-configure-sidekiq-for-gitlab-at-scale/",
          "publishedOn": "2021-09-27T00:00:00.000Z",
          "wordCount": 6307,
          "title": "How to configure Sidekiq for specialized or large-scale GitLab instances"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/09/27/gitlab-14-0-11-released/",
          "author": null,
          "description": "Today we are releasing version 14.0.11 GitLab Community Edition and Enterprise Edition.\nThis version resolves a number of regressions and bugs in\nthe 14.0 release and\nprior versions.\nGitLab Community Edition and Enterprise Edition\nDerive virtual storage's filesystem id from its name\nFix Elastic::MigrationWorker current_migration\nImportant notes on upgrading\nThese versions do not include any new migrations, and for multi-node deployments, should not require any downtime.\nPlease be aware that by default the Omnibus packages will stop, run migrations,\nand start again, no matter how “big” or “small” the upgrade is. This behavior\ncan be changed by adding a /etc/gitlab/skip-auto-reconfigure file,\nwhich is only used for updates.\nUpdating\nTo update, check out our update page.\nGitLab subscriptions\nAccess to GitLab Premium and Ultimate features is granted by a paid subscription.\nAlternatively, sign up for GitLab.com\nto use GitLab's own infrastructure.",
          "link": "https://about.gitlab.com/releases/2021/09/27/gitlab-14-0-11-released/",
          "publishedOn": "2021-09-27T00:00:00.000Z",
          "wordCount": 1034,
          "title": "GitLab Patch Release: 14.0.11"
        }
      ]
    },
    {
      "title": "Phoronix",
      "feedUrl": "https://www.phoronix.com/rss.php",
      "siteUrl": "https://www.phoronix.com/",
      "articles": [
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=X.Org-Server-21.1-RC2",
          "author": null,
          "description": "X.Org Server 21.1 continues running slightly behind schedule but out today is a second release candidate of that upcoming xorg-server version -- the first in more than three years...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=X.Org-Server-21.1-RC2",
          "publishedOn": "2021-10-14T19:36:24.000Z",
          "wordCount": 849,
          "title": "X.Org Server 21.1 RC2 Brings Fix For Mixed VRR/Non-VRR Multi-Monitor Setups"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Devuan-4.0-Released",
          "author": null,
          "description": "Devuan 4.0 \"Chimaera\" is officially out today as the latest stable release of this Linux distribution known for being a close rebuild of Debian but without a dependence on systemd...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Devuan-4.0-Released",
          "publishedOn": "2021-10-14T17:46:47.000Z",
          "wordCount": 687,
          "title": "Devuan 4.0 Released As Debian 11 Without Systemd"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Ubuntu-21.10",
          "author": null,
          "description": "Ubuntu 21.10 \"Impish Indri\" is now officially available as the latest six-month update to Ubuntu Linux and also serving as the last release prior to the next long-term support cycle, Ubuntu 22.04 LTS...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Ubuntu-21.10",
          "publishedOn": "2021-10-14T14:53:57.000Z",
          "wordCount": 953,
          "title": "Ubuntu 21.10 Released With GNOME 40 Desktop, Many Underlying Improvements"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=NVIDIA-495.29.05-Linux",
          "author": null,
          "description": "NVIDIA 495.29.05 is out today as the first public Linux driver in the 495 series...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=NVIDIA-495.29.05-Linux",
          "publishedOn": "2021-10-14T13:36:20.000Z",
          "wordCount": 755,
          "title": "NVIDIA 495 Linux Beta Driver Released With GBM Support"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=OpenBSD-7.0-Released",
          "author": null,
          "description": "Not only is Ubuntu 21.10 releasing today but over on the BSD side of the table is the debut this morning of OpenBSD 7.0...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=OpenBSD-7.0-Released",
          "publishedOn": "2021-10-14T13:00:03.000Z",
          "wordCount": 857,
          "title": "OpenBSD 7.0 Released With RISC-V 64-bit Port, Better Apple Silicon Support"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30607",
          "author": null,
          "description": "While we recently looked at autumn 2021 Linux distributions on Intel Tiger Lake for seeing how these various latest distributions are competing on client platforms, in today's article is a look at how well the latest Linux distributions perform when using the latest-generation Intel Xeon Scalable 3rd Gen \"Ice Lake\" server hardware with two Xeon Platinum 8380 processors. AlmaLinux, Arch Linux, CentOS Stream, Clear Linux, Debian, Fedora, openSUSE, and Ubuntu were battling it out on this Intel reference server.",
          "link": "https://www.phoronix.com/vr.php?view=30607",
          "publishedOn": "2021-10-14T12:30:00.000Z",
          "wordCount": 884,
          "title": "9-Way H2'2021 Linux OS Performance Comparison On Intel Xeon Scalable Ice Lake"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=KDE-Plasma-5.23-Released",
          "author": null,
          "description": "KDE Plasma 5.23 is officially out this morning as the newest major open-source desktop release and is known now as the KDE 25th Anniversary Edition...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=KDE-Plasma-5.23-Released",
          "publishedOn": "2021-10-14T10:22:20.000Z",
          "wordCount": 873,
          "title": "KDE Plasma 5.23 Released In Marking 25 Years Of KDE"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Qt-Creator-6-Beta",
          "author": null,
          "description": "With Qt 6.2 LTS having shipped at the end of September, The Qt Company is now turning their attention to Qt Creator 6 as the next version of their Qt/C++ focused integrated development environment...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Qt-Creator-6-Beta",
          "publishedOn": "2021-10-14T10:15:19.000Z",
          "wordCount": 826,
          "title": "Qt Creator 6 Beta Released With Updated C++ Code Model, Binaries Built Against Qt 6.2"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=openSUSE-Leap-Regular-Rebuilds",
          "author": null,
          "description": "Moving forward regular respins of the openSUSE Leap images are expected to include the latest package updates in making for a more pleasant out-of-the-box experience...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=openSUSE-Leap-Regular-Rebuilds",
          "publishedOn": "2021-10-14T09:27:24.000Z",
          "wordCount": 755,
          "title": "openSUSE Leap ISOs To See Regular Respins For Integrating Latest Updates"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=XeHPG-Tess-Geometry-Distribute",
          "author": null,
          "description": "A new feature for upcoming XeHPG graphics that was merged into Intel's open-source Linux OpenGL and Vulkan drivers today was for tessellation distribution and geometry distribution across the graphics hardware...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=XeHPG-Tess-Geometry-Distribute",
          "publishedOn": "2021-10-14T04:00:00.000Z",
          "wordCount": 873,
          "title": "Intel Linux Driver Lands Tessellation/Geometry Distribution Feature For Xe-HPG"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-21.3-rc1-Released",
          "author": null,
          "description": "Mesa 21.3 feature development is now over with the code having been branched and the first release candidate issued...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-21.3-rc1-Released",
          "publishedOn": "2021-10-13T20:26:46.000Z",
          "wordCount": 886,
          "title": "Mesa 21.3-rc1 Released With Improved Zink, Radeon Ray-Tracing, RADV NGG Culling"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-Retpoline-Rewrite-Rewrite",
          "author": null,
          "description": "The Linux kernel has supported Retpolines for over three years now as part of their Spectre Variant Two mitigations while now a patch series is proposed that rewrites Retpoline's rewrite logic...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-Retpoline-Rewrite-Rewrite",
          "publishedOn": "2021-10-13T18:11:04.000Z",
          "wordCount": 842,
          "title": "Linux Patches Rewrite The Retpoline Rewrite Code - Possible Performance Benefit"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=DragonFlyBSD-6.0.1-Released",
          "author": null,
          "description": "Released back in May was the shiny DragonFlyBSD 6.0 release while today a point release for it has been issued...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=DragonFlyBSD-6.0.1-Released",
          "publishedOn": "2021-10-13T17:20:35.000Z",
          "wordCount": 716,
          "title": "DragonFlyBSD 6.0.1 Released With AMD Zen 3 Temperature Monitoring, Fixes"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30600",
          "author": null,
          "description": "Today AMD is officially launching the Radeon RX 6600 graphics card as a trimmed down model from the Radeon RX 6600 XT that launched back in August. This new (non-XT) model has a suggested price of $329 USD and here is a look at how well this RDNA2 graphics card is performing under Linux.",
          "link": "https://www.phoronix.com/vr.php?view=30600",
          "publishedOn": "2021-10-13T13:00:00.000Z",
          "wordCount": 980,
          "title": "AMD Radeon RX 6600 Linux Performance"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Vulkan-1.2.196-H265-Encode",
          "author": null,
          "description": "Arriving back in April were the initial Vulkan Video extensions that included support for video decode of H.264 and H.265 while the initial video encode support was limited to H.264. Out today with Vulkan 1.2.196 is the new extension allowing for H.265 encoding with this new industry-standard video API...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Vulkan-1.2.196-H265-Encode",
          "publishedOn": "2021-10-13T11:27:41.000Z",
          "wordCount": 873,
          "title": "Vulkan 1.2.196 Introduces H.265 Encode Extension"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-21.3-Fixes-Wayland-Trans",
          "author": null,
          "description": "Landing in time for the imminent Mesa 21.3 feature freeze / code branching is support for the EGL_EXT_present_opaque extension on Wayland. While this EGL extension may not sound too exciting, for some OpenGL games on Wayland it will address some transparency issues...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-21.3-Fixes-Wayland-Trans",
          "publishedOn": "2021-10-13T11:17:28.000Z",
          "wordCount": 825,
          "title": "Mesa 21.3 Fixes Issue Of Some Games Having Transparency Issues Under Wayland"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=LoongArch-Linux-v5",
          "author": null,
          "description": "Chinese vendor Loongson continues working on their Linux kernel patches enabling the LoongArch processor ISA as their fork from MIPS. While early on when copying existing MIPS open-source code they were quick to call their new ISA \"not MIPS\", in these later patch series they continue to refer to their ISA as \"a bit like MIPS or RISC-V.\"..",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=LoongArch-Linux-v5",
          "publishedOn": "2021-10-13T09:06:01.000Z",
          "wordCount": 857,
          "title": "Loongson Volleys Latest Patches For LoongArch Linux Support"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=DAMON-Physical-Monitoring",
          "author": null,
          "description": "One of many exciting additions with the forthcoming Linux 5.15 kernel is DAMON landed as a data access monitoring framework. DAMON opens up new possibilities around proactive reclamation of system memory and other interesting features. Currently though it's limited to monitoring the virtual address space of the kernel but a new set of patches out allow for physical address space monitoring as well...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=DAMON-Physical-Monitoring",
          "publishedOn": "2021-10-13T07:45:20.000Z",
          "wordCount": 710,
          "title": "DAMON Extended To Offer Physical Memory Address Space Monitoring"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Red-Hat-New-2021-GPU-Developer",
          "author": null,
          "description": "Red Hat already employs numerous open-source graphics driver developers from DRM subsystem maintainer David Airlie to numerous others on his team working on areas from Mesa OpenCL support to Heterogeneous Memory Management to other user and kernel-space improvements for open-source Linux graphics. Red Hat has now put out a call to hire yet another experienced Linux GPU driver developer...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Red-Hat-New-2021-GPU-Developer",
          "publishedOn": "2021-10-12T22:36:21.000Z",
          "wordCount": 867,
          "title": "Red Hat Is Hiring Another Linux Developer To Work On GPU Hardware Enablement"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-Numpy-AVX-512-Landed",
          "author": null,
          "description": "Intel has contributed AVX-512 optimizations to upstream Numpy. For those using Numpy as this leading Python library for numerical computing, newer Intel CPUs with AVX-512 capabilities can enjoy major speed-ups in the range of 14~32x faster...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-Numpy-AVX-512-Landed",
          "publishedOn": "2021-10-12T18:50:12.000Z",
          "wordCount": 792,
          "title": "Intel Contributes AVX-512 Optimizations To Numpy, Yields Massive Speedups"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=GNOME-Platform-Design-EO2021",
          "author": null,
          "description": "GNOME developer Allan Day has provided an update on behalf of the GNOME design time around some of their recent platform design improvements and some of the changes they are talking about in the near future...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=GNOME-Platform-Design-EO2021",
          "publishedOn": "2021-10-12T18:35:07.000Z",
          "wordCount": 742,
          "title": "GNOME's Platform Design Continues Evolving From Dark Mode To Toasts"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=7.4M-IOPS-Linux-Per-Core",
          "author": null,
          "description": "Linux block subsystem maintainer and lead IO_uring developer Jens Axboe had a goal of hitting 7M IOPS per-core performance this week. On Monday he managed to already hit 7.2M IOPS and today hit 7.4M IOPS with his latest work-in-progress kernel patches...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=7.4M-IOPS-Linux-Per-Core",
          "publishedOn": "2021-10-12T18:14:43.000Z",
          "wordCount": 777,
          "title": "7.4M IOPS Achieved Per-Core With Newest Linux Patches"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=POCL-1.8-Released",
          "author": null,
          "description": "PoCL is the open-source project implementing OpenCL for CPU-based execution as well as multi-device support by getting its Portable Computing Language implementation working atop NVIDIA GPUs via CUDA, AMD GPUs via HSA, and other back-ends by way of LLVM. PoCL 1.8 is out today as the newest feature release...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=POCL-1.8-Released",
          "publishedOn": "2021-10-12T17:31:31.000Z",
          "wordCount": 774,
          "title": "Portable Computing Language 1.8 Released For OpenCL On CPUs, Other Accelerators"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30597",
          "author": null,
          "description": "Earlier this month were benchmarks looking at how Intel Tiger Lake performance has improved from Ubuntu 21.04 to Ubuntu 21.10, but how does Canonical's latest Linux offering compete with other autumn 2021 distributions? In this article from the Dell XPS Core i7-1165G7 Tiger Lake notebook are benchmarks of Ubuntu 21.10 going up against Arch Linux, Clear Linux, Fedora Workstation 35, and openSUSE Tumbleweed for getting an idea how the performance compares with this latest-generation Intel EVO notebook.",
          "link": "https://www.phoronix.com/vr.php?view=30597",
          "publishedOn": "2021-10-12T12:26:39.000Z",
          "wordCount": 976,
          "title": "Intel Tiger Lake Performance Across Five Autumn 2021 Linux Distributions"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Glibc-2.35-Removes-Intel-MPX",
          "author": null,
          "description": "Intel Memory Protection Extensions (MPX) never really took off and the Linux support has been deprecated for a while with the code elsewhere in the stack already having been removed while with the upcoming Glibc 2.35 release that GNU C Library is also flushing away its support...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Glibc-2.35-Removes-Intel-MPX",
          "publishedOn": "2021-10-12T10:02:14.000Z",
          "wordCount": 756,
          "title": "Glibc 2.35 Removes The Long-Deprecated Intel MPX Support"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-FPU-Cleaning-For-AMX",
          "author": null,
          "description": "It's been one year now that Intel has been posting Linux kernel patches to enable AMX support for upcoming Sapphire Rapids processors. Over the past year their Linux kernel patches for enabling Advanced Matrix Extensions has gone through 11 rounds of review but that journey isn't over yet...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-FPU-Cleaning-For-AMX",
          "publishedOn": "2021-10-12T09:45:22.000Z",
          "wordCount": 935,
          "title": "Linux x86 FPU Code Getting Reworked In Preparation For Intel AMX"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Lutris-0.5.9-Released",
          "author": null,
          "description": "Lutris 0.5.9 is now available for this open-source Linux game manager program that has now added initial support for the Epic Games Store among other new options and enhancements in this new version...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Lutris-0.5.9-Released",
          "publishedOn": "2021-10-11T19:43:29.000Z",
          "wordCount": 848,
          "title": "Lutris 0.5.9 Released With Support For The Epic Games Store, New Options"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Microsoft-Windows-11-WSL-Store",
          "author": null,
          "description": "Those running Microsoft's recently released Windows 11 will now be able to find the Windows Subsystem for Linux (WSL) available from within the Microsoft Store for easier setting up of this Linux-based environment...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Microsoft-Windows-11-WSL-Store",
          "publishedOn": "2021-10-11T19:21:26.000Z",
          "wordCount": 834,
          "title": "Microsoft Publishes WSL Preview Inside the Windows 11 Store"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-DG2-64k-Pages-Flat-CCS",
          "author": null,
          "description": "While Linux 5.15 brings very early bits around DG2/Alchemist graphics card support, further work is needed to bring it into usable shape for end-users. The latest new patch series to be posted came out today with more driver changes needed around local device memory handling for DG2...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-DG2-64k-Pages-Flat-CCS",
          "publishedOn": "2021-10-11T18:53:47.000Z",
          "wordCount": 901,
          "title": "Intel Posts Latest DG2/Alchemist Linux Patches In Requiring 64K Page Size Handling"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Walmart-L3AF-eBPF",
          "author": null,
          "description": "Retail shopping giant Walmart has found use out eBPF programs and today announced the open-source L3AF to help in the effort...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Walmart-L3AF-eBPF",
          "publishedOn": "2021-10-11T18:07:50.000Z",
          "wordCount": 838,
          "title": "Walmart Pushes Open-Source L3AF To Help Out eBPF Ecosystem"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30591",
          "author": null,
          "description": "With Ubuntu 21.10 due for release this week I've been running various Ubuntu Linux performance comparisons across a variety of hardware and overall this new release is looking to be in great shape. One of the tests I recently carried out for curiosity is seeing how the AMD Zen 2 performance has evolved now over the past two years on Linux going from Ubuntu 19.10 to Ubuntu 21.10.",
          "link": "https://www.phoronix.com/vr.php?view=30591",
          "publishedOn": "2021-10-11T13:12:58.000Z",
          "wordCount": 885,
          "title": "Ubuntu 19.10 To 21.10: AMD Zen 2 + Radeon Performance On Linux Over Two Years"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-Approaching-7M-IOPS",
          "author": null,
          "description": "Linux block subsystem maintainer and IO_uring lead developer Jens Axboe continues making staggering optimizations to the kernel code to squeeze out the maximum performance potential out of his shiny new system...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-Approaching-7M-IOPS",
          "publishedOn": "2021-10-11T13:04:33.000Z",
          "wordCount": 821,
          "title": "More Optimizations Has Linux Approaching 7M IOPS Per Core"
        }
      ]
    }
  ],
  "cliVersion": "1.11.2"
}