{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": [
        {
          "id": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.0",
          "author": null,
          "description": "Added: support an experimental template for YouTube feed 📺 Demo | Source\n\nAggregate content from any YouTube channel rss url https://www.youtube.com/feeds/videos.xml?channel_id=<replace_with_channel_id>\nVideos are embedded via iframe and loading accelerated by youtube-lite-embed\nAds are reduced thanks to YouTube's policy for embedded videos 🙃\nWorks on mobile devices with butter smooth horizontal scroll.\nCaveat: the template works only with YouTube content. You cannot mix textual RSS feed or other video sources such as Vimeo.\nChanged: Default HTML template meta tag adjusted to match convention\nChanged: sources in template data is now ordered by last update timestamp (as opposed to alphabetical)\nThank you @PiyushLosalka",
          "link": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.0",
          "publishedOn": "2021-06-23T05:57:59.000Z",
          "wordCount": 370,
          "title": "v1.11.0"
        }
      ]
    },
    {
      "title": "GitLab",
      "feedUrl": "https://about.gitlab.com/atom.xml",
      "siteUrl": "https://about.gitlab.com/blog/",
      "articles": [
        {
          "id": "https://about.gitlab.com/releases/2021/07/07/critical-security-release-gitlab-14-0-4-released/",
          "author": null,
          "description": "Today we are releasing versions 14.0.4, 13.12.8, and 13.11.7 for GitLab Community Edition (CE) and Enterprise Edition (EE).\nThese versions contain important security fixes, and we strongly recommend that all GitLab installations be upgraded to one of these versions immediately.\nGitLab releases patches for vulnerabilities in dedicated security releases. There are two types of security releases: a monthly, scheduled security release, released a week after the feature release (which deploys on the 22nd of each month), and ad-hoc security releases for critical vulnerabilities. For more information, you can visit our security FAQ. You can see all of our regular and security release blog posts here. In addition, the issues detailing each vulnerability are made public on our issue tracker 30 days…",
          "link": "https://about.gitlab.com/releases/2021/07/07/critical-security-release-gitlab-14-0-4-released/",
          "publishedOn": "2021-07-07T00:00:00.000Z",
          "wordCount": 1252,
          "title": "GitLab Critical Security Release: 14.0.4, 13.12.8, and 13.11.7"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/07/06/gitlab-14-0-3-released/",
          "author": null,
          "description": "Today we are releasing version 14.0.3 for GitLab Community Edition and Enterprise Edition.\nThis version resolves a number of regressions and bugs in\nthis month's 14.0 release and\nprior versions.\nGitLab Community Edition and Enterprise Edition\nReintroduce recursive_approach_for_all_projects default-enabled\nFix pages deployment storage migration\nFix frequent items timestamps not updated\nFix bug where Milestone page led to console error\nFix broken Time Tracking Reports on Issuable sidebar\nGeo - Fix state value in the lfs_object_registry table\nRevert a 14.0 change in the deployments API\nDevOps Adoption - ensure displayNamespaceId is included\nGeo - Move migration to a pre-deployment migration\nRun batched migrations on self-managed instances\nFix deploy keys not working with LFS auth check\nRepository: Fix repo replication with transactions\nRepository: Fix excessive voting in CreateRepositoryFromBundle\nImportant notes on upgrading\nThis version does not include any new migrations, and for multi-node deployments, should not require any downtime.\nPlease be aware that by default the Omnibus packages will stop, run migrations,\nand start again, no matter how “big” or “small” the upgrade is. This behavior\ncan be changed by adding a /etc/gitlab/skip-auto-reconfigure file,\nwhich is only used for updates.\nUpdating\nTo update, check out our update page.\nGitLab subscriptions\nAccess to GitLab Premium and Ultimate features is granted by a paid subscription.\nAlternatively, sign up for GitLab.com\nto use GitLab's own infrastructure.",
          "link": "https://about.gitlab.com/releases/2021/07/06/gitlab-14-0-3-released/",
          "publishedOn": "2021-07-06T00:00:00.000Z",
          "wordCount": 1103,
          "title": "GitLab Patch Release: 14.0.3"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/07/05/gitlab-13-12-7-released/",
          "author": null,
          "description": "Today we are releasing version 13.12.7 for GitLab Community Edition and Enterprise Edition.\nThis version resolves a number of regressions and bugs in\nthis month's 13.12 release and\nprior versions.\nGitLab Community Edition and Enterprise Edition\nAvailable in GitLab Free, Premium, and Ultimate:\nFix pages deployment storage migration\nReintroduce recursive_approach_for_all_projects default-enabled\nExempt unicorn['svlogd_prefix'] from deprecation check\nGitaly: fixes to issues with strong consistency/transactional voting\nGeo - Fix state value in the lfs_object_registry table\nImportant notes on upgrading\nThis version does not include any new migrations, and for multi-node deployments, should not require any downtime.\nPlease be aware that by default the Omnibus packages will stop, run migrations,\nand start again, no matter how “big” or “small” the upgrade is. This behavior\ncan be changed by adding a /etc/gitlab/skip-auto-reconfigure file,\nwhich is only used for updates.\nUpdating\nTo update, check out our update page.\nGitLab subscriptions\nAccess to GitLab Premium and Ultimate features is granted by a paid subscription.\nAlternatively, sign up for GitLab.com\nto use GitLab's own infrastructure.",
          "link": "https://about.gitlab.com/releases/2021/07/05/gitlab-13-12-7-released/",
          "publishedOn": "2021-07-05T00:00:00.000Z",
          "wordCount": 1049,
          "title": "GitLab Patch Release: 13.12.7"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/07/01/security-release-gitlab-14-0-2-released/",
          "author": null,
          "description": "Today we are releasing versions 14.0.2, 13.12.6, and 13.11.6 for GitLab Community Edition (CE) and Enterprise Edition (EE).\nThese versions contain important security fixes, and we strongly recommend that all GitLab installations be upgraded to one of these versions immediately.\nGitLab releases patches for vulnerabilities in dedicated security releases. There are two types of security releases: a monthly, scheduled security release, released a week after the feature release (which deploys on the 22nd of each month), and ad-hoc security releases for critical vulnerabilities. For more information, you can visit our security FAQ. You can see all of our regular and security release blog posts here. In addition, the issues detailing each vulnerability are made public on our issue tracker 30 days…",
          "link": "https://about.gitlab.com/releases/2021/07/01/security-release-gitlab-14-0-2-released/",
          "publishedOn": "2021-07-01T00:00:00.000Z",
          "wordCount": 2676,
          "title": "GitLab Security Release: 14.0.2, 13.12.6, and 13.11.6"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/06/30/how-to-stand-up-gitlab-in-awsmp/",
          "author": null,
          "description": "In this guide we will learn how to spin up GitLab in the AWS Marketplace:\nPre requisites for this lab are having an account in AWS and an accessible and working VPC.\nWe will learn the following steps:\nStand up a self-managed instance of GitLab.\nInstall Runner and Docker Engine.\nStep-by-step Instructions\nStep 1 - Stand up GitLab instance in AWS\nOpen GitLab Ultimate in AWS Marketplace.\nClick on Continue to Subscribe\n\nSign in with your IAM user.\n\nClick on Continue to Configuration.\n\nLeave the default value for Delivery Method, select the latest version in Software Version, select your Region, click Continue to Launch.\n\nIn Launch this software page, scroll down.\n\nUnder Security Group Settings click Create New Based On Seller Settings .\n\nName your security group, add a description, and save it.…",
          "link": "https://about.gitlab.com/blog/2021/06/30/how-to-stand-up-gitlab-in-awsmp/",
          "publishedOn": "2021-06-30T00:00:00.000Z",
          "wordCount": 2147,
          "title": "How to stand-up a GitLab instance in AWS Marketplace"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/06/28/package-key-extension/",
          "author": null,
          "description": "GitLab uses a GPG key to sign all Omnibus packages created within the CI pipelines to insure that the packages have not been tampered with. This key is seperate from the repository metadata signing key used by package managers and the GPG signing key for the GitLab Runner. The Omnibus package signing key is set to expire on July 1, 2021 and will be extended to expire on July 1, 2022 instead.\nWhy are we extending the deadline?\nThe Omnibus package signing key's expiration is extended each year to comply with GitLab security policies and to limit the exposure should the key become compromised. The key's expiration is extended instead of rotating to a new key to be less disruptive for users that do verify package integrity checks prior to installing the package.\nWhat do I need to do?\nThe only action that needs to be taken is to update your copy of the package signing key if you validate the signatures on the Omnibus packages that GitLab distributes.\nThe package signing key is not the key that signs the repository metadata used by the OS package managers like apt or yum. Unless you are specifically verifying the package signatures or have configured your package manager to verify the package signatures, there is no action needed on your part to continue installing Omnibus packages.\nMore information concerning verification of the package signatures\nis available in the Omnibus documentation. If you just need to refresh a copy\nof the public key, then you can find it on any of the GPG keyservers by\nsearching for support@gitlab.com or using the key ID of\nDBEF 8977 4DDB 9EB3 7D9F  C3A0 3CFC F9BA F27E AB47. Alternatively you could\ndownload it directly from packages.gitlab.com using the URL:\nhttps://packages.gitlab.com/gitlab/nightly-builds/gpgkey/gitlab-nightly-builds-3D645A26AB9FBD22.pub.gpg\n\n\nWhat do I do if I still have problems?\nPlease open an issue in the omnibus-gitlab issue tracker.",
          "link": "https://about.gitlab.com/blog/2021/06/28/package-key-extension/",
          "publishedOn": "2021-06-28T00:00:00.000Z",
          "wordCount": 1381,
          "title": "GitLab extends Omnibus package signing key expiration by one year"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/06/24/gitlab-14-0-1-released/",
          "author": null,
          "description": "Today we are releasing version 14.0.1 for GitLab Community Edition and Enterprise Edition.\nThis version resolves a number of regressions and bugs in\nthis month's 14.0 release and\nprior versions.\nGitLab Community Edition and Enterprise Edition\nAvailable in GitLab Free, Premium, and Ultimate:\nUpdate Geo UI screenshots in docs page\nUpdate admin docs with new admin area access info\nAdd Helm-2to3.gitlab-ci.yml to Auto DevOps\nUpdate docs for new Members page location on GitLab navigation\nDevOps Adoption - ensure displayNamespaceId is included\nRemove add button from Devops Adoption\nGeo: Add Terraform Module to datatypes doc\nCreate 14.0 What's New entry\nToggle codequality diff annotations flag\nBump kas to v14.0.1\nExempt unicorn 'svlogd_prefix' from deprecation check\nImportant notes on upgrading\nThis version does not include any new migrations, and for multi-node deployments, should not require any downtime.\nPlease be aware that by default the Omnibus packages will stop, run migrations,\nand start again, no matter how “big” or “small” the upgrade is. This behavior\ncan be changed by adding a /etc/gitlab/skip-auto-reconfigure file,\nwhich is only used for updates.\nUpdating\nTo update, check out our update page.\nGitLab subscriptions\nAccess to GitLab Premium and Ultimate features is granted by a paid subscription.\nAlternatively, sign up for GitLab.com\nto use GitLab's own infrastructure.",
          "link": "https://about.gitlab.com/releases/2021/06/24/gitlab-14-0-1-released/",
          "publishedOn": "2021-06-24T00:00:00.000Z",
          "wordCount": 1076,
          "title": "GitLab Patch Release: 14.0.1"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/06/23/how-to-use-agent-based-gitops/",
          "author": null,
          "description": "In the previous post, titled 3 ways to approach GitOps, we discussed the many benefits and options that GitLab supports for fulfilling the GitOps requirements of customers, whose IT environments are composed of heterogeneous technologies and infrastructures. This post is a 3-part series, in which we delve deeper into these options. In this first part, we cover the pull-based or agent-based approach.\nAbout a pull-based or agent-based approach\nIn this approach, an agent is installed in your infrastructure components to pull changes whenever there is a drift from the desired configuration, which resides in GitLab. Although the infrastructure components could be anything from a physical server or router to a VM or a database, we will focus on a Kubernetes cluster in this section.\nIn the follow…",
          "link": "https://about.gitlab.com/blog/2021/06/23/how-to-use-agent-based-gitops/",
          "publishedOn": "2021-06-23T00:00:00.000Z",
          "wordCount": 3499,
          "title": "How to use a pull-based (agent-based) approach for GitOps"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/06/22/gitlab-14-modern-devops/",
          "author": null,
          "description": "The DevOps era began with a big idea – dissolve silos to deliver better software, faster. In the transition from classic software paradigms, DIY DevOps toolchains were built with parts that were never designed to work together. That DIY DevOps era left many trapped in new silos, without visibility, and mired in maintenance. Business outcomes suffered as the potential of DevOps was never fully realized.\nThe next iteration of DevOps\nThere is a better way to build software. GitLab 14 delivers modern DevOps with a complete DevOps platform, for a streamlined experience that unleashes the power of DevOps. Over the past year, GitLab has shipped advanced DevOps platform capabilities that enable any team to build and deliver software with velocity, trust, and visibility – no matter their size, indu…",
          "link": "https://about.gitlab.com/blog/2021/06/22/gitlab-14-modern-devops/",
          "publishedOn": "2021-06-22T00:00:00.000Z",
          "wordCount": 2644,
          "title": "GitLab 14 signals shift to modern DevOps: A DevOps platform with velocity, trust, and visibility"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/06/22/gitlab-14-0-released/",
          "author": null,
          "description": "When we think of everything released in the year since GitLab 13.0, we could not be more proud of our community and our team. This month, we celebrate our release of GitLab 14.0 by first taking a step back.\nTogether, we’ve made so much progress over the last year that we want to talk about everything it took to get to GitLab 14.\nWe use semantic versioning so a point release, like 14.0, represents everything new in this month. GitLab 14 is the culmination of the past year. Even more than that, GitLab 14 represents the future of GitLab, and the future of DevOps.\nWith GitLab 14, teams of all sizes are moving from maintaining DIY DevOps toolchains to adopting modern DevOps. GitLab 14 is a complete DevOps platform with security embedded in its DNA, visibility and insights enabled by its single …",
          "link": "https://about.gitlab.com/releases/2021/06/22/gitlab-14-0-released/",
          "publishedOn": "2021-06-22T00:00:00.000Z",
          "wordCount": 12159,
          "title": "GitLab 14.0 released with a celebration of GitLab 14"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/06/21/usage-ping-configuration-bug-for-self-managed-instances/",
          "author": null,
          "description": "We recently discovered a Usage Ping  configuration bug for self-managed instances and have since published a patch release to fix the bug. The issue affects the ability to disable Usage Ping for self-managed GitLab via text configuration files, resulting in the collection and transmission of Usage Ping events from the instance. This bug affects any instance running GitLab version 9.3 to version 13.12.3, and was patched in 13.12.4.\nWhat does this mean for existing users?\nThis issue does not affect customers who have disabled Usage Ping via the user interface or any users of our SaaS product.\nYou can check your instance configuration settings to see if this issue may have affected you. We’ve published more detailed instructions here.\nWhat should I do?\nSince we do not collect any configuration data from your instance, we have no way to detect if you unintentionally shared data with GitLab. Out of an abundance of caution, we ask that you fill out this form if you suspect that Usage Ping data was shared after taking steps to opt-out in your GitLab configuration file. We will purge data from our systems and follow up with confirmation.\nPlease share your questions and feedback with us on the community forum.",
          "link": "https://about.gitlab.com/blog/2021/06/21/usage-ping-configuration-bug-for-self-managed-instances/",
          "publishedOn": "2021-06-21T00:00:00.000Z",
          "wordCount": 1140,
          "title": "Usage Ping configuration bug for self-managed instances"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/06/21/how-to-become-more-productive-with-gitlab-ci/",
          "author": null,
          "description": "CI/CD pipelines are the preeminent solution to mitigate potential risks while integrating code changes into the repository. CI/CD pipelines help isolate the impact of potential errors, making it easier to fix them. Top that with a tool that provides effective visibility into the running tasks and there you have a recipe for success.\nSince the primary purpose of CI/CD pipelines is to speed up the development process and provide value to the end user faster, there's always room to make the process more efficient. This blog post unpacks some strategies that can help you get the most out of your pipeline definition in GitLab CI.\nHow Directed Acyclic Graphs (DAG) enable concurrent pipelines\n\nBy using the \"Needs\" keyword you can define dependencies for jobs that need to be used from previous sta…",
          "link": "https://about.gitlab.com/blog/2021/06/21/how-to-become-more-productive-with-gitlab-ci/",
          "publishedOn": "2021-06-21T00:00:00.000Z",
          "wordCount": 2614,
          "title": "How to become more productive with Gitlab CI"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/06/21/gitlab-13-12-5-released/",
          "author": null,
          "description": "Today we are releasing version 13.12.5 for GitLab Community Edition and Enterprise Edition.\nThis version resolves a number of regressions and bugs in\nthis month's 13.12 release and\nprior versions.\nGitLab Community Edition and Enterprise Edition\nAvailable in GitLab Free, Premium, and Ultimate:\nOnly update required instance ci template when the parameter is present\nFix Password expired error on git fetch via SSH for LDAP user\nAdvanced Search Settings page does not load if the ES url is unreachable\nImportant notes on upgrading\nThis version does not include any new migrations, and for multi-node deployments, should not require any downtime.\nPlease be aware that by default the Omnibus packages will stop, run migrations,\nand start again, no matter how “big” or “small” the upgrade is. This behavior\ncan be changed by adding a /etc/gitlab/skip-auto-reconfigure file,\nwhich is only used for updates.\nUpdating\nTo update, check out our update page.\nGitLab subscriptions\nAccess to GitLab Premium and Ultimate features is granted by a paid subscription.\nAlternatively, sign up for GitLab.com\nto use GitLab's own infrastructure.",
          "link": "https://about.gitlab.com/releases/2021/06/21/gitlab-13-12-5-released/",
          "publishedOn": "2021-06-21T00:00:00.000Z",
          "wordCount": 1038,
          "title": "GitLab Patch Release: 13.12.5"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/06/16/gpg-key-used-to-sign-gitlab-runner-packages-rotated/",
          "author": null,
          "description": "GitLab uses a GPG key to sign official GitLab Runner packages. We recently became aware of an instance where this key and other tokens used to distribute official GitLab Runner packages and binaries were not secured according to GitLab’s security policies.\nWe have not found any evidence of unauthorized modification of the packages or access to the services storing them. Our team has audited and investigated integrity hashes, bucket logs and versioning, and pipeline history and concluded that the unauthorized modification of any packages is exceedingly unlikely.\nOut of an abundance of caution, the GPG key used for release signing and verification has been rotated along with all other tokens that were improperly secured.\nIf you use GitLab.com shared runners, this does not impact you.\nAs of J…",
          "link": "https://about.gitlab.com/blog/2021/06/16/gpg-key-used-to-sign-gitlab-runner-packages-rotated/",
          "publishedOn": "2021-06-16T00:00:00.000Z",
          "wordCount": 1567,
          "title": "The GPG key used to sign GitLab Runner packages has been rotated"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/06/15/why-we-are-building-the-gitlab-environment-toolkit-to-help-deploy-gitlab-at-scale/",
          "author": null,
          "description": "Last year I wrote about how the Quality Engineering Enablement team was building up the performance testing of GitLab with the GitLab Performance Tool (GPT). Last year, the biggest challenge with performance testing wasn't so much the testing but rather setting up the right large scale GitLab environments to test against.\nLike any server application, deploying at scale is challenging. That's why we built another toolkit that automates the deployment of GitLab at scale: The GitLab Environment Toolkit (GET).\n\nGitLab Environment Toolkit logo\nInternally called the \"Performance Environment Builder\" (PEB), GET grew alongside GPT as we continued to expand our performance testing efforts. Over time we built a toolkit that was quite capable in its own right of deploying GitLab at scale, which is wh…",
          "link": "https://about.gitlab.com/blog/2021/06/15/why-we-are-building-the-gitlab-environment-toolkit-to-help-deploy-gitlab-at-scale/",
          "publishedOn": "2021-06-15T00:00:00.000Z",
          "wordCount": 4866,
          "title": "The next step in performance testing? The GitLab Environment Toolkit"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/06/14/gitlab-13-12-4-released/",
          "author": null,
          "description": "Today we are releasing version 13.12.4 for GitLab Community Edition and Enterprise Edition.\nThis version resolves a number of regressions and bugs in\nthis month's 13.12 release and\nprior versions.\nGitLab Community Edition and Enterprise Edition\nAvailable in GitLab Free, Premium, and Ultimate:\nFix double render in project's git URL redirect\nFix MR diff compare with previous version\nAdd alias method usage_ping_enabled?\nDo not show Praefect deprecation if Praefect is disabled\nUpdate Mattermost to 5.34.4\nImportant notes on upgrading\nThis version does not include any new migrations, and for multi-node deployments, should not require any downtime.\nPlease be aware that by default the Omnibus packages will stop, run migrations,\nand start again, no matter how “big” or “small” the upgrade is. This behavior\ncan be changed by adding a /etc/gitlab/skip-auto-reconfigure file,\nwhich is only used for updates.\nUpdating\nTo update, check out our update page.\nGitLab subscriptions\nAccess to GitLab Premium and Ultimate features is granted by a paid subscription.\nAlternatively, sign up for GitLab.com\nto use GitLab's own infrastructure.",
          "link": "https://about.gitlab.com/releases/2021/06/14/gitlab-13-12-4-released/",
          "publishedOn": "2021-06-14T00:00:00.000Z",
          "wordCount": 1029,
          "title": "GitLab Patch Release: 13.12.4"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/06/11/how-i-use-gitlab-to-help-my-hack/",
          "author": null,
          "description": "GitLab is best known as a complete open source DevOps platform, delivered as a single application, but it also offers powerful project management and collaboration capabilities. In fact, every GitLab team uses GitLab to develop, track and collaborate on projects, processes, and programs.\nBut, what about… other uses? Say … hacking, for instance. 🤷‍♀️\nCan GitLab help a hacker fine-tune their craft? Through our Ask a Hacker AMA series we discovered that there are some bug bounty hunters who use GitLab to streamline their research process. And, like so many cool and awesome things, we learned on Twitter about another contributor using GitLab for bug bounty hunting.  So, we followed up to learn more.\nMeet our hackers\nAlex Chapman\n\nAlex has been hacking for 14 years professionally, but his inte…",
          "link": "https://about.gitlab.com/blog/2021/06/11/how-i-use-gitlab-to-help-my-hack/",
          "publishedOn": "2021-06-11T00:00:00.000Z",
          "wordCount": 4798,
          "title": "How do bug bounty hunters use GitLab to help their hack?"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/06/10/how-to-get-gitops-right-with-iac-security/",
          "author": null,
          "description": "In today's competitive digital era, it is imperative for organizations to undergo a digital transformation to effectively compete. For many, achieving a digital transformation means transitioning toward a DevOps model.\nDevOps has been around for many years, and the development side of the house has benefitted from the core practices of DevOps. However, the infrastructure side of the house has been lagging behind, particularly when it comes to speed. With infrastructure as code (IaC) and GitOps, infrastructure teams have been able to apply the same disciplines and quality gates that are used to manage application code to the infrastructure - to deliver products faster, with more predictability and at scale.\nSecurity slowing down delivery\nWhile the GitOps concept promises faster and more fre…",
          "link": "https://about.gitlab.com/blog/2021/06/10/how-to-get-gitops-right-with-iac-security/",
          "publishedOn": "2021-06-10T00:00:00.000Z",
          "wordCount": 2135,
          "title": "How to get GitOps right with infrastructure as code security"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/06/09/how-to-protect-your-source-code-with-gitlab-and-jscrambler/",
          "author": null,
          "description": "Development teams are building, testing, and shipping code faster than ever before. Today, we know that security has a role to play at the early stages of the DevOps workflow, but these security controls are mostly centered around finding and fixing bugs and vulnerabilities during development.\nIn this tutorial, we will explore the importance of protecting client-side application code at runtime and guide you through implementing it in your GitLab instance using the integration with Jscrambler.\nThe importance of runtime code protection\nWith web and mobile applications dealing with increasingly sensitive data, addressing the application's attack surface requires considering additional threats that are not directly linked to vulnerabilities.\nThis concern has been widely covered in NIST, ISO 2…",
          "link": "https://about.gitlab.com/blog/2021/06/09/how-to-protect-your-source-code-with-gitlab-and-jscrambler/",
          "publishedOn": "2021-06-09T00:00:00.000Z",
          "wordCount": 2931,
          "title": "How to protect your source code with GitLab and Jscrambler"
        }
      ]
    },
    {
      "title": "Phoronix",
      "feedUrl": "https://www.phoronix.com/rss.php",
      "siteUrl": "https://www.phoronix.com/",
      "articles": [
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=F2FS-Linux-5.14",
          "author": null,
          "description": "The Flash-Friendly File-System (F2FS) continues seeing new features and improvements to this file-system that is increasingly used by Android devices and other flash/SSD-focused systems...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=F2FS-Linux-5.14",
          "publishedOn": "2021-07-07T22:43:05.000Z",
          "wordCount": 816,
          "title": "F2FS Brings Compression Improvements To Linux 5.14"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-IGC-Mesa-2022",
          "author": null,
          "description": "Last summer I wrote about Intel prototyping their Mesa drivers to use the IGC compiler, which followed Intel transitioning their Windows driver to use this compiler that was originally written for their open-source Linux compute stack. While they were making good progress last year on having their Mesa drivers use the IGC compiler, the project has been pushed back...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-IGC-Mesa-2022",
          "publishedOn": "2021-07-07T20:00:00.000Z",
          "wordCount": 997,
          "title": "Intel's Mesa Drivers Using The IGC Compiler Delayed"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=systemd-249",
          "author": null,
          "description": "Systemd 249 has been promoted to stable as the newest version of this Linux init system...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=systemd-249",
          "publishedOn": "2021-07-07T18:12:59.000Z",
          "wordCount": 885,
          "title": "Systemd 249 Released With New Option For Simple Whole-File-System A/B Updates"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=KSMBD-In-Kernel-SMB3-v5",
          "author": null,
          "description": "For quite a while now Samsung engineers have been developing an in-kernel SMB3 file sharing server for the Linux kernel. In recent months that code has been maturing more and now the latest version of this KSMBD kernel code has been published...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=KSMBD-In-Kernel-SMB3-v5",
          "publishedOn": "2021-07-07T15:30:00.000Z",
          "wordCount": 936,
          "title": "Samsung Posts Newest \"KSMBD\" Linux Patches For In-Kernel SMB3 Server"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.14-Input",
          "author": null,
          "description": "The Linux 5.14 input subsystem updates have landed with new hardware support and other changes...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.14-Input",
          "publishedOn": "2021-07-07T14:45:37.000Z",
          "wordCount": 822,
          "title": "Linux 5.14 Now Handles The Microsoft Xbox One Select/Share Button On Its Controllers"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-21.2-Alternate-GBM",
          "author": null,
          "description": "Earlier this year was the proposed NVIDIA code from NVIDIA for allowing Mesa's GBM to support alternative back-ends. This support is notable given that most Wayland compositors are catering to using Mesa's Generic Buffer Manager (GBM) rather than EGLStreams or other options for buffer management. That support code has now been merged into Mesa 21.2...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-21.2-Alternate-GBM",
          "publishedOn": "2021-07-07T13:01:01.000Z",
          "wordCount": 811,
          "title": "Mesa 21.2 Lands NVIDIA's Code For Handling Alternate GBM Backends"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-RAR-Remote-Action-Request",
          "author": null,
          "description": "Adding to the lengthy list of features for Intel's next-gen Xeon \"Sapphire Rapids\" processors next year is an admittedly experimental feature called RAR, or Remote Action Requests...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-RAR-Remote-Action-Request",
          "publishedOn": "2021-07-07T10:18:25.000Z",
          "wordCount": 793,
          "title": "Intel Sapphire Rapids To Have Experimental \"RAR\" Feature"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.14-x86-FPU-Cleanup",
          "author": null,
          "description": "The Linux 5.14 kernel so far is running smoothly in my early tests across a variety of systems but coming in this morning is a pull request having the potential to cause some fall-out on x86/x86_64 systems but hopefully will not...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.14-x86-FPU-Cleanup",
          "publishedOn": "2021-07-07T09:50:33.000Z",
          "wordCount": 880,
          "title": "Linux 5.14 Bringing A Major Cleanup To The x86 FPU Code"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Arm-ASF",
          "author": null,
          "description": "Arm engineers are working on the Active Stats Framework (ASF) that is a new kernel framework for Linux effectively combining the current roles of CPUFreq and CPUIdle...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Arm-ASF",
          "publishedOn": "2021-07-07T09:35:42.000Z",
          "wordCount": 789,
          "title": "Arm Proposes ASF As Their Framework Building Off Linux's CPUFreq + CPUIdle"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.14-Staging",
          "author": null,
          "description": "The staging changes were submitted on Monday for the ongoing Linux 5.14 for this area of the kernel where immature / yet-to-be-cleaned-up code lives to prove itself before being ready to graduate to the proper mainline kernel area...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.14-Staging",
          "publishedOn": "2021-07-06T22:41:23.000Z",
          "wordCount": 835,
          "title": "Linux 5.14 Staging Drops A Set Of Drivers For The Second Time, Intel QEP Added"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30314",
          "author": null,
          "description": "The Linux Foundation and their partners are today announcing their intent to form the Open 3D Foundation to help foster 3D game and simulation technologies. As a key part of this new Open 3D Foundation, Amazon's Lumberyard game engine that started off based on CryEngine is going to see an Apache 2.0 licensed copy made available as the Open 3D Engine (O3DE).",
          "link": "https://www.phoronix.com/vr.php?view=30314",
          "publishedOn": "2021-07-06T16:00:00.000Z",
          "wordCount": 1076,
          "title": "Linux Foundation Launches Open 3D Foundation, Amazon Lumberyard Spun As Open 3D Engine"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30312",
          "author": null,
          "description": "For those making use of Microsoft's Windows Subsystem for Linux (WSL2) for enjoying Linux application support within Windows, here are some early benchmarks of the inaugural Windows Insider Preview build of Windows 11 with WSL2 against Windows 10 and then Ubuntu Linux bare metal on the same hardware.",
          "link": "https://www.phoronix.com/vr.php?view=30312",
          "publishedOn": "2021-07-06T15:00:00.000Z",
          "wordCount": 795,
          "title": "An Early Look At Windows 11 WSL2 Performance Against Ubuntu Linux"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Qt-6.2-Beta",
          "author": null,
          "description": "The Qt Company today issued the first of several expected betas for the upcoming Qt 6.2 toolkit release that will also be their first Qt 6 long-term support version...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Qt-6.2-Beta",
          "publishedOn": "2021-07-06T13:02:15.000Z",
          "wordCount": 840,
          "title": "Qt 6.2 Beta Released As The First Qt6 LTS Release Moves Closer"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=OpenRISC-LiteX-Drivers-Coming",
          "author": null,
          "description": "While RISC-V secures much of the spotlight these days when it comes to open-source processor instruction set architectures, OpenRISC is still moving along and soon should see more OpenRISC LiteX drivers upstreamed...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=OpenRISC-LiteX-Drivers-Coming",
          "publishedOn": "2021-07-06T10:19:17.000Z",
          "wordCount": 778,
          "title": "More OpenRISC LiteX Drivers Expected To Be Upstreamed In Linux"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=CentOS-Stream-9-Builds",
          "author": null,
          "description": "More build artifacts of CentOS Stream 9 are being published now while more OS images are still on the way. CentOS Stream 9 is open for contributions as RHEL's future upstream...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=CentOS-Stream-9-Builds",
          "publishedOn": "2021-07-06T10:00:01.000Z",
          "wordCount": 723,
          "title": "CentOS Stream 9 Builds Flowing, Opened Up For Contributors"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.14-Continues-USB4-TB",
          "author": null,
          "description": "Greg Kroah-Hartman on mailed in the USB/Thunderbolt changes targeting the Linux 5.14 merge window...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.14-Continues-USB4-TB",
          "publishedOn": "2021-07-06T07:00:00.000Z",
          "wordCount": 713,
          "title": "Linux 5.14 Continues Work On USB4 Support Bring-Up"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=DragonFlyBSD-COVID",
          "author": null,
          "description": "There is now covid going around the BSDs... DragonFlyBSD has ported it from NetBSD...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=DragonFlyBSD-COVID",
          "publishedOn": "2021-07-06T04:00:00.000Z",
          "wordCount": 721,
          "title": "Following NetBSD, DragonFlyBSD Now Has \"COVID\""
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=X.Org-Server-21.1-21.0.99.1",
          "author": null,
          "description": "There hasn't been a major X.Org Server release since v1.20 three years ago and not much interest in seeing a new release with more Linux distributions switching to Wayland-based desktops and XWayland recently seeing its own standalone releases. But now there is an X.Org Server 21.1 development release as the first step towards a possible new stable release in the future...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=X.Org-Server-21.1-21.0.99.1",
          "publishedOn": "2021-07-05T22:33:42.000Z",
          "wordCount": 895,
          "title": "X.Org Server 21.1 Development Snapshot Released"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Ubuntu-21.10-Zstd-Debs",
          "author": null,
          "description": "It's coming three years later than originally planned but with Ubuntu 21.10 this autumn the Debian packages will now be compressed via Zstd for offering speedier decompression speeds...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Ubuntu-21.10-Zstd-Debs",
          "publishedOn": "2021-07-05T21:27:38.000Z",
          "wordCount": 698,
          "title": "Ubuntu 21.10 Compressing Debian Packages With Zstd"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=ASUS-Laptop-GPU-Panel-Patches",
          "author": null,
          "description": "A set of Linux kernel patches to the asus-wmi driver are pending that improve the support for newer ASUS gaming laptops...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=ASUS-Laptop-GPU-Panel-Patches",
          "publishedOn": "2021-07-05T18:05:40.000Z",
          "wordCount": 818,
          "title": "ASUS Laptop dGPU Toggling, eGPU Handling, Panel Overdrive Patches For Linux"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Vulkan-1.2.184",
          "author": null,
          "description": "Last year I wrote about NVIDIA working on Vulkan support for RDMA memory. That work around RDMA (Remote Direct Memory Access) memory usage in the Vulkan context is now available with today's Vulkan 1.2.184 specification update...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Vulkan-1.2.184",
          "publishedOn": "2021-07-05T13:31:04.000Z",
          "wordCount": 719,
          "title": "Vulkan 1.2.184 Includes NVIDIA Extension For RDMA Usage"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.14-Tracers",
          "author": null,
          "description": "The tracing subsystem within the Linux kernel is seeing some exciting improvements with Linux 5.14 to help with low-latency analysis and also measuring operating system noise...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.14-Tracers",
          "publishedOn": "2021-07-05T11:33:26.000Z",
          "wordCount": 828,
          "title": "New Linux 5.14 Tracer To Help With Measuring Operating System Noise"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.14-Perf-Tooling",
          "author": null,
          "description": "The Linux kernel's tooling around the perf subsystem is the latest area seeing a lot of work for Intel's upcoming Alder Lake processors with a mix of high performance and low power processor cores...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.14-Perf-Tooling",
          "publishedOn": "2021-07-05T10:25:49.000Z",
          "wordCount": 781,
          "title": "Linux 5.14's Perf Tooling Makes Preparations For Intel Alder Lake"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.14-exFAT",
          "author": null,
          "description": "Merged back in Linux 5.4 in late 2019 was the exFAT file-system driver that has proven to be quite mature at this stage with the work led by Samsung under the blessing of Microsoft. There hasn't been much in the way of exFAT file-system driver changes in recent kernel releases given its maturity. Even with Linux 5.14 there are just two exFAT patches but end up being notable at least for some users due to fixing file-system compatibility with some digital cameras...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.14-exFAT",
          "publishedOn": "2021-07-05T10:16:54.000Z",
          "wordCount": 913,
          "title": "Linux 5.14 Works Around Compatibility With Some Digital Camera exFAT File-Systems"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Rust-Independence-Linux-Kernel",
          "author": null,
          "description": "This US Independence Day a revised set of patches were mailed out providing support for Rust as a secondary programming language within the Linux kernel for areas where increased security and memory safety are of utmost importance. The set of 17 patches plumb the Linux kernel with initial support, an example driver, and in total amount to more than 33k lines of new code in its early form...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Rust-Independence-Linux-Kernel",
          "publishedOn": "2021-07-04T21:33:48.000Z",
          "wordCount": 994,
          "title": "Latest Patches Sent Out For Adding Rust Support To The Linux Kernel"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.14-Sound",
          "author": null,
          "description": "Linux 5.14 is ready to begin supporting some new sound hardware while some recently proposed USB audio latency improvements were rejected for now...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.14-Sound",
          "publishedOn": "2021-07-04T20:16:33.000Z",
          "wordCount": 805,
          "title": "Linux 5.14 Picks Up Support For New Sound Hardware, Including Alder Lake M"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-Linux-H1-2021",
          "author": null,
          "description": "As part of our various Q2'21 and H1'21 Linux/open-source recaps, here is a look back at the most popular AMD Linux/open-source news so far this calendar year...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-Linux-H1-2021",
          "publishedOn": "2021-07-04T16:36:25.000Z",
          "wordCount": 2578,
          "title": "AMD's Linux Strides In H1'21 From FreeSync HDMI To PyTorch ROCm"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.14-int340x-Alder-Lake",
          "author": null,
          "description": "The thermal subsystem updates for the Linux 5.14 kernel include more work on Intel's int340x driver that is used by newer Intel laptops for dealing with their varying thermal control capabilities and exposing more thermal information to user-space for use by Intel's Thermal Daemon (Thermald). This cycle the work includes a new driver that will be used by next-gen Alder Lake SoCs...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.14-int340x-Alder-Lake",
          "publishedOn": "2021-07-04T13:14:41.000Z",
          "wordCount": 831,
          "title": "Linux Gets New Thermal Driver Code Ahead of Alder Lake"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=GNU-Binutils-2.37",
          "author": null,
          "description": "GNU Binutils 2.37 has been branched and the release process initiated for these low-level GNU components likely seeing their v2.37 release later this month...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=GNU-Binutils-2.37",
          "publishedOn": "2021-07-04T11:16:45.000Z",
          "wordCount": 778,
          "title": "GNU Binutils 2.37 Is On The Way - Finally Drops ARM Symbian OS Support"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.14-Core-Sched-Off",
          "author": null,
          "description": "Among the many new features that were sent in so far this week for the Linux 5.14 merge window was the long in-development work on \"core scheduling\" to reduce the Hyper Threading information leakage risks from side channels and help ensuring deterministic performance on such HT/SMT systems by controlling the resources that can run on a sibling thread. As a follow-up to that article from a few days ago, core scheduling will now be disabled by default...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.14-Core-Sched-Off",
          "publishedOn": "2021-07-04T10:29:25.000Z",
          "wordCount": 959,
          "title": "Linux Will Keep Core Scheduling Disabled By Default"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.14-DLM",
          "author": null,
          "description": "The Linux kernel's Distributed Lock Manager as a general purpose DLM for kernel and user-space applications with cluster computing systems is seeing a useful reliability improvement with Linux 5.14...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.14-DLM",
          "publishedOn": "2021-07-04T10:04:11.000Z",
          "wordCount": 685,
          "title": "Linux 5.14 Improving Its Distributed Lock Manager To Allow Message Re-Transmission"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.14-EXT4",
          "author": null,
          "description": "The EXT4 file-system updates have been sent in for the ongoing Linux 5.14 merge window...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.14-EXT4",
          "publishedOn": "2021-07-04T00:32:10.000Z",
          "wordCount": 865,
          "title": "Linux 5.14 With EXT4 Adds Interface To Help Prevent Information Leakage From The Journal"
        }
      ]
    }
  ],
  "cliVersion": "1.11.0"
}