{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": []
    },
    {
      "title": "GitLab",
      "feedUrl": "https://about.gitlab.com/atom.xml",
      "siteUrl": "https://about.gitlab.com/blog/",
      "articles": [
        {
          "id": "https://about.gitlab.com/blog/2021/08/13/understand-highly-technical-spaces/",
          "author": null,
          "description": "As a designer, you're lucky when you get to design an application you're familiar with, such as a supermarket app or a travel website – something we might have already used or even use every day. Most of the time, we are tasked with designing an application or technology that's unfamiliar or highly technical. Sometimes, we may not know what the application we're designing is used for, like creating an interface for an MRI machine controlled by a doctor, or a dashboard used by a professional musician – knowing what all the buttons do is already an achievement.\nOne of the trickiest questions for designers is understanding exactly how much you need to know how to use an application to design the best system for the user. This conundrum is typical for designers that work in a highly technical,…",
          "link": "https://about.gitlab.com/blog/2021/08/13/understand-highly-technical-spaces/",
          "publishedOn": "2021-08-13T00:00:00.000Z",
          "wordCount": 2581,
          "title": "How I use analogy to design for highly technical spaces"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/08/13/five-great-phabricator-features-inspired-gitlab/",
          "author": null,
          "description": "Innovation often happens because competition sparks new ideas. We unpack how Phabricator inspired GitLab to add new features.\nTurning back time a bit, what exactly is Phabricator? Built on the concept of web-based applications, Phabricator enables developers to collaborate with code reviews, repository browser, change monitoring, bug tracking and wiki. On May 29, 2021, Phacility, the maintainer and sponsor of Phabricator announced end-of-life and stopped maintaining Phabricator.\nGitLab co-founder and CEO, Sid Sijbrandij gives credit to Phabricator on HackerNews:\nPhabricator was an inspiration to me when starting GitLab. It is shutting down now. Many of its features were years ahead of its time and there was a lot of humor in the product. As a tribute to it shall we add Clowcoptarize as a w…",
          "link": "https://about.gitlab.com/blog/2021/08/13/five-great-phabricator-features-inspired-gitlab/",
          "publishedOn": "2021-08-13T00:00:00.000Z",
          "wordCount": 4052,
          "title": "5 Great Phabricator features that inspired GitLab"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/08/10/how-to-agentless-gitops-aws/",
          "author": null,
          "description": "In part two of our GitOps series, we described how to use a push-based (or agentless) approach for GitOps by using GitLab scripting capabilities as well as integrating infrastructure-as-code tools into GitOps pipelines. In this third blog post, we’ll also dig deep into how to use a push-based approach, but this time our focus will be on the integrations of Terraform, AWS ECS, and AWS EC2 in GitOps flows. This approach may be preferable when using infrastructure components that aren't Kubernetes, such as VMs, physical devices, and cloud-provider services.\nSimilar to Ansible – an agentless IT automation solution – Terraform can be leveraged by the scripting capabilities of GitLab to shape your infrastructure. GitLab also provides out-of-the-box integrations with Terraform, such as GitLab-man…",
          "link": "https://about.gitlab.com/blog/2021/08/10/how-to-agentless-gitops-aws/",
          "publishedOn": "2021-08-10T00:00:00.000Z",
          "wordCount": 3924,
          "title": "How to use a push-based approach for GitOps with Terraform and AWS ECS and EC2"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/08/10/gitlab-13-12-10-released/",
          "author": null,
          "description": "Today we are releasing version 13.12.10 for GitLab Community Edition and Enterprise Edition.\nThis version resolves a number of regressions and bugs in\nMay's 13.12 release and\nprior versions.\nGitLab Community Edition and Enterprise Edition\nAvailable in GitLab Free, Premium, and Ultimate:\nFix: Sidekiq workers delete each other's metrics\nDo not create audit event for failed logins on read-only DB\nFix validation method regarding MIME type keys\nResolve \"operator does not exist\" in app/models/namespace/traversal_hierarchy.rb\ngitlab-rails: checks/postgresql detect silent NoDatabaseError\nAdding -ubi8 to version to find UBI images\nImportant notes on upgrading\nThis version does not include any new migrations, and for multi-node deployments, should not require any downtime.\nPlease be aware that by default the Omnibus packages will stop, run migrations,\nand start again, no matter how “big” or “small” the upgrade is. This behavior\ncan be changed by adding a /etc/gitlab/skip-auto-reconfigure file,\nwhich is only used for updates.\nUpdating\nTo update, check out our update page.\nGitLab subscriptions\nAccess to GitLab Premium and Ultimate features is granted by a paid subscription.\nAlternatively, sign up for GitLab.com\nto use GitLab's own infrastructure.",
          "link": "https://about.gitlab.com/releases/2021/08/10/gitlab-13-12-10-released/",
          "publishedOn": "2021-08-10T00:00:00.000Z",
          "wordCount": 1060,
          "title": "GitLab Patch Release: 13.12.10"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/08/09/five-ways-to-scale-remote-work/",
          "author": null,
          "description": "At GitLab, we believe that remote work at scale will define not only the future of work, but the future of living. We created REMOTE by GitLab to bring together the remote work community and answer the questions many companies are asking: \"How do we do this, and what's next?\"\nWe heard from some of the top leaders in remote work, from large companies that made the decision to leave the office behind, to teams of experts who have been studying the organizational design for years.\nWe share five lessons from the REMOTE by GitLab event that your team can apply to uplevel your remote practices and culture.\nSet guiding principles for your remote transition (and stick to them)\nAs you navigate the changes that come with implementing remote-first practices, it's important to have a set of values and…",
          "link": "https://about.gitlab.com/blog/2021/08/09/five-ways-to-scale-remote-work/",
          "publishedOn": "2021-08-09T00:00:00.000Z",
          "wordCount": 2136,
          "title": "5 Ways to scale remote work on your team"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/08/05/achieving-23-cost-savings-and-36-performance-gain-using-gitlab-and-gitlab-runner-on-arm-neoverse-based-aws-graviton2-processor/",
          "author": null,
          "description": "Companies in all industries and sectors have significantly invested in digital transformation and increased their software development capabilities. GitLab delivers modern DevOps with a complete DevOps platform. However, some organizations require self-managed GitLab and GitLab Runners, which creates added costs for hosting and running GitLab infrastructure. Our latest cost analysis and performance benchmarks show that customers can realize cost savings of up to 23% and performance gains of up to 36% by deploying the GitLab application and GitLab Runner on the Arm-based Graviton2 when compared to the x86 based M5/C5 EC2 instances.\nArm is a leading provider of silicon intellectual property (IP) for intelligent systems-on-chip (SoC) that power billions of devices. GitLab and Arm have collabo…",
          "link": "https://about.gitlab.com/blog/2021/08/05/achieving-23-cost-savings-and-36-performance-gain-using-gitlab-and-gitlab-runner-on-arm-neoverse-based-aws-graviton2-processor/",
          "publishedOn": "2021-08-05T00:00:00.000Z",
          "wordCount": 2451,
          "title": "23% Cost savings and 36% performance gain by deploying GitLab on Arm-based AWS Graviton2"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/08/04/ubs-gitlab-devops-platform/",
          "author": null,
          "description": "UBS, the largest truly global wealth manager, uses GitLab to power DevCloud, a single DevOps Platform that allows for a cloud-based, service-oriented, software development lifecycle.\n\"GitLab is a fundamental part of DevCloud,\" said Rick Carey, Group Chief Technology Officer at UBS. \"We wouldn't be able to have that seamless experience without GitLab. It allowed us to pull ahead of many of our competitors, and break down the barriers between coding, testing, and deployment.\"\nDuring GitLab Virtual Commit 2021, Rick and Eric Johnson, Chief Technology Officer at GitLab, talked about how building DevCloud on GitLab's DevOps Platform allowed UBS to increase their development velocity, lower their infrastructure costs, and increase collaboration between engineers and non-engineering teams worldwi…",
          "link": "https://about.gitlab.com/blog/2021/08/04/ubs-gitlab-devops-platform/",
          "publishedOn": "2021-08-04T00:00:00.000Z",
          "wordCount": 2323,
          "title": "How UBS created their own open DevOps Platform using GitLab"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/08/03/welcome-to-the-devops-platform-era/",
          "author": null,
          "description": "DevOps has evolved since its infancy, over a decade ago. Swiss developmental psychologist Jean Piaget believed human cognitive development has four stages (sensorimotor, preoperational, concrete operational, and formal operational). Through each of these stages, the human mind obtains new knowledge while building and modifying memories to inform one's understanding of the world around them.\nIn the same way that people go through stages as they grow, markets and industries also go through stages of development. Over the years, DevOps has grown into a mature, business-critical practice.\nAs the DevOps industry expanded, so did the number and complexity of tool-project integrations within an organization. This was the result of three developments in DevOps:\nCompanies moved from monolithic arch…",
          "link": "https://about.gitlab.com/blog/2021/08/03/welcome-to-the-devops-platform-era/",
          "publishedOn": "2021-08-03T00:00:00.000Z",
          "wordCount": 2914,
          "title": "Welcome to the DevOps Platform era"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/08/03/security-release-gitlab-14-1-2-released/",
          "author": null,
          "description": "Today we are releasing versions 14.1.2, 14.0.7, and 13.12.9 for GitLab Community Edition (CE) and Enterprise Edition (EE).\nThese versions contain important security fixes, and we strongly recommend that all GitLab installations be upgraded to one of these versions immediately.\nGitLab releases patches for vulnerabilities in dedicated security releases. There are two types of security releases: a monthly, scheduled security release, released a week after the feature release (which deploys on the 22nd of each month), and ad-hoc security releases for critical vulnerabilities. For more information, you can visit our security FAQ. You can see all of our regular and security release blog posts here. In addition, the issues detailing each vulnerability are made public on our issue tracker 30 days …",
          "link": "https://about.gitlab.com/releases/2021/08/03/security-release-gitlab-14-1-2-released/",
          "publishedOn": "2021-08-03T00:00:00.000Z",
          "wordCount": 2666,
          "title": "GitLab Security Release: 14.1.2, 14.0.7, and 13.12.9"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/07/29/velocity-with-confidence/",
          "author": null,
          "description": "How DevOps and NFS changed the game\nWhat if I told you that one of the best-selling racing video game franchises of all time, the \"Need For Speed\" (NFS), and DevOps have more in common with each other than you think? Yes, you read that correctly, probably not the NFS (Network File System) you were expecting.\nAn appetite for change\nFor context, the NFS series originally set out to redefine a saturated, yet unsophisticated, racing video game market. Motivated by an appetite for change, the NFS user experience reflected the human connection to real cars and how they behaved, which was a big challenge for developers in the 1990s. Nearly 30 years ago, \"The Need for Speed\" forever changed the landscape of racing games, selling 150 million copies since its debut.\n\nThe original Need For Speed vide…",
          "link": "https://about.gitlab.com/blog/2021/07/29/velocity-with-confidence/",
          "publishedOn": "2021-07-29T00:00:00.000Z",
          "wordCount": 3046,
          "title": "How GitLab 14 satisfies the need for speed with modern DevOps"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/07/29/how-orange-uses-gitlab-ci-cd-for-modern-devops/",
          "author": null,
          "description": "CI/CD is a foundational piece to modern software development. It's a major brick in the DevOps \"Automation\" pillar and every company involved in IT has to implement CI/CD or they're already quite far behind the curve.\nBut implementing CI/CD can be challenging especially for growing or large companies. Some of those challenges include:\nDevOps expertise and technical skills\nDevSecOps\nStandardization\nThree key hurdles that come with implementing CI/CD\nThis blog post unpackes these challenges and explains how Orange overcame them using GitLab.\nDevOps and technical skills\nNo matter which CI/CD tool you're using, it requires some amount of expertise to implement it right.\nDevOps expertise is important because your team needs some experience with Git workflows, deployment, environments, secrets m…",
          "link": "https://about.gitlab.com/blog/2021/07/29/how-orange-uses-gitlab-ci-cd-for-modern-devops/",
          "publishedOn": "2021-07-29T00:00:00.000Z",
          "wordCount": 3801,
          "title": "How Orange made a first step toward CI/CD standardization with GitLab"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/07/28/secure-container-images-with-gitlab-and-grype/",
          "author": null,
          "description": "The importance of container image security\nThanks to containers, what it means to \"ship software\" has changed dramatically. Engineering teams have shifted to produce container images and use these container images to deploy their software. Because of this change teams are now shipping significantly more software alongside their app – whether they realize it or not.\nBesides packaging an application, container images also include hundreds of binaries and libraries. These binaries and libraries are included in the container image produced by the team because the process of creating a container image requires teams to select a base image. A base image is a preexisting container image on which to \"base\" their own container image. In doing so, all software contained in the base image is inherite…",
          "link": "https://about.gitlab.com/blog/2021/07/28/secure-container-images-with-gitlab-and-grype/",
          "publishedOn": "2021-07-28T00:00:00.000Z",
          "wordCount": 2220,
          "title": "How to secure your container images with GitLab and Grype"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/07/28/gitlab-14-1-1-released/",
          "author": null,
          "description": "Today we are releasing version 14.1.1 for GitLab Community Edition and Enterprise Edition.\nThis version resolves a number of regressions and bugs in\nthis month's 14.1 release and\nprior versions.\nGitLab Community Edition and Enterprise Edition\nAvailable in GitLab Free, Premium, and Ultimate:\nExtend RackAttack basic authentication detection for rate limiting\nEnable bulk dismissal checkboxes on group vulnerability report\"\nFix syntax highlighting inline background on darkmode\nFix: Sidekiq workers delete each other's metrics\nPrevent terms from being created if blank\nRemove backfill migration for ci_build_trace_sections\nGeo: Fix snippet verification by replicating the HEAD ref\nRemove securityScansSucceeded from DevOps adoption\nFix markdown in development docs\nFix deployer task\nDon't ask users to upgrade to PG 13 yet\nImportant notes on upgrading\nThis version does not include any new migrations, and for multi-node deployments, should not require any downtime.\nPlease be aware that by default the Omnibus packages will stop, run migrations,\nand start again, no matter how “big” or “small” the upgrade is. This behavior\ncan be changed by adding a /etc/gitlab/skip-auto-reconfigure file,\nwhich is only used for updates.\nUpdating\nTo update, check out our update page.\nGitLab subscriptions\nAccess to GitLab Premium and Ultimate features is granted by a paid subscription.\nAlternatively, sign up for GitLab.com\nto use GitLab's own infrastructure.",
          "link": "https://about.gitlab.com/releases/2021/07/28/gitlab-14-1-1-released/",
          "publishedOn": "2021-07-28T00:00:00.000Z",
          "wordCount": 1100,
          "title": "GitLab Patch Release: 14.1.1"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/07/26/gitlab-helm-package-registry/",
          "author": null,
          "description": "Cloud native application architectures use containerization, microservices, and Kubernetes to run reliably at cloud-scale. With a built-in container registry and Kubernetes integration, GitLab is the best way to develop and deploy cloud native applications. GitLab version 14.1 also includes a Helm registry, which allows users to publish, install, and share Helm charts and packages from within our single application for the entire DevOps lifecycle.\nWhat is Helm?\nHelm is a package manager for Kubernetes. A Chart is a Helm package that contains the resource definitions required to run an application inside a Kubernetes cluster. Helm allows you to manage complex applications by storing the application definition in a chart that can be versioned, shared, and collaborated on.\nThe differences bet…",
          "link": "https://about.gitlab.com/blog/2021/07/26/gitlab-helm-package-registry/",
          "publishedOn": "2021-07-26T00:00:00.000Z",
          "wordCount": 1917,
          "title": "Introducing the GitLab Helm Package Registry"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/07/23/how-to-agentless-gitops-vars/",
          "author": null,
          "description": "In part one of our GitOps series, we described how to use a pull-based (or agent-based) approach. In this second blog post, we'll dig deep into how to use a push-based approach. The agentless approach may be preferable for situations with non-Kubernetes infrastructure components or when you don't want to install, run, and maintain agents in each infrastructure component for GitOps. In this post, we will discuss how the scripting capabilities of GitLab can be used in GitOps workflows, and how to use predefined GitLab variables to shape infrastructure components.\nAbout a push-based or agentless approach\nWith the agentless approach, infrastructure expressed and managed as code on GitLab, and updates and drift detection are automated and handled by GitLab without having to install any agents o…",
          "link": "https://about.gitlab.com/blog/2021/07/23/how-to-agentless-gitops-vars/",
          "publishedOn": "2021-07-23T00:00:00.000Z",
          "wordCount": 1830,
          "title": "How to use a push-based approach for GitOps with GitLab scripting and variables"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/07/23/announcing-package-hunter/",
          "author": null,
          "description": "Modern programming ecosystems make code reuse exceptionally easy. No matter the\nprogramming task at hand, chances are there is a package in a public registry\nsuch as rubygems.org or npmjs.com that implements that task.\nWhile the reuse of publicly available packages reduces the time necessary to write an app, this reuse\nbrings its own set of challenges. Apps quickly depend on hundreds of packages,\nand programmers often simply just trust that these packages don't contain malicious code.\nIn an ideal world, all depended-upon code is thoroughly vetted before being included in a program – however, this is often unfeasible in practice due to the sheer amount of dependency code that needs to be reviewed and the lack of existing tools to help with vetting dependency code.\nMalicious code in the wild…",
          "link": "https://about.gitlab.com/blog/2021/07/23/announcing-package-hunter/",
          "publishedOn": "2021-07-23T00:00:00.000Z",
          "wordCount": 1949,
          "title": "Meet Package Hunter: A tool for detecting malicious code in your dependencies"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/07/22/gitlab-14-1-released/",
          "author": null,
          "description": "Today, we are excited to announce the release of GitLab 14.1 with the ability to build, publish, and share Helm charts, create escalation policies to page responders, connect GitLab Runners to your Kubernetes clusters, enforce code coverage decisions, and much more!\nThese are just a few highlights from the 50+ improvements in this release. Read on to check out all of the great updates below.\nTo preview what's coming in next month’s release, check out our Upcoming Releases page, which includes our 14.2 release kickoff video.\nJoin us for GitLab Commit Virtual to learn how DevOps teams increase collaboration.\n\n\n\n\n\n\n\n\n\nThis month's Most Valuable Person (MVP) is\nAndrew Smith\n\nAndrew actively contributed numerous merge requests in the GitLab 14.1 release to help improve GitLab’s planning capabil…",
          "link": "https://about.gitlab.com/releases/2021/07/22/gitlab-14-1-released/",
          "publishedOn": "2021-07-22T00:00:00.000Z",
          "wordCount": 7904,
          "title": "GitLab 14.1 released with Helm Chart Registry and Escalation Policies"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/07/21/optimizing-devops-visibility-in-gitlab-14/",
          "author": null,
          "description": "DevOps makes teams and work more efficient, more consistent, and more productive – but how much more?\nOn its surface, the answer is simple. We need to measure workflow from idea to delivery, identify and remove blockers, and benchmark improvements in a manner that is consistent and replicable. The challenge is the way we've typically built the systems that hold the data we're trying to understand.\nEnhanced visibility tools are essential to measuring and optimizing modern DevOps processes, and mapping the work output to ensure the business outcomes that matter are achieved.\nThe failure of DIY DevOps\nMost businesses operate and maintain a multi-product \"DIY DevOps\" toolchain, but stitched-together applications with bespoke integrations don't lend themselves to visibility. Each component in t…",
          "link": "https://about.gitlab.com/blog/2021/07/21/optimizing-devops-visibility-in-gitlab-14/",
          "publishedOn": "2021-07-21T00:00:00.000Z",
          "wordCount": 1893,
          "title": "Optimize DevOps with enhanced visibility tools in GitLab 14"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/07/20/are-you-ready-for-the-newest-era-of-devsecops/",
          "author": null,
          "description": "Security is on everyone's radar, from board members to inquisitive grandparents. Everyone wants to know what software development teams are doing to protect their applications from attacks like that of Colonial Pipeline, Solarwinds, and others. With the launch of GitLab 14, we accelerated modern DevOps by bringing velocity with confidence, built-in security, and visibility, into DevOps success.\nThe modern DevOps solution is platform-driven, has a unified data store, and has security embedded throughout the software development lifecycle (SDLC). We find that it is these three attributes that drive demand for a modern DevOps solution among many different types of businesses.\nSecurity in the modern DevOps solution goes beyond just shifting security features left to empower the developers to f…",
          "link": "https://about.gitlab.com/blog/2021/07/20/are-you-ready-for-the-newest-era-of-devsecops/",
          "publishedOn": "2021-07-20T00:00:00.000Z",
          "wordCount": 2451,
          "title": "Are you ready for the newest era of DevSecOps?"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/07/20/improved-billing-and-subscription-management/",
          "author": null,
          "description": "What you need to know\nGitLab moves from annual true-ups to quarterly subscription reconciliation\nIntroduces cloud licensing and auto-renewals for improved license management\nRequires collection of operational data for customer success services\nApplicable to new customers from August 1, 2021 and existing customers at their next renewal\nToday, we are announcing changes to improve the billing and subscription management experience for customers. While quarterly subscription reconciliation benefits both our SaaS and self-managed customers, the three other improvements, including the collection of operational data for customer success services, auto-renewals, and cloud licensing, will enhance the product and service experience for self-managed customers.\nWhile other vendors are shifting to only…",
          "link": "https://about.gitlab.com/blog/2021/07/20/improved-billing-and-subscription-management/",
          "publishedOn": "2021-07-20T00:00:00.000Z",
          "wordCount": 2372,
          "title": "GitLab introduces updates to paid tiers for improved billing and subscription management"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/07/20/gitlab-14-0-6-released/",
          "author": null,
          "description": "Today we are releasing version 14.0.6 for GitLab Community Edition and Enterprise Edition.\nThis version resolves a number of regressions and bugs in\nthis month's 14.0 release and\nprior versions.\nGitLab Community Edition and Enterprise Edition\nAvailable in GitLab Free, Premium, and Ultimate:\nReplace Excon with Faraday for requesting object storage\nFix LFS objects not downloading with Bitbucket\nResolve \"Terraform module usage instructions are incorrect\"\nGeo: Fix snippet verification by replicating the HEAD ref\nFix validation method regarding MIME type keys\ncoordinator: Fix repo creation/removal race for up-to-date secondaries for 14-0-stable\nImportant notes on upgrading\nThis version does not include any new migrations, and for multi-node deployments, should not require any downtime.\nPlease be aware that by default the Omnibus packages will stop, run migrations,\nand start again, no matter how “big” or “small” the upgrade is. This behavior\ncan be changed by adding a /etc/gitlab/skip-auto-reconfigure file,\nwhich is only used for updates.\nUpdating\nTo update, check out our update page.\nGitLab subscriptions\nAccess to GitLab Premium and Ultimate features is granted by a paid subscription.\nAlternatively, sign up for GitLab.com\nto use GitLab's own infrastructure.",
          "link": "https://about.gitlab.com/releases/2021/07/20/gitlab-14-0-6-released/",
          "publishedOn": "2021-07-20T00:00:00.000Z",
          "wordCount": 1036,
          "title": "GitLab Patch Release: 14.0.6"
        }
      ]
    },
    {
      "title": "Phoronix",
      "feedUrl": "https://www.phoronix.com/rss.php",
      "siteUrl": "https://www.phoronix.com/",
      "articles": [
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.14-rc6",
          "author": null,
          "description": "Linus Torvalds has released Linux 5.14-rc6 as the latest weekly test release of Linux 5.14 that should go gold around the end of August...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.14-rc6",
          "publishedOn": "2021-08-16T00:16:22.000Z",
          "wordCount": 689,
          "title": "Linux 5.14-rc6 Released After Another Good Week"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30452",
          "author": null,
          "description": "With proper heatsinks becoming all the more important with speedy PCI Express 4.0 NVMe SSDs to avoid thermal throttling, SilverStone has been among the vendors offering after-market aluminum heatsinks designed for M.2 2280 drives. The SilverStone TP04 is a simple but effective aluminum alloy SSD cooling kit for about $17 USD.",
          "link": "https://www.phoronix.com/vr.php?view=30452",
          "publishedOn": "2021-08-15T18:41:24.000Z",
          "wordCount": 856,
          "title": "SilverStone TP04 M.2 SSD Cooling"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Apple-M1-PCIe-Linux-RFC",
          "author": null,
          "description": "While Linux 5.12 saw initial support merged for the Apple M1, it was quite the basic support with more robust support still to come. Besides the graphics support being a large work-in-progress, one of the areas now coming about is the new PCI Express driver that is necessary for supporting more functionality of this driver...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Apple-M1-PCIe-Linux-RFC",
          "publishedOn": "2021-08-15T16:16:45.000Z",
          "wordCount": 777,
          "title": "Apple M1 PCIe Driver Under Review For The Linux Kernel"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=GNU-Grep-3.7",
          "author": null,
          "description": "If you have noticed grep regressing performance-wise in recent releases, you may want to upgrade to GNU Grep 3.7 released this weekend as it fixes a nasty performance regression...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=GNU-Grep-3.7",
          "publishedOn": "2021-08-15T11:00:15.000Z",
          "wordCount": 711,
          "title": "Grep 3.7 Released To Fix \"Extreme Performance Degradation\""
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=OpenRazer-3.1",
          "author": null,
          "description": "OpenRazer 3.1 is now available as the newest version of this open-source, third-party solution for enabling Razer devices under Linux...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=OpenRazer-3.1",
          "publishedOn": "2021-08-15T10:24:40.000Z",
          "wordCount": 727,
          "title": "OpenRazer 3.1 Released With Support For More Razer Devices"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-Dropping-LightNVM",
          "author": null,
          "description": "Merged to the mainline Linux kernel six years ago was the LightNVM subsystem as part of Linux 4.4 LTS around \"Open-Channel SSDs\". That LightNVM code is now slated for removal with the upcoming Linux 5.15 cycle...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-Dropping-LightNVM",
          "publishedOn": "2021-08-15T06:00:00.000Z",
          "wordCount": 776,
          "title": "Linux Turning Off The Light - The LightNVM Subsystem To Be Removed"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Debian-11-Released",
          "author": null,
          "description": "Debian 11 \"Bullseye\" has been officially released now after just over two years in development...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Debian-11-Released",
          "publishedOn": "2021-08-14T23:15:43.000Z",
          "wordCount": 657,
          "title": "Debian 11 \"Bullseye\" Released"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Ogre-13-Released",
          "author": null,
          "description": "Besides the very successful Godot game engine and the up and coming O3DE, Ogre continues progressing as another useful open-source game engine. Out this weekend is Ogre 13.0 as the project switches up its versioning scheme...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Ogre-13-Released",
          "publishedOn": "2021-08-14T18:21:08.000Z",
          "wordCount": 730,
          "title": "Ogre 13 Open-Source Game Engine Released"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Apple-M1-Linux-August-2021",
          "author": null,
          "description": "A new status report has been published by the developers of \"Asahi Linux\" that are continuing to work on providing Linux support for the Apple Silicon initially with the M1 SoC...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Apple-M1-Linux-August-2021",
          "publishedOn": "2021-08-14T16:06:01.000Z",
          "wordCount": 924,
          "title": "Reverse Engineering & Bring-Up Of Linux On The Apple Silicon M1 Continues"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=ASUS-Platform-Profile-Linux",
          "author": null,
          "description": "One of the features that has come together nicely for Linux on laptops in recent months has been the platform profile support around the ACPI specification with support from multiple laptop vendors for allowing users to control their power/performance preference based on various system profile configurations. A patch is pending for newer ASUS laptops to enjoy this platform profile control under Linux...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=ASUS-Platform-Profile-Linux",
          "publishedOn": "2021-08-14T13:39:40.000Z",
          "wordCount": 841,
          "title": "ASUS Laptop Platform Profile Support Under Review For Linux"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Debian-GNU-Hurd-2021",
          "author": null,
          "description": "In addition to Debian GNU/Linux 11 set for release today, Debian GNU/Hurd 2021 has been released as the unofficial port of Debian to the GNU Hurd micro-kernel...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Debian-GNU-Hurd-2021",
          "publishedOn": "2021-08-14T13:19:03.000Z",
          "wordCount": 830,
          "title": "Debian GNU/Hurd 2021 Released With Experimental Rump-Based Userland Disk Driver, Go Port"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Debian-11-This-Weekend",
          "author": null,
          "description": "Debian 11.0 \"Bullseye\" is due for release today and the Debian developers involved are indeed putting the final touches on this next major Debian GNU/Linux distribution release...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Debian-11-This-Weekend",
          "publishedOn": "2021-08-14T10:27:32.000Z",
          "wordCount": 867,
          "title": "Debian 11 Is Releasing This Weekend With Many Improvements"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=KDE-Week-More-Plasma-Breeze",
          "author": null,
          "description": "KDE developers had another busy summertime week with a variety of UI improvements and other polishing to this open-source desktop environment...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=KDE-Week-More-Plasma-Breeze",
          "publishedOn": "2021-08-14T10:15:15.000Z",
          "wordCount": 718,
          "title": "KDE Sees More Improvements To Plasma, Konsole, Breeze This Week"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Ardour-6.9-Released",
          "author": null,
          "description": "Ardour as one of the leading open-source digital audio workstation (DAW) solutions is out with another new release...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Ardour-6.9-Released",
          "publishedOn": "2021-08-14T04:00:00.000Z",
          "wordCount": 675,
          "title": "Ardour 6.9 Digital Audio Workstation Released"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30444",
          "author": null,
          "description": "Given this week's launch of the Radeon RX 6600 XT and that also bringing the new Radeon Software for Linux 21.30 driver, I was curious to see how the Vulkan ray-tracing performance compares now against the NVIDIA GeForce RTX 30 series on Linux.",
          "link": "https://www.phoronix.com/vr.php?view=30444",
          "publishedOn": "2021-08-13T20:00:00.000Z",
          "wordCount": 926,
          "title": "GeForce RTX 30 vs. AMD Radeon RX 6000 Series Vulkan Ray-Tracing On Linux"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Wine-6.15-Released",
          "author": null,
          "description": "Wine 6.15 has been uncorked as the newest bi-weekly development release of this software that powers Steam Play and more for running Windows games/applications on Linux...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Wine-6.15-Released",
          "publishedOn": "2021-08-13T19:52:47.000Z",
          "wordCount": 716,
          "title": "Wine 6.15 Released With More PE Conversion Work, More 32-bit To 64-bit Thunks"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=NVIDIA-Tegra-New-uABI",
          "author": null,
          "description": "NVIDIA's Tegra DRM driver that is part of the mainline kernel will be introducing a new user-space API/ABI with Linux 5.15 that is designed for future hardware while also working for existing Tegra SoCs...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=NVIDIA-Tegra-New-uABI",
          "publishedOn": "2021-08-13T18:05:47.000Z",
          "wordCount": 818,
          "title": "NVIDIA Tegra Open-Source Graphics Driver Introducing New User-Space ABI"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Cirrus-Dolphin-Linux-Audio",
          "author": null,
          "description": "Cirrus Logic has contributed a number of improvements to their CS8409 HDA audio driver for the Linux kernel that includes support for new \"Dolphin\" audio hardware...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Cirrus-Dolphin-Linux-Audio",
          "publishedOn": "2021-08-13T12:26:27.000Z",
          "wordCount": 718,
          "title": "Cirrus Logic \"Dolphin\" Audio Support Coming For Linux 5.15"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-Nintendo-Wii-OTP",
          "author": null,
          "description": "For hobbyists that enjoy tinkering around with Linux running on the Nintendo Wii or Wii U game consoles, a new driver coming for Linux 5.15 allows accessing the specialized OTP read-only memory area that contains the encryption/decryption keys and other data...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-Nintendo-Wii-OTP",
          "publishedOn": "2021-08-13T11:31:35.000Z",
          "wordCount": 852,
          "title": "Linux 5.15 To Allow Reading From The Nintendo OTP Memory Area"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Arm-Clang-OpenCL-CPP-2021",
          "author": null,
          "description": "With LLVM's Clang C/C++ compiler front-end squaring away its OpenCL C 3.0 language support, Arm engineers are now working on the C++ equivalent support...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Arm-Clang-OpenCL-CPP-2021",
          "publishedOn": "2021-08-13T10:24:48.000Z",
          "wordCount": 701,
          "title": "Arm Working On Clang C++ For OpenCL 2021 (OpenCL 3.0 Compatible)"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-Adreno-680-7c3",
          "author": null,
          "description": "The MSM DRM kernel updates to this open-source Qualcomm Adreno driver have been sent in to DRM-Next ahead of the upcoming Linux 5.15 merge window...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-Adreno-680-7c3",
          "publishedOn": "2021-08-13T07:00:00.000Z",
          "wordCount": 807,
          "title": "Linux 5.15 To Add Graphics Support For Qualcomm Adreno 680, 7c3"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=AV1-VA-API-Mesa-Radeon",
          "author": null,
          "description": "With AMD RDNA2 GPUs such as the Radeon RX 6000 series there is hardware support for AV1 decoding while the Linux support has been slow to materialize. Fortunately, that's now changing...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=AV1-VA-API-Mesa-Radeon",
          "publishedOn": "2021-08-13T04:00:00.000Z",
          "wordCount": 778,
          "title": "AV1 VA-API Acceleration Coming For AMD Radeon RX 6000 Series Linux Users"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30442",
          "author": null,
          "description": "With LLVM/Clang 13 feature development having ended last week and the 13.0 release candidate being tagged, in starting off the benchmarking cycle first up I was looking at how well this new compiler is performing compared to LLVM Clang 12 stable on an AMD EPYC 7543 (Zen 3) Linux server.",
          "link": "https://www.phoronix.com/vr.php?view=30442",
          "publishedOn": "2021-08-12T18:47:11.000Z",
          "wordCount": 742,
          "title": "An Early Look At LLVM Clang 13 Performance On AMD Zen 3"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=eBPF-Foundation",
          "author": null,
          "description": "One of the most exciting Linux kernel innovations in recent years has been eBPF for an in-kernel virtual machine allowing sandboxed programs running within the Linux kernel. The Linux Foundation along with Microsoft and other partners are now forming the eBPF Foundation...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=eBPF-Foundation",
          "publishedOn": "2021-08-12T17:11:15.000Z",
          "wordCount": 829,
          "title": "Microsoft & Others Form The eBPF Foundation"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-DG1-Linux-Ready-IDs",
          "author": null,
          "description": "As I have covered in many Phoronix articles over the past number of months, it's been a lengthy road bringing up the DG1 graphics support on Linux with the Intel open-source engineers having to re-architect their \"i915\" kernel graphics driver to support device local memory, getting the GuC support into good shape, scheduler changes, beginning to make use of TTM for memory management, user-space API changes, and a ton of other changes in expanding the driver's scope from just catering to integrated graphics. But now it looks like the DG1 Linux support is about to be officially advertised...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-DG1-Linux-Ready-IDs",
          "publishedOn": "2021-08-12T13:20:43.000Z",
          "wordCount": 1034,
          "title": "Intel Appears Ready To Advertise Its DG1 Graphics Card Support On Linux"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Radeon-Software-21.30-FW",
          "author": null,
          "description": "AMD has upstreamed the Van Gogh binary-only firmware files necessary for the RDNA2 graphics to be initialized by the open-source driver on this forthcoming APU.'..",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Radeon-Software-21.30-FW",
          "publishedOn": "2021-08-12T12:45:37.000Z",
          "wordCount": 887,
          "title": "AMD Van Gogh Firmware Published, Other Radeon GPU Firmware Updated"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Btrfs-IDMAPPED-Mounts",
          "author": null,
          "description": "Introduced to the Linux kernel earlier this year with Linux 5.12 was IDMAPPED mounts that allow for different mounts to expose the same file or directory with different ownership. IDMAPPED mounts was designed with use-cases ranging from containers to systemd-homed and more as outlined in the earlier article. Btrfs is now ready to begin supporting IDMAPPED mounts...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Btrfs-IDMAPPED-Mounts",
          "publishedOn": "2021-08-12T10:48:03.000Z",
          "wordCount": 736,
          "title": "Btrfs Set To Land Support For IDMAPPED Mounts In Linux 5.15"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Firefox-92-Beta",
          "author": null,
          "description": "With this week's release of Firefox 91, like clockwork the beta for Firefox 92 is now available to facilitate wider testing of this next browser release to debut in September...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Firefox-92-Beta",
          "publishedOn": "2021-08-12T10:03:23.000Z",
          "wordCount": 781,
          "title": "Firefox 92 Beta Takes Flight With AVIF Image Support"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Qt-Creator-5.0-RC",
          "author": null,
          "description": "Qt Creator as the Qt/C++ focused integrated development environment from The Qt Company is preparing to release version 5.0 as it prepares to switch to semantic versioning...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Qt-Creator-5.0-RC",
          "publishedOn": "2021-08-12T09:51:55.000Z",
          "wordCount": 735,
          "title": "Qt Creator 5.0 Nears With New Features"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-Media-RFC-AV1-uAPI",
          "author": null,
          "description": "The number of hardware platforms providing accelerated AV1 coding is still quite limited for now but with more hardware coming to market supporting encode/decode of this royalty-free video codec, the Linux kernel's media subsystem is getting ready...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-Media-RFC-AV1-uAPI",
          "publishedOn": "2021-08-12T07:00:00.000Z",
          "wordCount": 853,
          "title": "The Linux Kernel Begins Preparing For AV1 Decode Support"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Thunderbird-91-Released",
          "author": null,
          "description": "Thunderbird 91 is now available as the first major update in a year for this Mozilla mail client that is succeeding the Thunderbird 78 series...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Thunderbird-91-Released",
          "publishedOn": "2021-08-12T00:06:40.000Z",
          "wordCount": 796,
          "title": "Thunderbird 91 Released With Big Improvements For This Open-Source Mail Client"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30434",
          "author": null,
          "description": "With yesterday's launch day Radeon RX 6600 XT Linux review the benchmarks were conducted using the popular Mesa RADV open-source driver used by many Linux gamers considering it's the driver Valve has been relentlessly optimizing and is the default on most (or all) Linux distributions. For those wondering how the performance of RADV is comparing to that of AMD's closed-source \"PRO\" Vulkan driver distributed as part of the \"Radeon Software for Linux\" package, here are some benchmarks exploring that difference.",
          "link": "https://www.phoronix.com/vr.php?view=30434",
          "publishedOn": "2021-08-11T18:30:00.000Z",
          "wordCount": 887,
          "title": "Radeon RX 6600/6700/6800 XT: RADV vs. PRO Vulkan Driver Performance"
        }
      ]
    }
  ],
  "cliVersion": "1.11.0"
}