{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": [
        {
          "id": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.0",
          "author": null,
          "description": "Added: support an experimental template for YouTube feed 📺 Demo | Source\n\nAggregate content from any YouTube channel rss url https://www.youtube.com/feeds/videos.xml?channel_id=<replace_with_channel_id>\nVideos are embedded via iframe and loading accelerated by youtube-lite-embed\nAds are reduced thanks to YouTube's policy for embedded videos 🙃\nWorks on mobile devices with butter smooth horizontal scroll.\nCaveat: the template works only with YouTube content. You cannot mix textual RSS feed or other video sources such as Vimeo.\nChanged: Default HTML template meta tag adjusted to match convention\nChanged: sources in template data is now ordered by last update timestamp (as opposed to alphabetical)\nThank you @PiyushLosalka",
          "link": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.0",
          "publishedOn": "2021-06-23T05:57:59.000Z",
          "wordCount": 370,
          "title": "v1.11.0"
        }
      ]
    },
    {
      "title": "GitLab",
      "feedUrl": "https://about.gitlab.com/atom.xml",
      "siteUrl": "https://about.gitlab.com/blog/",
      "articles": [
        {
          "id": "https://about.gitlab.com/releases/2021/07/01/security-release-gitlab-14-0-2-released/",
          "author": null,
          "description": "Today we are releasing versions 14.0.2, 13.12.6, and 13.11.6 for GitLab Community Edition (CE) and Enterprise Edition (EE).\nThese versions contain important security fixes, and we strongly recommend that all GitLab installations be upgraded to one of these versions immediately.\nGitLab releases patches for vulnerabilities in dedicated security releases. There are two types of security releases: a monthly, scheduled security release, released a week after the feature release (which deploys on the 22nd of each month), and ad-hoc security releases for critical vulnerabilities. For more information, you can visit our security FAQ. You can see all of our regular and security release blog posts here. In addition, the issues detailing each vulnerability are made public on our issue tracker 30 days…",
          "link": "https://about.gitlab.com/releases/2021/07/01/security-release-gitlab-14-0-2-released/",
          "publishedOn": "2021-07-01T00:00:00.000Z",
          "wordCount": 2660,
          "title": "GitLab Security Release: 14.0.2, 13.12.6, and 13.11.6"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/06/30/how-to-stand-up-gitlab-in-awsmp/",
          "author": null,
          "description": "In this guide we will learn how to spin up GitLab in the AWS Marketplace:\nPre requisites for this lab are having an account in AWS and an accessible and working VPC.\nWe will learn the following steps:\nStand up a self-managed instance of GitLab.\nInstall Runner and Docker Engine.\nStep-by-step Instructions\nStep 1 - Stand up GitLab instance in AWS\nOpen GitLab Ultimate in AWS Marketplace.\nClick on Continue to Subscribe\n\nSign in with your IAM user.\n\nClick on Continue to Configuration.\n\nLeave the default value for Delivery Method, select the latest version in Software Version, select your Region, click Continue to Launch.\n\nIn Launch this software page, scroll down.\n\nUnder Security Group Settings click Create New Based On Seller Settings .\n\nName your security group, add a description, and save it.…",
          "link": "https://about.gitlab.com/blog/2021/06/30/how-to-stand-up-gitlab-in-awsmp/",
          "publishedOn": "2021-06-30T00:00:00.000Z",
          "wordCount": 2147,
          "title": "How to stand-up a GitLab instance in AWS Marketplace"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/06/28/package-key-extension/",
          "author": null,
          "description": "GitLab uses a GPG key to sign all Omnibus packages created within the CI pipelines to insure that the packages have not been tampered with. This key is seperate from the repository metadata signing key used by package managers and the GPG signing key for the GitLab Runner. The Omnibus package signing key is set to expire on July 1, 2021 and will be extended to expire on July 1, 2022 instead.\nWhy are we extending the deadline?\nThe Omnibus package signing key's expiration is extended each year to comply with GitLab security policies and to limit the exposure should the key become compromised. The key's expiration is extended instead of rotating to a new key to be less disruptive for users that do verify package integrity checks prior to installing the package.\nWhat do I need to do?\nThe only action that needs to be taken is to update your copy of the package signing key if you validate the signatures on the Omnibus packages that GitLab distributes.\nThe package signing key is not the key that signs the repository metadata used by the OS package managers like apt or yum. Unless you are specifically verifying the package signatures or have configured your package manager to verify the package signatures, there is no action needed on your part to continue installing Omnibus packages.\nMore information concerning verification of the package signatures\nis available in the Omnibus documentation. If you just need to refresh a copy\nof the public key, then you can find it on any of the GPG keyservers by\nsearching for support@gitlab.com or using the key ID of\nDBEF 8977 4DDB 9EB3 7D9F  C3A0 3CFC F9BA F27E AB47. Alternatively you could\ndownload it directly from packages.gitlab.com using the URL:\nhttps://packages.gitlab.com/gitlab/nightly-builds/gpgkey/gitlab-nightly-builds-3D645A26AB9FBD22.pub.gpg\n\n\nWhat do I do if I still have problems?\nPlease open an issue in the omnibus-gitlab issue tracker.",
          "link": "https://about.gitlab.com/blog/2021/06/28/package-key-extension/",
          "publishedOn": "2021-06-28T00:00:00.000Z",
          "wordCount": 1381,
          "title": "GitLab extends Omnibus package signing key expiration by one year"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/06/24/gitlab-14-0-1-released/",
          "author": null,
          "description": "Today we are releasing version 14.0.1 for GitLab Community Edition and Enterprise Edition.\nThis version resolves a number of regressions and bugs in\nthis month's 14.0 release and\nprior versions.\nGitLab Community Edition and Enterprise Edition\nAvailable in GitLab Free, Premium, and Ultimate:\nUpdate Geo UI screenshots in docs page\nUpdate admin docs with new admin area access info\nAdd Helm-2to3.gitlab-ci.yml to Auto DevOps\nUpdate docs for new Members page location on GitLab navigation\nDevOps Adoption - ensure displayNamespaceId is included\nRemove add button from Devops Adoption\nGeo: Add Terraform Module to datatypes doc\nCreate 14.0 What's New entry\nToggle codequality diff annotations flag\nBump kas to v14.0.1\nExempt unicorn 'svlogd_prefix' from deprecation check\nImportant notes on upgrading\nThis version does not include any new migrations, and for multi-node deployments, should not require any downtime.\nPlease be aware that by default the Omnibus packages will stop, run migrations,\nand start again, no matter how “big” or “small” the upgrade is. This behavior\ncan be changed by adding a /etc/gitlab/skip-auto-reconfigure file,\nwhich is only used for updates.\nUpdating\nTo update, check out our update page.\nGitLab subscriptions\nAccess to GitLab Premium and Ultimate features is granted by a paid subscription.\nAlternatively, sign up for GitLab.com\nto use GitLab's own infrastructure.",
          "link": "https://about.gitlab.com/releases/2021/06/24/gitlab-14-0-1-released/",
          "publishedOn": "2021-06-24T00:00:00.000Z",
          "wordCount": 1085,
          "title": "GitLab Patch Release: 14.0.1"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/06/23/how-to-use-agent-based-gitops/",
          "author": null,
          "description": "In the previous post, titled 3 ways to approach GitOps, we discussed the many benefits and options that GitLab supports for fulfilling the GitOps requirements of customers, whose IT environments are composed of heterogeneous technologies and infrastructures. This post is a 3-part series, in which we delve deeper into these options. In this first part, we cover the pull-based or agent-based approach.\nAbout a pull-based or agent-based approach\nIn this approach, an agent is installed in your infrastructure components to pull changes whenever there is a drift from the desired configuration, which resides in GitLab. Although the infrastructure components could be anything from a physical server or router to a VM or a database, we will focus on a Kubernetes cluster in this section.\nIn the follow…",
          "link": "https://about.gitlab.com/blog/2021/06/23/how-to-use-agent-based-gitops/",
          "publishedOn": "2021-06-23T00:00:00.000Z",
          "wordCount": 3499,
          "title": "How to use a pull-based (agent-based) approach for GitOps"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/06/22/gitlab-14-modern-devops/",
          "author": null,
          "description": "The DevOps era began with a big idea – dissolve silos to deliver better software, faster. In the transition from classic software paradigms, DIY DevOps toolchains were built with parts that were never designed to work together. That DIY DevOps era left many trapped in new silos, without visibility, and mired in maintenance. Business outcomes suffered as the potential of DevOps was never fully realized.\nThe next iteration of DevOps\nThere is a better way to build software. GitLab 14 delivers modern DevOps with a complete DevOps platform, for a streamlined experience that unleashes the power of DevOps. Over the past year, GitLab has shipped advanced DevOps platform capabilities that enable any team to build and deliver software with velocity, trust, and visibility – no matter their size, indu…",
          "link": "https://about.gitlab.com/blog/2021/06/22/gitlab-14-modern-devops/",
          "publishedOn": "2021-06-22T00:00:00.000Z",
          "wordCount": 2648,
          "title": "GitLab 14 signals shift to modern DevOps: A DevOps platform with velocity, trust, and visibility"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/06/22/gitlab-14-0-released/",
          "author": null,
          "description": "When we think of everything released in the year since GitLab 13.0, we could not be more proud of our community and our team. This month, we celebrate our release of GitLab 14.0 by first taking a step back.\nTogether, we’ve made so much progress over the last year that we want to talk about everything it took to get to GitLab 14.\nWe use semantic versioning so a point release, like 14.0, represents everything new in this month. GitLab 14 is the culmination of the past year. Even more than that, GitLab 14 represents the future of GitLab, and the future of DevOps.\nWith GitLab 14, teams of all sizes are moving from maintaining DIY DevOps toolchains to adopting modern DevOps. GitLab 14 is a complete DevOps platform with security embedded in its DNA, visibility and insights enabled by its single …",
          "link": "https://about.gitlab.com/releases/2021/06/22/gitlab-14-0-released/",
          "publishedOn": "2021-06-22T00:00:00.000Z",
          "wordCount": 12282,
          "title": "GitLab 14.0 released with a celebration of GitLab 14"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/06/21/usage-ping-configuration-bug-for-self-managed-instances/",
          "author": null,
          "description": "We recently discovered a Usage Ping  configuration bug for self-managed instances and have since published a patch release to fix the bug. The issue affects the ability to disable Usage Ping for self-managed GitLab via text configuration files, resulting in the collection and transmission of Usage Ping events from the instance. This bug affects any instance running GitLab version 9.3 to version 13.12.3, and was patched in 13.12.4.\nWhat does this mean for existing users?\nThis issue does not affect customers who have disabled Usage Ping via the user interface or any users of our SaaS product.\nYou can check your instance configuration settings to see if this issue may have affected you. We’ve published more detailed instructions here.\nWhat should I do?\nSince we do not collect any configuration data from your instance, we have no way to detect if you unintentionally shared data with GitLab. Out of an abundance of caution, we ask that you fill out this form if you suspect that Usage Ping data was shared after taking steps to opt-out in your GitLab configuration file. We will purge data from our systems and follow up with confirmation.\nPlease share your questions and feedback with us on the community forum.",
          "link": "https://about.gitlab.com/blog/2021/06/21/usage-ping-configuration-bug-for-self-managed-instances/",
          "publishedOn": "2021-06-21T00:00:00.000Z",
          "wordCount": 1140,
          "title": "Usage Ping configuration bug for self-managed instances"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/06/21/how-to-become-more-productive-with-gitlab-ci/",
          "author": null,
          "description": "CI/CD pipelines are the preeminent solution to mitigate potential risks while integrating code changes into the repository. CI/CD pipelines help isolate the impact of potential errors, making it easier to fix them. Top that with a tool that provides effective visibility into the running tasks and there you have a recipe for success.\nSince the primary purpose of CI/CD pipelines is to speed up the development process and provide value to the end user faster, there's always room to make the process more efficient. This blog post unpacks some strategies that can help you get the most out of your pipeline definition in GitLab CI.\nHow Directed Acyclic Graphs (DAG) enable concurrent pipelines\n\nBy using the \"Needs\" keyword you can define dependencies for jobs that need to be used from previous sta…",
          "link": "https://about.gitlab.com/blog/2021/06/21/how-to-become-more-productive-with-gitlab-ci/",
          "publishedOn": "2021-06-21T00:00:00.000Z",
          "wordCount": 2614,
          "title": "How to become more productive with Gitlab CI"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/06/21/gitlab-13-12-5-released/",
          "author": null,
          "description": "Today we are releasing version 13.12.5 for GitLab Community Edition and Enterprise Edition.\nThis version resolves a number of regressions and bugs in\nthis month's 13.12 release and\nprior versions.\nGitLab Community Edition and Enterprise Edition\nAvailable in GitLab Free, Premium, and Ultimate:\nOnly update required instance ci template when the parameter is present\nFix Password expired error on git fetch via SSH for LDAP user\nAdvanced Search Settings page does not load if the ES url is unreachable\nImportant notes on upgrading\nThis version does not include any new migrations, and for multi-node deployments, should not require any downtime.\nPlease be aware that by default the Omnibus packages will stop, run migrations,\nand start again, no matter how “big” or “small” the upgrade is. This behavior\ncan be changed by adding a /etc/gitlab/skip-auto-reconfigure file,\nwhich is only used for updates.\nUpdating\nTo update, check out our update page.\nGitLab subscriptions\nAccess to GitLab Premium and Ultimate features is granted by a paid subscription.\nAlternatively, sign up for GitLab.com\nto use GitLab's own infrastructure.",
          "link": "https://about.gitlab.com/releases/2021/06/21/gitlab-13-12-5-released/",
          "publishedOn": "2021-06-21T00:00:00.000Z",
          "wordCount": 1047,
          "title": "GitLab Patch Release: 13.12.5"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/06/16/gpg-key-used-to-sign-gitlab-runner-packages-rotated/",
          "author": null,
          "description": "GitLab uses a GPG key to sign official GitLab Runner packages. We recently became aware of an instance where this key and other tokens used to distribute official GitLab Runner packages and binaries were not secured according to GitLab’s security policies.\nWe have not found any evidence of unauthorized modification of the packages or access to the services storing them. Our team has audited and investigated integrity hashes, bucket logs and versioning, and pipeline history and concluded that the unauthorized modification of any packages is exceedingly unlikely.\nOut of an abundance of caution, the GPG key used for release signing and verification has been rotated along with all other tokens that were improperly secured.\nIf you use GitLab.com shared runners, this does not impact you.\nAs of J…",
          "link": "https://about.gitlab.com/blog/2021/06/16/gpg-key-used-to-sign-gitlab-runner-packages-rotated/",
          "publishedOn": "2021-06-16T00:00:00.000Z",
          "wordCount": 1567,
          "title": "The GPG key used to sign GitLab Runner packages has been rotated"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/06/15/why-we-are-building-the-gitlab-environment-toolkit-to-help-deploy-gitlab-at-scale/",
          "author": null,
          "description": "Last year I wrote about how the Quality Engineering Enablement team was building up the performance testing of GitLab with the GitLab Performance Tool (GPT). Last year, the biggest challenge with performance testing wasn't so much the testing but rather setting up the right large scale GitLab environments to test against.\nLike any server application, deploying at scale is challenging. That's why we built another toolkit that automates the deployment of GitLab at scale: The GitLab Environment Toolkit (GET).\n\nGitLab Environment Toolkit logo\nInternally called the \"Performance Environment Builder\" (PEB), GET grew alongside GPT as we continued to expand our performance testing efforts. Over time we built a toolkit that was quite capable in its own right of deploying GitLab at scale, which is wh…",
          "link": "https://about.gitlab.com/blog/2021/06/15/why-we-are-building-the-gitlab-environment-toolkit-to-help-deploy-gitlab-at-scale/",
          "publishedOn": "2021-06-15T00:00:00.000Z",
          "wordCount": 4866,
          "title": "The next step in performance testing? The GitLab Environment Toolkit"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/06/14/gitlab-13-12-4-released/",
          "author": null,
          "description": "Today we are releasing version 13.12.4 for GitLab Community Edition and Enterprise Edition.\nThis version resolves a number of regressions and bugs in\nthis month's 13.12 release and\nprior versions.\nGitLab Community Edition and Enterprise Edition\nAvailable in GitLab Free, Premium, and Ultimate:\nFix double render in project's git URL redirect\nFix MR diff compare with previous version\nAdd alias method usage_ping_enabled?\nDo not show Praefect deprecation if Praefect is disabled\nUpdate Mattermost to 5.34.4\nImportant notes on upgrading\nThis version does not include any new migrations, and for multi-node deployments, should not require any downtime.\nPlease be aware that by default the Omnibus packages will stop, run migrations,\nand start again, no matter how “big” or “small” the upgrade is. This behavior\ncan be changed by adding a /etc/gitlab/skip-auto-reconfigure file,\nwhich is only used for updates.\nUpdating\nTo update, check out our update page.\nGitLab subscriptions\nAccess to GitLab Premium and Ultimate features is granted by a paid subscription.\nAlternatively, sign up for GitLab.com\nto use GitLab's own infrastructure.",
          "link": "https://about.gitlab.com/releases/2021/06/14/gitlab-13-12-4-released/",
          "publishedOn": "2021-06-14T00:00:00.000Z",
          "wordCount": 1038,
          "title": "GitLab Patch Release: 13.12.4"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/06/11/how-i-use-gitlab-to-help-my-hack/",
          "author": null,
          "description": "GitLab is best known as a complete open source DevOps platform, delivered as a single application, but it also offers powerful project management and collaboration capabilities. In fact, every GitLab team uses GitLab to develop, track and collaborate on projects, processes, and programs.\nBut, what about… other uses? Say … hacking, for instance. 🤷‍♀️\nCan GitLab help a hacker fine-tune their craft? Through our Ask a Hacker AMA series we discovered that there are some bug bounty hunters who use GitLab to streamline their research process. And, like so many cool and awesome things, we learned on Twitter about another contributor using GitLab for bug bounty hunting.  So, we followed up to learn more.\nMeet our hackers\nAlex Chapman\n\nAlex has been hacking for 14 years professionally, but his inte…",
          "link": "https://about.gitlab.com/blog/2021/06/11/how-i-use-gitlab-to-help-my-hack/",
          "publishedOn": "2021-06-11T00:00:00.000Z",
          "wordCount": 4798,
          "title": "How do bug bounty hunters use GitLab to help their hack?"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/06/10/how-to-get-gitops-right-with-iac-security/",
          "author": null,
          "description": "In today's competitive digital era, it is imperative for organizations to undergo a digital transformation to effectively compete. For many, achieving a digital transformation means transitioning toward a DevOps model.\nDevOps has been around for many years, and the development side of the house has benefitted from the core practices of DevOps. However, the infrastructure side of the house has been lagging behind, particularly when it comes to speed. With infrastructure as code (IaC) and GitOps, infrastructure teams have been able to apply the same disciplines and quality gates that are used to manage application code to the infrastructure - to deliver products faster, with more predictability and at scale.\nSecurity slowing down delivery\nWhile the GitOps concept promises faster and more fre…",
          "link": "https://about.gitlab.com/blog/2021/06/10/how-to-get-gitops-right-with-iac-security/",
          "publishedOn": "2021-06-10T00:00:00.000Z",
          "wordCount": 2135,
          "title": "How to get GitOps right with infrastructure as code security"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/06/09/how-to-protect-your-source-code-with-gitlab-and-jscrambler/",
          "author": null,
          "description": "Development teams are building, testing, and shipping code faster than ever before. Today, we know that security has a role to play at the early stages of the DevOps workflow, but these security controls are mostly centered around finding and fixing bugs and vulnerabilities during development.\nIn this tutorial, we will explore the importance of protecting client-side application code at runtime and guide you through implementing it in your GitLab instance using the integration with Jscrambler.\nThe importance of runtime code protection\nWith web and mobile applications dealing with increasingly sensitive data, addressing the application's attack surface requires considering additional threats that are not directly linked to vulnerabilities.\nThis concern has been widely covered in NIST, ISO 2…",
          "link": "https://about.gitlab.com/blog/2021/06/09/how-to-protect-your-source-code-with-gitlab-and-jscrambler/",
          "publishedOn": "2021-06-09T00:00:00.000Z",
          "wordCount": 2931,
          "title": "How to protect your source code with GitLab and Jscrambler"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/06/07/tuto-mac-m1-gitlab-ci/",
          "author": null,
          "description": "GitLab's complete DevOps platform comes with built-in continuous integration (CI) and continuous delivery (CD) via GitLab CI/CD. GitLab CI/CD is a great solution to increase developer productivity and motivation to write higher-quality code without sacrificing speed. It runs a series of tests every time a commit is pushed, providing immediate visibility into the results of changes in the codebase. While it is not a hassle to set up a CI using Linux-based machines, iOS and macOS developers may find it is more complicated to have access to a Mac that is connected and available 24 hours a day.\nGitLab Runners, provided on GitLab.com, are the engine that executes CI workflows. Due to various requirements, some users may opt to self-host runners on public cloud VMs. This is super easy if the bui…",
          "link": "https://about.gitlab.com/blog/2021/06/07/tuto-mac-m1-gitlab-ci/",
          "publishedOn": "2021-06-07T00:00:00.000Z",
          "wordCount": 3278,
          "title": "How to use Scaleway to self-host your GitLab Runners"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/06/07/gitlab-13-12-3-released/",
          "author": null,
          "description": "Today we are releasing version 13.12.3 for GitLab Community Edition and Enterprise Edition.\nThis version resolves a number of regressions and bugs in\nlast month's 13.12 release and\nprior versions.\nGitLab Community Edition and Enterprise Edition\nFix maven & gradle examples in the docs, enabling line-by-line display of test coverage in merge requests out-of-the-box (for java &\nkotlin)\nFix issue with frames not loading in Safari\nImprove SSH key expiration warning emails\nAdd an option to expose description_html in Release API [RUN ALL RSPEC] [RUN AS-IF-FOSS]\nFix CSP issues related to captchas\nSet CSP back to disabled by default\nFix referrer option passed to Akismet client\nFix passing environment variables for migrations\nImportant notes on upgrading\nThis version does not include any new migrations, and for multi-node deployments, should not require any downtime.\nPlease be aware that by default the Omnibus packages will stop, run migrations,\nand start again, no matter how “big” or “small” the upgrade is. This behavior\ncan be changed by adding a /etc/gitlab/skip-auto-reconfigure file,\nwhich is only used for updates.\nUpdating\nTo update, check out our update page.\nGitLab subscriptions\nAccess to GitLab Premium and Ultimate features is granted by a paid subscription.\nAlternatively, sign up for GitLab.com\nto use GitLab's own infrastructure.",
          "link": "https://about.gitlab.com/releases/2021/06/07/gitlab-13-12-3-released/",
          "publishedOn": "2021-06-07T00:00:00.000Z",
          "wordCount": 1079,
          "title": "GitLab Patch Release: 13.12.3"
        }
      ]
    },
    {
      "title": "Phoronix",
      "feedUrl": "https://www.phoronix.com/rss.php",
      "siteUrl": "https://www.phoronix.com/",
      "articles": [
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=CXL-For-Linux-5.14",
          "author": null,
          "description": "Intel open-source engineers continue working on the bring-up around Compute Express Link (CXL) as the new open standard interconnect built off PCIe aiming to empower next-generation servers...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=CXL-For-Linux-5.14",
          "publishedOn": "2021-07-03T15:54:49.000Z",
          "wordCount": 872,
          "title": "CXL Bring-Up Continues - More Infrastructure For Linux 5.14, \"More Meat\" For Linux 5.15"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=XFS-Linux-5.14",
          "author": null,
          "description": "The XFS file-system continues seeing a lot of work cleaning up the kernel driver code as well as some minor feature improvements heading into Linux 5.14...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=XFS-Linux-5.14",
          "publishedOn": "2021-07-03T13:00:25.000Z",
          "wordCount": 892,
          "title": "XFS Sees A Lot Of Cleanups For Linux 5.14"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=June-2021-Benchmark-Updates",
          "author": null,
          "description": "During the past month were a number of updated Phoronix Test Suite test profiles made available on OpenBenchmarking.org as part of our open-source cross-platform benchmarking framework...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=June-2021-Benchmark-Updates",
          "publishedOn": "2021-07-03T11:13:08.000Z",
          "wordCount": 813,
          "title": "New/Updated Benchmarks For June From GravityMark To L4D2 Vulkan, Updated Neural Networks"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.14-POWER",
          "author": null,
          "description": "The POWER architecture updates have been submitted for the ongoing Linux 5.14 merge window with a few changes worth pointing out this round...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.14-POWER",
          "publishedOn": "2021-07-03T10:24:37.000Z",
          "wordCount": 755,
          "title": "Linux 5.14 POWERs Up The Microwatt Soft CPU Core"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Darktable-3.6-Released",
          "author": null,
          "description": "Darktable 3.6 is out as this summer's feature update to this open-source RAW photography software package and a great alternative to Adobe Photoshop Lightroom...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Darktable-3.6-Released",
          "publishedOn": "2021-07-03T10:08:56.000Z",
          "wordCount": 789,
          "title": "Darktable 3.6 Released For This Free Alternative To Adobe Lightroom"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=KDE-EO-June-Wayland-Faster-SVG",
          "author": null,
          "description": "KDE developers ended June with yet more Plasma Wayland fixes plus a number of other worthwhile fixes too...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=KDE-EO-June-Wayland-Faster-SVG",
          "publishedOn": "2021-07-03T09:58:50.000Z",
          "wordCount": 738,
          "title": "KDE Ends June With Wayland Fixes, More Responsive Plasma With Faster SVG Handling"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=OpenZFS-2.1",
          "author": null,
          "description": "Shipping now as the successor to last November's big OpenZFS 2.0 release is OpenZFS 2.1 as quite a worthy follow-on release...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=OpenZFS-2.1",
          "publishedOn": "2021-07-02T20:39:14.000Z",
          "wordCount": 846,
          "title": "OpenZFS 2.1 Released With dRAID, Compatibility Property, Better Performance"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Wine-6.12-Released",
          "author": null,
          "description": "In celebrating the US holiday weekend, Wine 6.12 has arrived for popping in enjoying the latest Windows games and applications on Linux...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Wine-6.12-Released",
          "publishedOn": "2021-07-02T20:05:58.000Z",
          "wordCount": 814,
          "title": "Wine 6.12 Released With More PE Conversion, New Themes"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.14-SD-Improvements",
          "author": null,
          "description": "The MMC/MEMSTICK updates for Linux 5.14 bring more work on bettering the kernel's Secure Digital card support...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.14-SD-Improvements",
          "publishedOn": "2021-07-02T17:00:00.000Z",
          "wordCount": 843,
          "title": "Linux 5.14 Bringing SD Cache Ctrl Support, Other SD Card Support Improvements"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30311",
          "author": null,
          "description": "With Microsoft making public this week their early Windows Insider Preview builds of Windows 11, curiosity got the best of me to give it a whirl in looking at the performance of the early Windows 11 preview build compared to Ubuntu Linux.",
          "link": "https://www.phoronix.com/vr.php?view=30311",
          "publishedOn": "2021-07-02T14:23:02.000Z",
          "wordCount": 747,
          "title": "Linux Leading Over Early Windows 11 Benchmarks For AMD Ryzen 9 5950X Performance"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-IRDMA-Replacement-5.14",
          "author": null,
          "description": "Intel has wrapped up a 3+ year effort to overhaul and replace its existing RDMA (Remote Direct Memory Access) driver. With Linux 5.14 is their shiny new \"IRDMA\" driver while their former driver is being immediately removed...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-IRDMA-Replacement-5.14",
          "publishedOn": "2021-07-02T10:16:40.000Z",
          "wordCount": 951,
          "title": "Intel Overhauls & Replaces Its RDMA Linux Driver"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=systemd-249-RC3",
          "author": null,
          "description": "Another release candidate of systemd 249 is available for testing while the actual release appears imminent...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=systemd-249-RC3",
          "publishedOn": "2021-07-02T09:52:08.000Z",
          "wordCount": 797,
          "title": "Systemd 249 Has Another Chance For Testing Before Release"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Steam-On-Linux-Tap-Dance-0.9",
          "author": null,
          "description": "Even with Steam Play continuing to get into quite good shape for running recent Windows game releases on Linux with ease thanks to the work Valve has been investing into Proton, DXVK, VKD3D-Proton, and lower-level Linux graphics infrastructure, for now at least the overall marketshare is holding steady at around 0.8~0.9% for the past number of months...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Steam-On-Linux-Tap-Dance-0.9",
          "publishedOn": "2021-07-02T09:39:06.000Z",
          "wordCount": 909,
          "title": "Steam On Linux Still Tap Dancing Around 0.9% Marketshare"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.14-ARM64",
          "author": null,
          "description": "The 64-bit ARM architecture changes were submitted this week for the ongoing Linux 5.14...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.14-ARM64",
          "publishedOn": "2021-07-02T09:22:02.000Z",
          "wordCount": 849,
          "title": "Linux 5.14 ARM64 Preps For When Not All The CPU Cores Support 32-bit Execution"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-DG2-Linux-Bring-Up",
          "author": null,
          "description": "Following recent reports Intel has begun seeding the Xe-HPG DG2 graphics card to developers and various reported leaks around the next-gen \"DG2\" graphics card, Intel's open-source Linux driver engineers have begun publishing patches for enabling the DG2 as well as the Xe_HP SDV...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-DG2-Linux-Bring-Up",
          "publishedOn": "2021-07-01T22:12:20.000Z",
          "wordCount": 856,
          "title": "Intel Begins Bringing Up DG2 Graphics Card, Xe_HP SDV Support For Linux"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.14-MIPS",
          "author": null,
          "description": "The MIPS code within the Linux kernel remains in a mature but rather stagnate state while the upstream MIPS architecture development has ceased and most vendors these days using Arm or RISC-V instead or even OpenPOWER prospects. But there still are some ongoing MIPS improvements to the Linux kernel...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.14-MIPS",
          "publishedOn": "2021-07-01T20:03:55.000Z",
          "wordCount": 852,
          "title": "Linux 5.14 Picks Up Support For A Tiny & Inexpensive MIPS IoT Single Board Computer"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-DG1-Nearly-At-Desktop",
          "author": null,
          "description": "Bringing up Intel discrete graphics on Linux especially when it comes to accelerated 3D rendering has been a very lengthy process for the DG1 graphics card enablement, but it may soon actually start working...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-DG1-Nearly-At-Desktop",
          "publishedOn": "2021-07-01T15:21:07.000Z",
          "wordCount": 1035,
          "title": "Intel Discrete Graphics On Linux Nearing The Point Of A Working, Accelerated Desktop"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=PHP-8.1-Alphas",
          "author": null,
          "description": "The PHP 8.1 alpha releases got underway in June in working towards the next annual feature release for the PHP scripting language...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=PHP-8.1-Alphas",
          "publishedOn": "2021-07-01T14:24:13.000Z",
          "wordCount": 944,
          "title": "PHP 8.1 Alpha Releases Get Underway With Enums, Fsync, Fibers, More Performance"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.14-RAS-EDAC",
          "author": null,
          "description": "The Linux 5.14 RAS (Reliability, Availability and Serviceability) and EDAC (Error Detection And Correction) changes have landed with several improvements this time around on the Intel side...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.14-RAS-EDAC",
          "publishedOn": "2021-07-01T13:00:12.000Z",
          "wordCount": 899,
          "title": "Linux 5.14 Lands Changes For On-Package HBM Xeons, More Intel CPUs With In-Band ECC"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=AFX-512-FP16-GCC-Patches",
          "author": null,
          "description": "Besides Sapphire Rapids introducing Advanced Matrix Extensions (AMX), new developer documentation has detailed AVX-512 FP16 capabilities coming with the next-generation Xeon processors. Intel has posted initial developer documentation around AVX512FP16 as well as a big set of GCC and LLVM Clang compiler patches for handling the new intrinsics...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=AFX-512-FP16-GCC-Patches",
          "publishedOn": "2021-07-01T11:08:58.000Z",
          "wordCount": 1012,
          "title": "Intel Posts Big Set of Patches For AVX-512 FP16 Compiler Support For Sapphire Rapids"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Clang-PGO-Linux-Shot-Down",
          "author": null,
          "description": "While Clang PGO support was sent in for Linux 5.14 as part of Clang compiler handling updates for this next kernel version, the functionality was subsequently dropped out and a new pull request issued after criticism from Linus Torvalds and others...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Clang-PGO-Linux-Shot-Down",
          "publishedOn": "2021-07-01T10:13:40.000Z",
          "wordCount": 880,
          "title": "Clang PGO Shot Down For Now From The Linux Kernel"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.14-DRM-Drivers",
          "author": null,
          "description": "The Direct Rendering Manager (kernel graphics/display driver) updates for Linux 5.14 are putting on the pounds with nearly 300k lines of new code added (312,187 insertions, 22,367 deletions). The big increase is driven by new AMD Radeon graphics support added, a new Microsoft driver added, and other changes...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.14-DRM-Drivers",
          "publishedOn": "2021-07-01T09:52:49.000Z",
          "wordCount": 900,
          "title": "Linux 5.14 GPU Driver Updates Come In Heavy With ~300k New Lines Of Code"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=June-2021-Highlights",
          "author": null,
          "description": "During this past month on Phoronix were 242 original Linux/open-source/hardware related news articles written by your's truly and another 18 featured Linux hardware reviews / featured benchmark articles. This month also marked Phoronix.com turning seventeen years old for delivering Linux hardware reviews and news...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=June-2021-Highlights",
          "publishedOn": "2021-07-01T00:30:00.000Z",
          "wordCount": 2719,
          "title": "Intel Crocus, Linux 5.13, Other Vendor Happenings Made For An Exciting June"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=CentOS-Hyperscale-Q2-2021",
          "author": null,
          "description": "One of the exciting initiatives taking place recently within the CentOS camp has been the CentOS Hyperscale special interest group that is backed by engineers from Twitter and Facebook along with other organizations. They've been making more progress on offering their hyperscaler-focused packages/updates and even onto publishing a CentOS Hyperscale Workstation operating system image for testing...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=CentOS-Hyperscale-Q2-2021",
          "publishedOn": "2021-06-30T19:16:19.000Z",
          "wordCount": 926,
          "title": "CentOS Hyperscale Workstation Sees Experimental OS Builds, More Changes Coming"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30304",
          "author": null,
          "description": "With the recent NVIDIA 470 series Linux driver beta this R470 branch is the point at which NVIDIA is ending its GeForce 600/700 series \"Kepler\" support. The 470 driver series will be maintained as a long-lived driver that will continue to see security updates and Linux kernel / X.Org Server compatibility updates for another three years. If this end-of-life status has you thinking about trying out the open-source \"Nouveau\" Linux driver with Kepler, here are some current benchmarks.",
          "link": "https://www.phoronix.com/vr.php?view=30304",
          "publishedOn": "2021-06-30T19:00:00.000Z",
          "wordCount": 1167,
          "title": "NVIDIA 470 EOL Drivers For Kepler Still Obliterating Open-Source Alternative"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-AMD-EDAC-HBM2-Aldebaran",
          "author": null,
          "description": "The latest public code patches on the mailing list today are preparing for newer AMD heterogeneous servers that will have Aldebaran GPU nodes connected via xGMI links to the CPU(s) and the GPU dies in turn having HBM2 memory...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-AMD-EDAC-HBM2-Aldebaran",
          "publishedOn": "2021-06-30T18:45:48.000Z",
          "wordCount": 1029,
          "title": "Linux Prepares For AMD Servers With Aldebaran GPU Nodes Sporting HBM2"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=XWayland-21.1.2-RC",
          "author": null,
          "description": "Michel Dänzer of Red Hat is preparing the release of XWayland 21.1.2 as the newest update to this standalone XWayland package separate from a whole X.Org Server release for running X11 clients within a Wayland environment...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=XWayland-21.1.2-RC",
          "publishedOn": "2021-06-30T16:21:39.000Z",
          "wordCount": 826,
          "title": "XWayland 21.1.2 Nears With NVIDIA Hardware Acceleration"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.14-HID",
          "author": null,
          "description": "The HID subsystem updates for Linux 5.14 continue improving consumer device support from newer AMD Ryzen laptops to multi-touch improvements...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.14-HID",
          "publishedOn": "2021-06-30T15:12:15.000Z",
          "wordCount": 961,
          "title": "Linux 5.14 Ready With Light Sensor + Human Presence Detection For Newer AMD Laptops"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Radeon-Pro-21.Q2-Linux-Driver",
          "author": null,
          "description": "AMD has issued their Radeon Pro Software for Enterprise 21.Q2 for Linux driver update as their quarterly packaged driver update intended for use with Radeon Pro graphics cards and former FirePro line-up...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Radeon-Pro-21.Q2-Linux-Driver",
          "publishedOn": "2021-06-30T14:18:59.000Z",
          "wordCount": 898,
          "title": "Radeon Pro Software for Enterprise 21.Q2 for Linux Driver Released"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.14-Networking",
          "author": null,
          "description": "Given the dominance of Linux-based devices from embedded/mobile (Android) through data centers and Linux powering all sorts of equipment, the networking subsystem updates for new Linux kernel merge windows continues to be very lively with new hardware support and never-ending improvements and new features...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.14-Networking",
          "publishedOn": "2021-06-30T11:15:00.000Z",
          "wordCount": 925,
          "title": "The Big Set Of Networking Changes For Linux 5.14"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-Media-Driver-2021Q2",
          "author": null,
          "description": "In preparing to close out the second quarter, the Intel Media Driver 2021Q2 was released today as the company's open-source stack for supporting GPU-accelerated video encode/decode on Linux...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-Media-Driver-2021Q2",
          "publishedOn": "2021-06-30T10:15:51.000Z",
          "wordCount": 755,
          "title": "Intel Media Driver 2021Q2 Focuses On Gen12 Enhancements"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.14-Power-Management",
          "author": null,
          "description": "Headlining the power management updates for the Linux 5.14 merge window is the Intel P-State CPU frequency scaling driver now being adapted to handle hybrid processors...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.14-Power-Management",
          "publishedOn": "2021-06-30T09:45:22.000Z",
          "wordCount": 823,
          "title": "Intel P-State Driver Ready To Take On Alder Lake Hybrid Processors"
        }
      ]
    }
  ],
  "cliVersion": "1.11.0"
}