{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": []
    },
    {
      "title": "GitLab",
      "feedUrl": "https://about.gitlab.com/atom.xml",
      "siteUrl": "https://about.gitlab.com/blog/",
      "articles": [
        {
          "id": "https://about.gitlab.com/blog/2021/08/20/how-grammatech-and-gitlab-enables-better-devsecops/",
          "author": null,
          "description": "Software development teams that embrace agile and DevSecOps are able to code with a security-first mindset, which is essential for industries that build particularly complicated products where security is paramount, like: Aerospace and defense, automotive, industrial controls, medical devices, and more.\nStatic application security testing (SAST) solutions, like CodeSonar® from GrammaTech, integrate directly into CI/CD pipelines to bake security into every step of the software development life cycle (SDLC) – protecting your products every step of the way. Security solutions like GrammaTech pair well with an all-in-one DevOps Platform like GitLab, and allow development teams to follow best practices and industry standards to develop code that is better quality and more secure.\nThe GrammaTech…",
          "link": "https://about.gitlab.com/blog/2021/08/20/how-grammatech-and-gitlab-enables-better-devsecops/",
          "publishedOn": "2021-08-20T00:00:00.000Z",
          "wordCount": 2606,
          "title": "How a new integration helps GitLab customers secure their code"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/08/19/introducing-spamcheck-data-driven-anti-abuse/",
          "author": null,
          "description": "Spam and abuse are a very real concern for us at GitLab – and likely every company providing services at scale. That's why our Trust and Safety team works hard every day to detect, mitigate, and lessen the effects of spam. Back in October 2020, the GitLab Security team detailed some of the ways they combat spam and abuse and referenced new approaches we were developing and testing to help us better detect and prevent spam.\nWe're excited to introduce Spamcheck, our new anti-spam engine. Spamcheck has been enabled for all projects on GitLab.com, which runs 14.1, and will be included in the 14.2 release for GitLab self-managed coming on August 22.\nThis tool was designed, tested and integrated by our GitLab Security Automation team (with amazing partnership from our Trust and Safety team and o…",
          "link": "https://about.gitlab.com/blog/2021/08/19/introducing-spamcheck-data-driven-anti-abuse/",
          "publishedOn": "2021-08-19T00:00:00.000Z",
          "wordCount": 3131,
          "title": "Introducing Spamcheck: A data-driven, anti-abuse engine"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/08/18/what-the-solarwinds-attack-can-teach-us-about-devsecops/",
          "author": null,
          "description": "One of the cybersecurity keywords for 2021 will undoubtedly be \"software supply chain attacks\". For decades, we've seen a global move toward connected systems and highly complex supply chains. Today these supply chains are under attack, with malicious actors jeopardizing the sensitive data of millions of users through attacks on the public and private sectors.\nAfter public and federal entities were targeted in some high-profile supply chain attacks, the United States government released an executive order with plans to improve the security posture of the nation when it comes to software supply chains. The UK issued a similar call for views on cybersecurity in supply chains around the same time.\nSupply chain security became a global priority after the SolarWinds attack, reminding businesses…",
          "link": "https://about.gitlab.com/blog/2021/08/18/what-the-solarwinds-attack-can-teach-us-about-devsecops/",
          "publishedOn": "2021-08-18T00:00:00.000Z",
          "wordCount": 2920,
          "title": "How DevSecOps can protect businesses from future supply chain attacks"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/08/17/100-runners-in-less-than-10mins-and-less-than-10-clicks/",
          "author": null,
          "description": "Managing elastically scaled or highly available compute infrastructures is one of the key challenges the cloud was built for. Application scaling concerns can be handled by cloud services that are purpose designed, rigorously tested, and continually improved. This article dives into some specific enablement automation that brings the benefits of AWS Autoscaling Groups (ASG) to runner management. There are benefits to both the largest fleets and single instance runners.\nEmbedded in this article is a YouTube video that demonstrates the deployment of 100 GitLab runners on Amazon EC2 Spot compute in less than 10 minutes using less than 10 clicks. The video also shows updating this entire fleet in under 10 minutes to emphasize the time savings of built-in maintenace.\nThe information and automat…",
          "link": "https://about.gitlab.com/blog/2021/08/17/100-runners-in-less-than-10mins-and-less-than-10-clicks/",
          "publishedOn": "2021-08-17T00:00:00.000Z",
          "wordCount": 5291,
          "title": "How to provision 100 AWS Graviton GitLab Spot Runners in 10 Minutes for $2/hour"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/08/17/gitlab-14-1-3-released/",
          "author": null,
          "description": "Today we are releasing version 14.1.3 for GitLab Community Edition and Enterprise Edition.\nThis version resolves a number of regressions and bugs in\nlast month's 14.1 release and\nprior versions.\nGitLab Community Edition and Enterprise Edition\nAS Fix SAML SSO login redirects not working\nBump kas to v14.1.1\nResolve operator does not exist: integer[] || bigint in app/models/namespace/traversal_hierarchy.rb\nGeo 2.0 Regression - Add ability to remove primary\nAdd AES256-GCM-SHA384 to allowed list of Nginx SSL ciphers\nImportant notes on upgrading\nThis version does not include any new migrations, and for multi-node deployments, should not require any downtime.\nPlease be aware that by default the Omnibus packages will stop, run migrations,\nand start again, no matter how “big” or “small” the upgrade is. This behavior\ncan be changed by adding a /etc/gitlab/skip-auto-reconfigure file,\nwhich is only used for updates.\nUpdating\nTo update, check out our update page.\nGitLab subscriptions\nAccess to GitLab Premium and Ultimate features is granted by a paid subscription.\nAlternatively, sign up for GitLab.com\nto use GitLab's own infrastructure.",
          "link": "https://about.gitlab.com/releases/2021/08/17/gitlab-14-1-3-released/",
          "publishedOn": "2021-08-17T00:00:00.000Z",
          "wordCount": 1010,
          "title": "GitLab Patch Release: 14.1.3"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/08/13/understand-highly-technical-spaces/",
          "author": null,
          "description": "As a designer, you're lucky when you get to design an application you're familiar with, such as a supermarket app or a travel website – something we might have already used or even use every day. Most of the time, we are tasked with designing an application or technology that's unfamiliar or highly technical. Sometimes, we may not know what the application we're designing is used for, like creating an interface for an MRI machine controlled by a doctor, or a dashboard used by a professional musician – knowing what all the buttons do is already an achievement.\nOne of the trickiest questions for designers is understanding exactly how much you need to know how to use an application to design the best system for the user. This conundrum is typical for designers that work in a highly technical,…",
          "link": "https://about.gitlab.com/blog/2021/08/13/understand-highly-technical-spaces/",
          "publishedOn": "2021-08-13T00:00:00.000Z",
          "wordCount": 2581,
          "title": "How I use analogy to design for highly technical spaces"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/08/13/five-great-phabricator-features-inspired-gitlab/",
          "author": null,
          "description": "Innovation often happens because competition sparks new ideas. We unpack how Phabricator inspired GitLab to add new features.\nTurning back time a bit, what exactly is Phabricator? Built on the concept of web-based applications, Phabricator enables developers to collaborate with code reviews, repository browser, change monitoring, bug tracking and wiki. On May 29, 2021, Phacility, the maintainer and sponsor of Phabricator announced end-of-life and stopped maintaining Phabricator.\nGitLab co-founder and CEO, Sid Sijbrandij gives credit to Phabricator on HackerNews:\nPhabricator was an inspiration to me when starting GitLab. It is shutting down now. Many of its features were years ahead of its time and there was a lot of humor in the product. As a tribute to it shall we add Clowcoptarize as a w…",
          "link": "https://about.gitlab.com/blog/2021/08/13/five-great-phabricator-features-inspired-gitlab/",
          "publishedOn": "2021-08-13T00:00:00.000Z",
          "wordCount": 4052,
          "title": "5 Great Phabricator features that inspired GitLab"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/08/10/how-to-agentless-gitops-aws/",
          "author": null,
          "description": "In part two of our GitOps series, we described how to use a push-based (or agentless) approach for GitOps by using GitLab scripting capabilities as well as integrating infrastructure-as-code tools into GitOps pipelines. In this third blog post, we’ll also dig deep into how to use a push-based approach, but this time our focus will be on the integrations of Terraform, AWS ECS, and AWS EC2 in GitOps flows. This approach may be preferable when using infrastructure components that aren't Kubernetes, such as VMs, physical devices, and cloud-provider services.\nSimilar to Ansible – an agentless IT automation solution – Terraform can be leveraged by the scripting capabilities of GitLab to shape your infrastructure. GitLab also provides out-of-the-box integrations with Terraform, such as GitLab-man…",
          "link": "https://about.gitlab.com/blog/2021/08/10/how-to-agentless-gitops-aws/",
          "publishedOn": "2021-08-10T00:00:00.000Z",
          "wordCount": 3924,
          "title": "How to use a push-based approach for GitOps with Terraform and AWS ECS and EC2"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/08/10/gitlab-13-12-10-released/",
          "author": null,
          "description": "Today we are releasing version 13.12.10 for GitLab Community Edition and Enterprise Edition.\nThis version resolves a number of regressions and bugs in\nMay's 13.12 release and\nprior versions.\nGitLab Community Edition and Enterprise Edition\nAvailable in GitLab Free, Premium, and Ultimate:\nFix: Sidekiq workers delete each other's metrics\nDo not create audit event for failed logins on read-only DB\nFix validation method regarding MIME type keys\nResolve \"operator does not exist\" in app/models/namespace/traversal_hierarchy.rb\ngitlab-rails: checks/postgresql detect silent NoDatabaseError\nAdding -ubi8 to version to find UBI images\nImportant notes on upgrading\nThis version does not include any new migrations, and for multi-node deployments, should not require any downtime.\nPlease be aware that by default the Omnibus packages will stop, run migrations,\nand start again, no matter how “big” or “small” the upgrade is. This behavior\ncan be changed by adding a /etc/gitlab/skip-auto-reconfigure file,\nwhich is only used for updates.\nUpdating\nTo update, check out our update page.\nGitLab subscriptions\nAccess to GitLab Premium and Ultimate features is granted by a paid subscription.\nAlternatively, sign up for GitLab.com\nto use GitLab's own infrastructure.",
          "link": "https://about.gitlab.com/releases/2021/08/10/gitlab-13-12-10-released/",
          "publishedOn": "2021-08-10T00:00:00.000Z",
          "wordCount": 1030,
          "title": "GitLab Patch Release: 13.12.10"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/08/09/five-ways-to-scale-remote-work/",
          "author": null,
          "description": "At GitLab, we believe that remote work at scale will define not only the future of work, but the future of living. We created REMOTE by GitLab to bring together the remote work community and answer the questions many companies are asking: \"How do we do this, and what's next?\"\nWe heard from some of the top leaders in remote work, from large companies that made the decision to leave the office behind, to teams of experts who have been studying the organizational design for years.\nWe share five lessons from the REMOTE by GitLab event that your team can apply to uplevel your remote practices and culture.\nSet guiding principles for your remote transition (and stick to them)\nAs you navigate the changes that come with implementing remote-first practices, it's important to have a set of values and…",
          "link": "https://about.gitlab.com/blog/2021/08/09/five-ways-to-scale-remote-work/",
          "publishedOn": "2021-08-09T00:00:00.000Z",
          "wordCount": 2136,
          "title": "5 Ways to scale remote work on your team"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/08/05/achieving-23-cost-savings-and-36-performance-gain-using-gitlab-and-gitlab-runner-on-arm-neoverse-based-aws-graviton2-processor/",
          "author": null,
          "description": "Companies in all industries and sectors have significantly invested in digital transformation and increased their software development capabilities. GitLab delivers modern DevOps with a complete DevOps platform. However, some organizations require self-managed GitLab and GitLab Runners, which creates added costs for hosting and running GitLab infrastructure. Our latest cost analysis and performance benchmarks show that customers can realize cost savings of up to 23% and performance gains of up to 36% by deploying the GitLab application and GitLab Runner on the Arm-based Graviton2 when compared to the x86 based M5/C5 EC2 instances.\nArm is a leading provider of silicon intellectual property (IP) for intelligent systems-on-chip (SoC) that power billions of devices. GitLab and Arm have collabo…",
          "link": "https://about.gitlab.com/blog/2021/08/05/achieving-23-cost-savings-and-36-performance-gain-using-gitlab-and-gitlab-runner-on-arm-neoverse-based-aws-graviton2-processor/",
          "publishedOn": "2021-08-05T00:00:00.000Z",
          "wordCount": 2451,
          "title": "23% Cost savings and 36% performance gain by deploying GitLab on Arm-based AWS Graviton2"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/08/04/ubs-gitlab-devops-platform/",
          "author": null,
          "description": "UBS, the largest truly global wealth manager, uses GitLab to power DevCloud, a single DevOps Platform that allows for a cloud-based, service-oriented, software development lifecycle.\n\"GitLab is a fundamental part of DevCloud,\" said Rick Carey, Group Chief Technology Officer at UBS. \"We wouldn't be able to have that seamless experience without GitLab. It allowed us to pull ahead of many of our competitors, and break down the barriers between coding, testing, and deployment.\"\nDuring GitLab Virtual Commit 2021, Rick and Eric Johnson, Chief Technology Officer at GitLab, talked about how building DevCloud on GitLab's DevOps Platform allowed UBS to increase their development velocity, lower their infrastructure costs, and increase collaboration between engineers and non-engineering teams worldwi…",
          "link": "https://about.gitlab.com/blog/2021/08/04/ubs-gitlab-devops-platform/",
          "publishedOn": "2021-08-04T00:00:00.000Z",
          "wordCount": 2323,
          "title": "How UBS created their own open DevOps Platform using GitLab"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/08/03/welcome-to-the-devops-platform-era/",
          "author": null,
          "description": "DevOps has evolved since its infancy, over a decade ago. Swiss developmental psychologist Jean Piaget believed human cognitive development has four stages (sensorimotor, preoperational, concrete operational, and formal operational). Through each of these stages, the human mind obtains new knowledge while building and modifying memories to inform one's understanding of the world around them.\nIn the same way that people go through stages as they grow, markets and industries also go through stages of development. Over the years, DevOps has grown into a mature, business-critical practice.\nAs the DevOps industry expanded, so did the number and complexity of tool-project integrations within an organization. This was the result of three developments in DevOps:\nCompanies moved from monolithic arch…",
          "link": "https://about.gitlab.com/blog/2021/08/03/welcome-to-the-devops-platform-era/",
          "publishedOn": "2021-08-03T00:00:00.000Z",
          "wordCount": 2914,
          "title": "Welcome to the DevOps Platform era"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/08/03/security-release-gitlab-14-1-2-released/",
          "author": null,
          "description": "Today we are releasing versions 14.1.2, 14.0.7, and 13.12.9 for GitLab Community Edition (CE) and Enterprise Edition (EE).\nThese versions contain important security fixes, and we strongly recommend that all GitLab installations be upgraded to one of these versions immediately.\nGitLab releases patches for vulnerabilities in dedicated security releases. There are two types of security releases: a monthly, scheduled security release, released a week after the feature release (which deploys on the 22nd of each month), and ad-hoc security releases for critical vulnerabilities. For more information, you can visit our security FAQ. You can see all of our regular and security release blog posts here. In addition, the issues detailing each vulnerability are made public on our issue tracker 30 days …",
          "link": "https://about.gitlab.com/releases/2021/08/03/security-release-gitlab-14-1-2-released/",
          "publishedOn": "2021-08-03T00:00:00.000Z",
          "wordCount": 2630,
          "title": "GitLab Security Release: 14.1.2, 14.0.7, and 13.12.9"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/07/29/velocity-with-confidence/",
          "author": null,
          "description": "How DevOps and NFS changed the game\nWhat if I told you that one of the best-selling racing video game franchises of all time, the \"Need For Speed\" (NFS), and DevOps have more in common with each other than you think? Yes, you read that correctly, probably not the NFS (Network File System) you were expecting.\nAn appetite for change\nFor context, the NFS series originally set out to redefine a saturated, yet unsophisticated, racing video game market. Motivated by an appetite for change, the NFS user experience reflected the human connection to real cars and how they behaved, which was a big challenge for developers in the 1990s. Nearly 30 years ago, \"The Need for Speed\" forever changed the landscape of racing games, selling 150 million copies since its debut.\n\nThe original Need For Speed vide…",
          "link": "https://about.gitlab.com/blog/2021/07/29/velocity-with-confidence/",
          "publishedOn": "2021-07-29T00:00:00.000Z",
          "wordCount": 3046,
          "title": "How GitLab 14 satisfies the need for speed with modern DevOps"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/07/29/how-orange-uses-gitlab-ci-cd-for-modern-devops/",
          "author": null,
          "description": "CI/CD is a foundational piece to modern software development. It's a major brick in the DevOps \"Automation\" pillar and every company involved in IT has to implement CI/CD or they're already quite far behind the curve.\nBut implementing CI/CD can be challenging especially for growing or large companies. Some of those challenges include:\nDevOps expertise and technical skills\nDevSecOps\nStandardization\nThree key hurdles that come with implementing CI/CD\nThis blog post unpackes these challenges and explains how Orange overcame them using GitLab.\nDevOps and technical skills\nNo matter which CI/CD tool you're using, it requires some amount of expertise to implement it right.\nDevOps expertise is important because your team needs some experience with Git workflows, deployment, environments, secrets m…",
          "link": "https://about.gitlab.com/blog/2021/07/29/how-orange-uses-gitlab-ci-cd-for-modern-devops/",
          "publishedOn": "2021-07-29T00:00:00.000Z",
          "wordCount": 3801,
          "title": "How Orange made a first step toward CI/CD standardization with GitLab"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/07/28/secure-container-images-with-gitlab-and-grype/",
          "author": null,
          "description": "The importance of container image security\nThanks to containers, what it means to \"ship software\" has changed dramatically. Engineering teams have shifted to produce container images and use these container images to deploy their software. Because of this change teams are now shipping significantly more software alongside their app – whether they realize it or not.\nBesides packaging an application, container images also include hundreds of binaries and libraries. These binaries and libraries are included in the container image produced by the team because the process of creating a container image requires teams to select a base image. A base image is a preexisting container image on which to \"base\" their own container image. In doing so, all software contained in the base image is inherite…",
          "link": "https://about.gitlab.com/blog/2021/07/28/secure-container-images-with-gitlab-and-grype/",
          "publishedOn": "2021-07-28T00:00:00.000Z",
          "wordCount": 2220,
          "title": "How to secure your container images with GitLab and Grype"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/07/28/gitlab-14-1-1-released/",
          "author": null,
          "description": "Today we are releasing version 14.1.1 for GitLab Community Edition and Enterprise Edition.\nThis version resolves a number of regressions and bugs in\nthis month's 14.1 release and\nprior versions.\nGitLab Community Edition and Enterprise Edition\nAvailable in GitLab Free, Premium, and Ultimate:\nExtend RackAttack basic authentication detection for rate limiting\nEnable bulk dismissal checkboxes on group vulnerability report\"\nFix syntax highlighting inline background on darkmode\nFix: Sidekiq workers delete each other's metrics\nPrevent terms from being created if blank\nRemove backfill migration for ci_build_trace_sections\nGeo: Fix snippet verification by replicating the HEAD ref\nRemove securityScansSucceeded from DevOps adoption\nFix markdown in development docs\nFix deployer task\nDon't ask users to upgrade to PG 13 yet\nImportant notes on upgrading\nThis version does not include any new migrations, and for multi-node deployments, should not require any downtime.\nPlease be aware that by default the Omnibus packages will stop, run migrations,\nand start again, no matter how “big” or “small” the upgrade is. This behavior\ncan be changed by adding a /etc/gitlab/skip-auto-reconfigure file,\nwhich is only used for updates.\nUpdating\nTo update, check out our update page.\nGitLab subscriptions\nAccess to GitLab Premium and Ultimate features is granted by a paid subscription.\nAlternatively, sign up for GitLab.com\nto use GitLab's own infrastructure.",
          "link": "https://about.gitlab.com/releases/2021/07/28/gitlab-14-1-1-released/",
          "publishedOn": "2021-07-28T00:00:00.000Z",
          "wordCount": 1064,
          "title": "GitLab Patch Release: 14.1.1"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/07/26/gitlab-helm-package-registry/",
          "author": null,
          "description": "Cloud native application architectures use containerization, microservices, and Kubernetes to run reliably at cloud-scale. With a built-in container registry and Kubernetes integration, GitLab is the best way to develop and deploy cloud native applications. GitLab version 14.1 also includes a Helm registry, which allows users to publish, install, and share Helm charts and packages from within our single application for the entire DevOps lifecycle.\nWhat is Helm?\nHelm is a package manager for Kubernetes. A Chart is a Helm package that contains the resource definitions required to run an application inside a Kubernetes cluster. Helm allows you to manage complex applications by storing the application definition in a chart that can be versioned, shared, and collaborated on.\nThe differences bet…",
          "link": "https://about.gitlab.com/blog/2021/07/26/gitlab-helm-package-registry/",
          "publishedOn": "2021-07-26T00:00:00.000Z",
          "wordCount": 1917,
          "title": "Introducing the GitLab Helm Package Registry"
        }
      ]
    },
    {
      "title": "Phoronix",
      "feedUrl": "https://www.phoronix.com/rss.php",
      "siteUrl": "https://www.phoronix.com/",
      "articles": [
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Hotplug-Notify-DP-Over-Type-C",
          "author": null,
          "description": "Red Hat's Hans de Goede continues doing a commendable job improving the Linux support for various laptops with key improvements. One of the latest efforts by this longtime kernel developer has been about getting DisplayPort over USB Type-C connections working for more Intel hardware...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Hotplug-Notify-DP-Over-Type-C",
          "publishedOn": "2021-08-21T12:51:23.000Z",
          "wordCount": 839,
          "title": "Patches Ready For Getting DisplayPort Over USB Type-C Working For More Intel Hardware"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-CET-v29",
          "author": null,
          "description": "While Intel is normally very punctual in providing support for major new CPU features under Linux and often landing them well in advance of general hardware availability, their work around Control-flow Enforcement Technology (CET) has taken a long longer than normal and is still going through new rounds of code review to get accepted into the mainline Linux kernel...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-CET-v29",
          "publishedOn": "2021-08-21T10:40:34.000Z",
          "wordCount": 850,
          "title": "Another Round Of Intel CET Patches, Still Working Toward Linux Kernel Integration"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=NAX-LSM-Module",
          "author": null,
          "description": "Due to the growing threat posed by file-less malware attacks where malware code is executed from anonymous executable memory pages that aren't backed by data on the file-system, the \"NAX\" Linux security module has been seeing work recently for helping to protect against such scenarios...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=NAX-LSM-Module",
          "publishedOn": "2021-08-21T10:04:49.000Z",
          "wordCount": 734,
          "title": "\"NAX\" Linux Security Being Worked On For Helping Fend Off Fileless Malware Attacks"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=KDE-New-Overview-Effect",
          "author": null,
          "description": "It's been another busy week in KDE land with the seemingly never ending improvements to the Plasma Wayland session as well as introducing some new features like a new Overview Effect...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=KDE-New-Overview-Effect",
          "publishedOn": "2021-08-21T09:45:01.000Z",
          "wordCount": 888,
          "title": "KDE Plasma Introduces A New Overview Effect, Many Wayland Fixes"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Proton-6.3-6-Released",
          "author": null,
          "description": "It's been nearly two months since Proton 6.3-5 released for powering Valve's Steam Play for enjoying Windows games on Linux. The latest Proton update was just released with many improvements...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Proton-6.3-6-Released",
          "publishedOn": "2021-08-20T23:39:00.000Z",
          "wordCount": 841,
          "title": "Proton 6.3-6 Released With More Games Running, Optional NVIDIA DLSS Support"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-SEV-SNP-v5",
          "author": null,
          "description": "AMD has published their fifth revision of SEV-SNP support for the KVM hypervisor and guest VM support for this Secure Encrypted Virtualization Secure Nested Paging functionality found with new EPYC 7003 series server processors...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-SEV-SNP-v5",
          "publishedOn": "2021-08-20T19:00:00.000Z",
          "wordCount": 1163,
          "title": "AMD Publishes Latest SEV-SNP Guest + Hypervisor Support For Linux"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=OpenSSH-8.7",
          "author": null,
          "description": "OpenSSH 8.7 is out today as the newest feature release for this widely-used SSH server/client software...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=OpenSSH-8.7",
          "publishedOn": "2021-08-20T17:12:25.000Z",
          "wordCount": 814,
          "title": "OpenSSH 8.7 Released With Experimental SFTP Support For SCP"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-Infinity-Hub",
          "author": null,
          "description": "AMD has launched the Infinity Hub as their newest open-source software portal around HPC software via easy-to-deploy Docker containers...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-Infinity-Hub",
          "publishedOn": "2021-08-20T16:33:37.000Z",
          "wordCount": 890,
          "title": "AMD Launches The Infinity Hub As Its Newest Open-Source Portal"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30472",
          "author": null,
          "description": "Earlier this week Amazon introduced Intel Xeon Scalable 3rd Gen \"Ice Lake\" powered EC2 cloud instances and marks their first x86-based sixth-generation offerings that follow their \"M6g\" Graviton2 instances launched last year. Curious about the \"M6i\" Ice Lake performance with AWS, here are a number of benchmarks looking at the performance and value of the new M6i instances compared to former Intel M5 instances as well as Amazon's own M6g Graviton2 instances.",
          "link": "https://www.phoronix.com/vr.php?view=30472",
          "publishedOn": "2021-08-20T13:00:00.000Z",
          "wordCount": 1236,
          "title": "Amazon EC2 M6i Performance For Intel Ice Lake In The Cloud"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=GNOME-Magnifier-Double-Paint",
          "author": null,
          "description": "Canonical's Daniel Van Vugt continues working on some important performance fixes for the GNOME desktop...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=GNOME-Magnifier-Double-Paint",
          "publishedOn": "2021-08-20T09:39:14.000Z",
          "wordCount": 770,
          "title": "GNOME's Magnifier Will Now Avoid Double Painting The Desktop"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Raspberry-Pi-4K60-v7",
          "author": null,
          "description": "Work continues on getting the Broadcom VC4 kernel Direct Rendering Manager (DRM) driver into shape for being able to support 4K display outputs at 60Hz...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Raspberry-Pi-4K60-v7",
          "publishedOn": "2021-08-20T07:00:00.000Z",
          "wordCount": 793,
          "title": "Raspberry Pi Display Driver Patches Updated For 4K@60Hz Support"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-Linux-Skip-C3-Cache-Flush",
          "author": null,
          "description": "A minor optimization was posted by an AMD engineer on Wednesday for the Linux kernel...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-Linux-Skip-C3-Cache-Flush",
          "publishedOn": "2021-08-20T05:00:00.000Z",
          "wordCount": 856,
          "title": "AMD To Optimize C3 Entry On Linux By Finally Skipping The Cache Flush"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=SixtyFPS-0.1-Rust-Toolkit",
          "author": null,
          "description": "For passionate Phoronix readers around the Rust programming language, SixtyFPS is a new graphical toolkit offering focused on Rust but also supporting C++ and JavaScript...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=SixtyFPS-0.1-Rust-Toolkit",
          "publishedOn": "2021-08-20T04:00:00.000Z",
          "wordCount": 760,
          "title": "SixtyFPS 0.1 Released As A Rust-Focused Graphical Toolkit"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Nftables-1.0",
          "author": null,
          "description": "The Netfilter project has announced the release of Nftables 1.0.0 for their user-space code for interfacing with the Linux kernel's Nftables subsystem for network filtering and classification...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Nftables-1.0",
          "publishedOn": "2021-08-19T22:17:19.000Z",
          "wordCount": 725,
          "title": "Netfilter Releases Nftables 1.0"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-21.2.1-Released",
          "author": null,
          "description": "For those that prefer to hold off on upgrading to a new Mesa stable release series until the first point release is out, Mesa 21.2.1 is now available as the first update to this quarter's Mesa 21.2 series...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-21.2.1-Released",
          "publishedOn": "2021-08-19T19:10:35.000Z",
          "wordCount": 859,
          "title": "Mesa 21.2.1 Released With \"Nice Changes For Almost Everyone\""
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Apple-Patents-W3C-OSP",
          "author": null,
          "description": "The W3C has been working on the \"Open Screen Protocol\" as part of their Second Screen Working Group. This effort has been about having a web standard so web pages can drive secondary screens to display web content. Unfortunately, the plans are currently being complicated by a number of software patents issued to Apple...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Apple-Patents-W3C-OSP",
          "publishedOn": "2021-08-19T18:16:08.000Z",
          "wordCount": 1064,
          "title": "Apple Patents Complicating W3C's Open Screen Protocol"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30468",
          "author": null,
          "description": "Intel this week hosted a virtual Architecture Day where they talked up their latest efforts from Alder Lake and Sapphire Rapids to their next-generation discrete graphics capabilities as well as other new offerings around IPUs and more. Here are the highlights from Intel Architecture Day 2021 and with a particular focus from our Linux angle.",
          "link": "https://www.phoronix.com/vr.php?view=30468",
          "publishedOn": "2021-08-19T13:00:01.000Z",
          "wordCount": 1028,
          "title": "Intel Architecture Day 2021 & The Linux State"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-Ubuntu-Industrial-Pi-DFI",
          "author": null,
          "description": "Many will recall DFI motherboards from close to two decades ago for their wildly colored \"LANParty\" motherboards but in recent years the company has been focusing on IoT and industrial hardware where, of course, Linux has much relevance. DFI and Canonical today announced an AMD-powered Ubuntu-loaded \"industrial Pi\" single board computer...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-Ubuntu-Industrial-Pi-DFI",
          "publishedOn": "2021-08-19T11:55:17.000Z",
          "wordCount": 838,
          "title": "Canonical + DFI Pair Up For An \"Industrial Pi\" Powered By AMD & Ubuntu"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=LibreOffice-7.2-Community",
          "author": null,
          "description": "LibreOffice 7.2 Community is out today as the newest version of this widely-used, open-source, cross-platform office suite...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=LibreOffice-7.2-Community",
          "publishedOn": "2021-08-19T11:00:00.000Z",
          "wordCount": 733,
          "title": "LibreOffice 7.2 Community Released For This Leading Open-Source Office Suite"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Ubuntu-21.10-With-GNOME-40",
          "author": null,
          "description": "While Ubuntu normally ships with the very latest GNOME desktop version issued just before release time, with Ubuntu 21.04 they stuck to GNOME 3.38 rather than punting early to GNOME 40. In the Ubuntu 21.10 development packages they since migrated to GNOME 40 but now it looks like they will be sticking to that and not pulling ahead to the near-final GNOME 41...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Ubuntu-21.10-With-GNOME-40",
          "publishedOn": "2021-08-19T09:39:16.000Z",
          "wordCount": 854,
          "title": "Ubuntu 21.10 Likely Sticking To The GNOME 40 Desktop"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=SDL2-Render-Geometry",
          "author": null,
          "description": "While not making it for last week's SDL 2.0.16 release, merged on Wednesday to the SDL2 development code is an \"SDL_GeometryRender\" interface that stems from feature requests going back nearly a decade for this graphics API independent triangle rendering API...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=SDL2-Render-Geometry",
          "publishedOn": "2021-08-19T07:00:00.000Z",
          "wordCount": 851,
          "title": "SDL2 Lands Long-Sought Geometry Render API"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=ASUS-WMI-Custom-Fan-Curves",
          "author": null,
          "description": "Independent developer Luke Jones continues making good progress on improving the \"ASUS-WMI\" driver for better ASUS laptop support on Linux...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=ASUS-WMI-Custom-Fan-Curves",
          "publishedOn": "2021-08-19T04:00:00.000Z",
          "wordCount": 800,
          "title": "Custom CPU/GPU Fan Curve Support For Some ASUS Laptops On Linux"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=MATE-1.26-Desktop",
          "author": null,
          "description": "After one and a half years in development of MATE 1.26 as a fork of the GNOME 2 desktop components, this release is now available with initial Wayland support and more...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=MATE-1.26-Desktop",
          "publishedOn": "2021-08-18T23:11:23.000Z",
          "wordCount": 747,
          "title": "MATE 1.26 Desktop Released With Some Wayland Support, Other Improvements"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-DisplayPort-2.0-Linux",
          "author": null,
          "description": "It looks like 2022 is when we will start seeing DisplayPort 2.0 hardware broadly available... It was just earlier this week I wrote about AMD working on DisplayPort 2.0 for their open-source Radeon Linux driver and now coincidentally today Intel has begun their open-source Linux graphics driver enablement for DP 2.0...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-DisplayPort-2.0-Linux",
          "publishedOn": "2021-08-18T18:30:00.000Z",
          "wordCount": 920,
          "title": "Intel Posts Linux Patches Bringing Up DisplayPort 2.0 - DG2 Alchemist To Support DP 2.0"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Vulkan-SC-1.0-Coming",
          "author": null,
          "description": "It's been over two years since The Khronos Group acknowledged they were working on safety critical Vulkan and now finally the 1.0 release is approaching for this graphics/compute interface suitable for safety critical systems...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Vulkan-SC-1.0-Coming",
          "publishedOn": "2021-08-18T17:55:24.000Z",
          "wordCount": 939,
          "title": "Vulkan SC 1.0 Coming For \"Safety Critical\" Graphics / Compute"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Krita-5.0-Beta",
          "author": null,
          "description": "Krita 5.0 is on the way as the next major feature release to this popular, open-source digital painting program...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Krita-5.0-Beta",
          "publishedOn": "2021-08-18T17:37:52.000Z",
          "wordCount": 711,
          "title": "Krita 5.0 Beta Released With Better Performance, UI Polishing"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30463",
          "author": null,
          "description": "This past weekend marked the release of Debian 11 \"Bullseye\" as the newest version of this major Linux distribution that is also the basis for many others. Given the popularity of Debian stable on servers, our first round of Debian 11.0 benchmarking is looking at the performance relative to Debian 10.10 on latest-generation Intel Xeon \"Ice Lake\" and AMD EPYC \"Milan\" hardware.",
          "link": "https://www.phoronix.com/vr.php?view=30463",
          "publishedOn": "2021-08-18T12:35:35.000Z",
          "wordCount": 820,
          "title": "Debian 11 Performance Uplift Is Looking Great For Intel Xeon, AMD EPYC"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-x86-64-Micro-Feature-Lvl",
          "author": null,
          "description": "A set of two patches posted this week would allow the Linux kernel to be easily built with the different x86-64 micro-architecture feature levels supported by the latest LLVM Clang and GCC compilers...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-x86-64-Micro-Feature-Lvl",
          "publishedOn": "2021-08-18T10:00:00.000Z",
          "wordCount": 835,
          "title": "Proposed: Allow Building The Linux Kernel With x86-64 Microarchitecture Feature Levels"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=PREEMPT-RT-Sched-Core",
          "author": null,
          "description": "Six dozen patches working on the PREEMPT-RT locking infrastructure for real-time kernels is now queued up in TIP's \"locking/core\" branch and will presumably be sent in for the Linux 5.15 merge window coming up quickly...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=PREEMPT-RT-Sched-Core",
          "publishedOn": "2021-08-18T09:42:51.000Z",
          "wordCount": 804,
          "title": "PREEMPT-RT Locking Infrastructure Possibly Ready For Linux 5.15"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Zink-Compatibility-Ctx",
          "author": null,
          "description": "In addition to Tuesday seeing the Zink sub-allocator merged for sharply improving the performance of this OpenGL-on-Vulkan implementation within Mesa, the Zink Gallium3D code subsequently merged support for OpenGL compatibility contexts...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Zink-Compatibility-Ctx",
          "publishedOn": "2021-08-18T04:00:00.000Z",
          "wordCount": 839,
          "title": "Zink Now Supports OpenGL Compatibility Contexts - Allowing More Games/Apps To Work"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Maple-Tree-v2",
          "author": null,
          "description": "Sent out last year was a \"request for comments\" on \"Maple Tree\" as a new data structure for the Linux kernel. The latest version of the Maple Tree patches were sent out today with mixed results but for where gains are being made they can be quite significant...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Maple-Tree-v2",
          "publishedOn": "2021-08-17T22:52:16.000Z",
          "wordCount": 904,
          "title": "Maple Tree v2 Patches For The Linux Kernel - 13~840% Faster For Malloc Threads Test Case"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Zink-Suballocator-Merged",
          "author": null,
          "description": "Mesa's Zink Gallium3D code for implementing OpenGL-over-Vulkan can now run a heck of a lot faster with the newest Mesa 21.3 code...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Zink-Suballocator-Merged",
          "publishedOn": "2021-08-17T18:42:46.000Z",
          "wordCount": 824,
          "title": "Zink Suballocator Lands In Mesa - \"Over 1000%\" Performance Increase For Some Games"
        }
      ]
    }
  ],
  "cliVersion": "1.11.0"
}