{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": []
    },
    {
      "title": "GitLab",
      "feedUrl": "https://about.gitlab.com/atom.xml",
      "siteUrl": "https://about.gitlab.com/blog/",
      "articles": [
        {
          "id": "https://about.gitlab.com/blog/2021/09/15/qpage-on-the-devops-platform/",
          "author": null,
          "description": "Deployment automation is essential for any company involved in software development to stay competitive. QPage, a company that provides an end-to-end sourcing and recruitment solution for SMEs, realized it quickly and migrated to GitLab’s DevOps Platform to accelerate their deployment process.\nWe spoke with Pouya Lotfi, the co-founder of QPage, to see how they use GitLab at QPage and how it has helped the company.\nWhy GitLab?\nQPage was initially using a local bespoke CI/CD for about the first two months, but they soon realized they needed a more professional DevOps Platform system. Because Pouya and the team at QPage had already used GitLab at a previous employer, they knew it would be the right fit. So, they didn’t consider other options and opted for GitLab straight away.\nEverything you …",
          "link": "https://about.gitlab.com/blog/2021/09/15/qpage-on-the-devops-platform/",
          "publishedOn": "2021-09-15T00:00:00.000Z",
          "wordCount": 2248,
          "title": "How QPage achieved automatic deployment and efficiency using the GitLab DevOps Platform"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/09/14/gitlab-together-with-terratag-open-source-to-help-you-manage-terraform-resources/",
          "author": null,
          "description": "When using infrastructure as code (IaC) on a public cloud provider, it's important to use tags and labels to organize your IaC using their complementary services. Terratag, an open source project developed by env0, can be used with Terraform and placed on top of the GitLab CI/CD platform, making tagging and labeling IaC easier and more efficient.\nGitLab and Terraform make it easy to tag and label infrastructure as code.\nInside your toolbox\nGitLab the industry's leading DevOps platform. Not long ago, we announced the ability to control Terraform deployments, remote state management, private module registry, and merge request integration for Terraform. This gives users a range of solutions for running CI/CD for Terraform code and managing it on a large scale.\nTerraform is the most widely ado…",
          "link": "https://about.gitlab.com/blog/2021/09/14/gitlab-together-with-terratag-open-source-to-help-you-manage-terraform-resources/",
          "publishedOn": "2021-09-14T00:00:00.000Z",
          "wordCount": 3831,
          "title": "How to use Terratag to automatically manage tags and labels for your Terraform Code"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/09/13/lessons-weet-learned-lokalise/",
          "author": null,
          "description": "As a GitLab customer, Weet has fully invested in the premise of \"Iterate faster, innovate together.\" Weet has a low tolerance for processes that don't keep pace with the way they develop and launch. One important process that was slowing the business down – localizing their app.\nLocalization is a key way to drive growth and accelerate product adoption. When done poorly, localization or l10n, as it's commonly known, can slow down your development process, introduce bugs, and make it cumbersome to launch updates. When done right, teams can smooth out the process and continuously localize their app. We unpack how Weet conquered its localization problems using GitLab and Lokalise.\nWhat is Weet?\nWeet is an asynchronous video communication tool designed to reduce the need for meetings. By combin…",
          "link": "https://about.gitlab.com/blog/2021/09/13/lessons-weet-learned-lokalise/",
          "publishedOn": "2021-09-13T00:00:00.000Z",
          "wordCount": 2863,
          "title": "How Weet integrates localization into the GitLab pipeline with Lokalise"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/09/10/setting-up-the-k-agent/",
          "author": null,
          "description": "The GitLab Kubernetes Agent (agentk) is an active in-cluster component for solving GitLab and Kubernetes integration tasks in a secure and cloud native way. The agentk communicates to the GitLab Kubernetes Agent Server (kas) to perform GitOps operations.\nIn many examples, we see the agent being deployed with global-level permissions on your cluster. There are use cases where we want to reduce the scope of what agentk has access to. In this guide I will provide information on deploying agentk on your cluster, limiting what namespaces it can access, as well as using it to deploy your applications.\nPrefer a video? Watch the walkthrough below to learn how to deploy agentk to your cluster:\n\n\nHow it works\nAnytime a developer performs changes to a manifest file managed within GitLab, the agentk w…",
          "link": "https://about.gitlab.com/blog/2021/09/10/setting-up-the-k-agent/",
          "publishedOn": "2021-09-10T00:00:00.000Z",
          "wordCount": 4011,
          "title": "How to deploy the GitLab Kubernetes Agent with limited permissions"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/09/10/adopt-agile-and-devops-for-ibm-z/",
          "author": null,
          "description": "As more organizations adopt open source software, DevOps and cloud computing, teams are moving towards a hybrid approach to application development and deployments. This is a particular challenge for siloed mainframe development teams that typically work within their own development tools – and those tools are are not the same ones used by their distributed developer counterparts. These disparate toolsets are not integrated between build, package, test, and deploy steps. GitLab aims to provide a unified enterprise-wide DevOps platform with enhanced support for IBM z/OS® applications. Here are three critical areas to focus on that can help bridge the gap between mainframe and \"modern\" DevOps development.\nCommon workflows for hybrid environments\nDevOps is naturally aligned to Agile processes…",
          "link": "https://about.gitlab.com/blog/2021/09/10/adopt-agile-and-devops-for-ibm-z/",
          "publishedOn": "2021-09-10T00:00:00.000Z",
          "wordCount": 2347,
          "title": "The benefits of DevOps practices for IBM Z"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/09/09/5-code-review-features/",
          "author": null,
          "description": "This is the second in a series of blog posts looking at the challenges of code review and the ways a DevOps platform can help. Read the first post.\nCode review can be one of the most deceivingly difficult things in delivering software faster. Given the high stakes involved, we've made some key additions to our DevOps Platform that focus on making the code review process as seamless and effective as possible. We believe the number one way to make code reviews effective is to provide context. Too often we think of code reviews as only \"reading\" and commenting on others' code - but what a good code reviewer does is understand the entire context of the proposed change. Context-driven code reviews should include factors like the issue that spurred on the change, how the change impacts non-obvio…",
          "link": "https://about.gitlab.com/blog/2021/09/09/5-code-review-features/",
          "publishedOn": "2021-09-09T00:00:00.000Z",
          "wordCount": 2687,
          "title": "How GitLab's 5 new code review features will make life easier"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/09/08/making-the-case-for-a-devops-platform-what-data-and-customers-say/",
          "author": null,
          "description": "In the struggle to release safer software faster, development teams are increasingly choosing a DevOps platform to help them get there. In our 2021 Global DevSecOps Survey we asked respondents what their DevOps practices included and a \"DevOps platform\" was among the top four choices, right next to CI/CD, test automation, and DevSecOps.\nWe're of course bullish on the idea of a DevOps platform, but we're far from alone. Here's a fresh look at how the data – and the customers – support the optimistic trajectory of a DevOps platform.\nDevOps is hot\nThe DevOps market was worth $6 billion in 2020, according to Global Industry Analysts, and five-year growth forecasts range from $17 billion to as much as $23 billion, depending on the firm. \n[Watch a deep dive into GitLab's DevOps Platform]\nThis pr…",
          "link": "https://about.gitlab.com/blog/2021/09/08/making-the-case-for-a-devops-platform-what-data-and-customers-say/",
          "publishedOn": "2021-09-08T00:00:00.000Z",
          "wordCount": 2118,
          "title": "Making the case for a DevOps platform: What data and customers say"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/09/08/write-vulnerability-detection-rules/",
          "author": null,
          "description": "In summer 2021, the Vulnerability Research and Static Analysis\nteams launched the Google Summer of Code (GSoC) project: Write vulnerability detection rules for SAST.\nFor this project, we built and implemented a framework to helps transition GitLab away from our current SAST tools over to Semgrep. Semgrep is a language-agnostic SAST tool that is gaining popularity in CI/CD environments.\nBefore replacing an analyzer with the corresponding Semgrep configuration (called rule-sets), we need to ensure that they are equivalent – in that they yield the same set of findings.\nFor this purpose, we built a testing framework that helps us assess the quality of a Semgrep rule-set. This framework has been used to guide the replacement of flawfinder, a C/C++ analyzer with a corresponding Semgrep rule-set.…",
          "link": "https://about.gitlab.com/blog/2021/09/08/write-vulnerability-detection-rules/",
          "publishedOn": "2021-09-08T00:00:00.000Z",
          "wordCount": 5397,
          "title": "How to write and continuously test vulnerability detection rules for SAST"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/09/07/why-are-developers-vulnerable-to-driveby-attacks/",
          "author": null,
          "description": "As someone who spends a lot of time working with computers, I know how easy it is to grow over-confident with regards to security. My systems are patched, my firewall rules are tight, and I’m vigilant when it comes to just about anything that looks out of the ordinary.\nNo one’s hacking their way into my workstation, that’s for sure.\nBut my experience working as a hacker myself has shown me that the opposite is often true. Those of us who are more technical are often much more vulnerable to an attack due to the complexity of our working environments.\nIn this blog, we’re going to dive into the anatomy of something called a “drive-by attack,” where malicious code hidden within a website uses your own browser to attack your computer.\nAs an example, I’ll show you how our own Red Team was able t…",
          "link": "https://about.gitlab.com/blog/2021/09/07/why-are-developers-vulnerable-to-driveby-attacks/",
          "publishedOn": "2021-09-07T00:00:00.000Z",
          "wordCount": 6125,
          "title": "Why are developers so vulnerable to drive-by attacks?"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/09/03/the-code-review-struggle-is-real-heres-what-you-need-to-know/",
          "author": null,
          "description": "When making a list of the reasons to consider moving to a DevOps Platform, don't forget about code review, a critical piece of the process that's also an incredible source of frustration and delays to developers and their teams.\nIn our 2021 Global DevSecOps Survey, respondents told us code quality was the number one reason they chose DevOps. But, when asked what was most likely to delay a product release, code review – vital to code quality – was one of the top four culprits (the others were testing, planning and code development). \nThe fact that code review is a pain point is hardly surprising, given that it can often require context-switching, communication, collaboration, and of course subject matter expertise. At a time when it's never been more urgent to release secure code as quickly…",
          "link": "https://about.gitlab.com/blog/2021/09/03/the-code-review-struggle-is-real-heres-what-you-need-to-know/",
          "publishedOn": "2021-09-03T00:00:00.000Z",
          "wordCount": 2296,
          "title": "The code review struggle is real. Here's what you need to know"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/09/02/the-journey-to-a-devops-platform/",
          "author": null,
          "description": "In a recent blog post about the importance of a DevOps Platform, GitLab CEO Sid Sijbrandij outlined four phases through which organizations frequently travel as their practice matures. It’s a painful journey we see again and again when we meet new customers. It spans every industry and every company size, and it’s the most mature DevOps teams with the most at stake who’ve felt the most pain. \nHistorically, if you wanted DevOps to work, you had to be prepared to pay for it. Just managing the backbone of DevOps – the toolchain -– has been a grind. Your “Jenkins Team,” your “GitHub Team,” or even, as one of our customers described, your “Duct Tape Team” (designed to hold it all together and patch holes), added no end value beyond keeping everything from falling apart. That’s a lot of investme…",
          "link": "https://about.gitlab.com/blog/2021/09/02/the-journey-to-a-devops-platform/",
          "publishedOn": "2021-09-02T00:00:00.000Z",
          "wordCount": 2119,
          "title": "The journey to a DevOps Platform"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/09/02/specialized-sidekiq-configuration-lessons-from-gitlab-dot-com/",
          "author": null,
          "description": "Sidekiq in GitLab works perfectly well out-of-the-box in most use cases, but it requires a little more attention in larger deployments or other specialized cases. We've learned a lot about how to configure Sidekiq in large deployments by maintaining GitLab.com – one of the largest instances of GitLab in existence. We added some critical features to GitLab.com in the past year to make it easier to configure Sidekiq in a manner more consistent with the maintainer's guidance, having strayed from this path for some time.\nWe are publishing two blog posts devoted to this topic. In this first post, we will unpack how we configured Sidekiq for GitLab.com, and in our second post, we will explain how to apply this to your GitLab instance.\n[Learn more about how we iterated on Sidekiq background jobs]…",
          "link": "https://about.gitlab.com/blog/2021/09/02/specialized-sidekiq-configuration-lessons-from-gitlab-dot-com/",
          "publishedOn": "2021-09-02T00:00:00.000Z",
          "wordCount": 5324,
          "title": "What we learned about configuring Sidekiq from GitLab.com"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/09/02/gitlab-13-12-11-released/",
          "author": null,
          "description": "Today we are releasing version 13.12.11 for GitLab Community Edition and Enterprise Edition.\nThis version resolves a number of regressions and bugs in\nthe 13.12 release and\nprior versions.\nGitLab Community Edition and Enterprise Edition\nThe main purpose of this release is to resolve high CPU usage by the Gitaly\nserver:\nOnly activate Git pack-objects hook if cache is enabled\nBackport improved replication logic\nImportant notes on upgrading\nThis version does not include any new migrations, and for multi-node deployments, should not require any downtime.\nPlease be aware that by default the Omnibus packages will stop, run migrations,\nand start again, no matter how “big” or “small” the upgrade is. This behavior\ncan be changed by adding a /etc/gitlab/skip-auto-reconfigure file,\nwhich is only used for updates.\nUpdating\nTo update, check out our update page.\nGitLab subscriptions\nAccess to GitLab Premium and Ultimate features is granted by a paid subscription.\nAlternatively, sign up for GitLab.com\nto use GitLab's own infrastructure.",
          "link": "https://about.gitlab.com/releases/2021/09/02/gitlab-13-12-11-released/",
          "publishedOn": "2021-09-02T00:00:00.000Z",
          "wordCount": 1021,
          "title": "GitLab Patch Release: 13.12.11"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/09/02/gitlab-14-0-10-released/",
          "author": null,
          "description": "Today we are releasing versions 14.0.10 and 14.1.5 for GitLab Community Edition and Enterprise Edition.\nThese versions resolve a number of regressions and bugs in the\n14.0 and\n14.1 releases.\nGitLab Community Edition and Enterprise Edition\nThe main purpose of these two releases is to resolve high CPU usage by the\nGitaly server:\nOnly activate Git pack-objects hook if cache is enabled\nBackport improved replication logic\nAdditionally, 14.1.5 includes the following fixes:\nGeo: Replicate multi-arch containers\nRun AWS Release rake task only if on latest stable tag\nImportant notes on upgrading\nThese versions do not include any new migrations, and for multi-node deployments, should not require any downtime.\nPlease be aware that by default the Omnibus packages will stop, run migrations,\nand start again, no matter how “big” or “small” the upgrade is. This behavior\ncan be changed by adding a /etc/gitlab/skip-auto-reconfigure file,\nwhich is only used for updates.\nUpdating\nTo update, check out our update page.\nGitLab subscriptions\nAccess to GitLab Premium and Ultimate features is granted by a paid subscription.\nAlternatively, sign up for GitLab.com\nto use GitLab's own infrastructure.",
          "link": "https://about.gitlab.com/releases/2021/09/02/gitlab-14-0-10-released/",
          "publishedOn": "2021-09-02T00:00:00.000Z",
          "wordCount": 1048,
          "title": "GitLab Patch Release: 14.0.10 and 14.1.5"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/09/01/gsoc-at-gitlab/",
          "author": null,
          "description": "GitLab participated in Google Summer of Code for the first time this year. We hosted four student interns to work with us on four different projects under the supervision of two or three mentors each.\nFor the past 16 years, Google has hosted the Summer of Code to introduce students to the world of open source. Over the summer, student interns work on a project with an open source organization and are closely mentored by the developers of the open source project. More than 200 organizations participated this year.\nWe started off the summer with a two-week long community bonding period to get our students familiar with how we work at GitLab and helped them set-up their local development environments. During the 10-week program we worked through scoped projects with regular check-ins and a fi…",
          "link": "https://about.gitlab.com/blog/2021/09/01/gsoc-at-gitlab/",
          "publishedOn": "2021-09-01T00:00:00.000Z",
          "wordCount": 2691,
          "title": "Google Summer of Code at GitLab – some intern highlights"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/09/01/gitlab-14-2-3-released/",
          "author": null,
          "description": "Today we are releasing version 14.2.3 for GitLab Community Edition and Enterprise Edition.\nThis version resolves a number of regressions and bugs in\nlast month's 14.2 release and\nprior versions.\nGitLab Community Edition and Enterprise Edition\nAvailable in GitLab Free, Premium, and Ultimate:\nGeo: Replicate multi-arch containers\nReset severity_levels default\nCreate 14.2 In-app top 7 product highlights\nFix OrphanedInviteTokensCleanup migration\nFix Live Markdown Preview in personal and subgroup projects\nDowngrade grpc from 1.38.0 to 1.30.2 for compatibility with older CPUs\nRestore proper contents to toolbox ubi8 image\nOnly activate Git pack-objects hook if cache is enabled\nImportant notes on upgrading\nThis version does include post deploy db migrations. For multi-node deployments, it should not require any downtime.\nPlease be aware that by default the Omnibus packages will stop, run migrations,\nand start again, no matter how “big” or “small” the upgrade is. This behavior\ncan be changed by adding a /etc/gitlab/skip-auto-reconfigure file,\nwhich is only used for updates.\nUpdating\nTo update, check out our update page.\nGitLab subscriptions\nAccess to GitLab Premium and Ultimate features is granted by a paid subscription.\nAlternatively, sign up for GitLab.com\nto use GitLab's own infrastructure.",
          "link": "https://about.gitlab.com/releases/2021/09/01/gitlab-14-2-3-released/",
          "publishedOn": "2021-09-01T00:00:00.000Z",
          "wordCount": 1062,
          "title": "GitLab Patch Release: 14.2.3"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/08/31/security-release-gitlab-14-2-2-released/",
          "author": null,
          "description": "Today we are releasing versions 14.2.2, 14.1.4, and 14.0.9 for GitLab Community Edition (CE) and Enterprise Edition (EE).\nThese versions contain important security fixes, and we strongly recommend that all GitLab installations be upgraded to one of these versions immediately.\nGitLab releases patches for vulnerabilities in dedicated security releases. There are two types of security releases: a monthly, scheduled security release, released a week after the feature release (which deploys on the 22nd of each month), and ad-hoc security releases for critical vulnerabilities. For more information, you can visit our security FAQ. You can see all of our regular and security release blog posts here. In addition, the issues detailing each vulnerability are made public on our issue tracker 30 days a…",
          "link": "https://about.gitlab.com/releases/2021/08/31/security-release-gitlab-14-2-2-released/",
          "publishedOn": "2021-08-31T00:00:00.000Z",
          "wordCount": 2076,
          "title": "GitLab Security Release: 14.2.2, 14.1.4, and 14.0.9"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/08/30/secure-pipeline-with-single-sign-in/",
          "author": null,
          "description": "If there is one thing that recent cyberattacks at companies such as SolarWinds, Codecov, and Kaseya have taught us, it's that software build pipelines are being targeted for attacks more than ever before. Hackers are no longer just attacking the bits and bytes of source code that go into our products, but also the development, testing, and build infrastructure tools that are used to build these products.\nEven if you believe your company is at low risk of an attack, it's also important to think about your customers. Businesses with high profile customers – like government agencies or large, multinational corporations that use your products – might have attackers target them by hacking your company, or more specifically, the software you provide them.\nThe incidents at Solarwinds, Codecov, an…",
          "link": "https://about.gitlab.com/blog/2021/08/30/secure-pipeline-with-single-sign-in/",
          "publishedOn": "2021-08-30T00:00:00.000Z",
          "wordCount": 2789,
          "title": "How to secure your software build pipeline using code signing"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/08/26/its-time-to-upgrade-docker-engine/",
          "author": null,
          "description": "Alpine Linux distribution is the base OS used by many Linux container images. It provides a handy packaging mechanism, new versions of software, and a quick and predictable release cycle – all while being distributed using a minimal image size. It's used by many very popular container images, for example docker:dind,\nwidely used in GitLab CI/CD workloads handling container\nimages building and management in the jobs.\nOn June 15, 2021, Alpine Linux released version 3.14. As documented in the release notes, changes in the musl library require\nan updated version of runc or updated version of\nDocker for the Alpine 3.14-based images to work properly.\nSoftware products across the computer industry have started migrating their Alpine Linux-based container images to 3.14 since it includes significa…",
          "link": "https://about.gitlab.com/blog/2021/08/26/its-time-to-upgrade-docker-engine/",
          "publishedOn": "2021-08-26T00:00:00.000Z",
          "wordCount": 2608,
          "title": "It's time to update Docker Engine"
        },
        {
          "id": "https://about.gitlab.com/releases/2021/08/26/gitlab-14-0-8-released/",
          "author": null,
          "description": "Today we are releasing version 14.0.8 for GitLab Community Edition and Enterprise Edition.\nThis version resolves a number of regressions and bugs in\nthe 14.0 release and\nprior versions.\nGitLab Community Edition and Enterprise Edition\nRevert backfill on ci_build_trace_sections\nResolve \"operator does not exist: integer[] || bigint in app/models/namespace/traversal_hierarchy.rb\"\nFix Sidekiq workers delete each other's metrics\nGeo 2.0 Regression - Add ability to remove primary\nBackport fix for flaky spec to 14.0\nImportant notes on upgrading\nThis version includes a post deploy migration. For multi-node deployments, it should not require any downtime.\nPlease be aware that by default the Omnibus packages will stop, run migrations,\nand start again, no matter how “big” or “small” the upgrade is. This behavior\ncan be changed by adding a /etc/gitlab/skip-auto-reconfigure file,\nwhich is only used for updates.\nUpdating\nTo update, check out our update page.\nGitLab subscriptions\nAccess to GitLab Premium and Ultimate features is granted by a paid subscription.\nAlternatively, sign up for GitLab.com\nto use GitLab's own infrastructure.",
          "link": "https://about.gitlab.com/releases/2021/08/26/gitlab-14-0-8-released/",
          "publishedOn": "2021-08-26T00:00:00.000Z",
          "wordCount": 1018,
          "title": "GitLab Patch Release: 14.0.8"
        },
        {
          "id": "https://about.gitlab.com/blog/2021/08/24/stageless-pipelines/",
          "author": null,
          "description": "GitLab CI/CD technology has historically divided a pipeline into stages based on the typical development workflow. Now that GitLab 14.2 has launched, users can speed up cycle times by using the needs command to write a complete CI/CD pipeline with every job in the single stage. In fact, you can omit stages completely and have a \"stageless\" pipeline that executes entirely based on the needs dependencies.\nUnderstanding stages\nIn GitLab CI/CD, you use stages to group jobs based on the development workflow and control the order of execution for CI/CD jobs.\nPipelines execute each stage in order, where all jobs in a single stage run in parallel. After a stage completes, the pipeline moves on to execute the next stage and runs those jobs, and the process continues like this until the pipeline com…",
          "link": "https://about.gitlab.com/blog/2021/08/24/stageless-pipelines/",
          "publishedOn": "2021-08-24T00:00:00.000Z",
          "wordCount": 2146,
          "title": "Write a stageless CI/CD pipeline using GitLab 14.2"
        }
      ]
    },
    {
      "title": "Phoronix",
      "feedUrl": "https://www.phoronix.com/rss.php",
      "siteUrl": "https://www.phoronix.com/",
      "articles": [
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Microsoft-Mesa-EGL-Windows",
          "author": null,
          "description": "While Microsoft has long had WGL as an API analogous to EGL for residing between OpenGL and the Windows interfaces, Microsoft has now wired up an EGL implementation for Mesa that works on Windows...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Microsoft-Mesa-EGL-Windows",
          "publishedOn": "2021-09-15T22:14:15.000Z",
          "wordCount": 843,
          "title": "Microsoft Adds An EGL Implementation To Mesa For Windows"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Apple-AGX-XDC2021",
          "author": null,
          "description": "Alyssa Rosenzweig spoke today at the virtual X.Org Developers Conference about the ongoing work for bringing up Linux display and graphics support on the Apple M1 graphics processor...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Apple-AGX-XDC2021",
          "publishedOn": "2021-09-15T18:11:25.000Z",
          "wordCount": 783,
          "title": "Reverse Engineering, Open-Source Driver Writing Continues For Apple's M1 GPU"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Radeon-Pro-Software-21.Q3",
          "author": null,
          "description": "AMD today released their quarterly update to the Radeon Pro Software for Enterprise graphics driver package, which includes an updated Linux build as well...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Radeon-Pro-Software-21.Q3",
          "publishedOn": "2021-09-15T17:32:12.000Z",
          "wordCount": 798,
          "title": "Radeon Pro Software for Enterprise 21.Q3 Released For Linux"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=AMDGPU-Yellow-Carp-FW",
          "author": null,
          "description": "A small but important step forward is seeing AMD recently publishing their binary firmware files in advance of new GPU/APU launches for rounding out their Linux driver support stack...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=AMDGPU-Yellow-Carp-FW",
          "publishedOn": "2021-09-15T13:25:49.000Z",
          "wordCount": 996,
          "title": "AMD Publishes Initial Firmware For Yellow Carp APUs"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=V3DV-2021-Status",
          "author": null,
          "description": "Iago Toral of Igalia kicked off the first day of the virtual XDC2021 developer conference today by sharing a status update on V3DV as the open-source Mesa Vulkan driver most notably used for Raspberry Pi 4 and newer...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=V3DV-2021-Status",
          "publishedOn": "2021-09-15T12:07:23.000Z",
          "wordCount": 778,
          "title": "Raspberry Pi V3DV Driver Still Working On Vulkan 1.1 Conformance, More Performance"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Orange-BPF-Memory-Cache-BMC",
          "author": null,
          "description": "French telecommunications giant Orange has published \"BMC\" as the (e)BPF Memory Cache providing a cache focused on memcached usage within the Linux kernel...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Orange-BPF-Memory-Cache-BMC",
          "publishedOn": "2021-09-15T10:28:19.000Z",
          "wordCount": 766,
          "title": "Orange Publishes An In-Kernel eBPF-Powered Cache - Can Speed Up Memcached By ~18x"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=HP-OMEN-Linux-5.16",
          "author": null,
          "description": "HP's higher-end \"OMEN\" laptop series is set to see better support with the next kernel cycle...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=HP-OMEN-Linux-5.16",
          "publishedOn": "2021-09-15T10:08:37.000Z",
          "wordCount": 862,
          "title": "HP OMEN Laptops To Be Better Supported With Linux 5.16"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Tremont-Faster-GCC",
          "author": null,
          "description": "The GNU Compiler Collection has already supported Intel's Tremont cores as used by the low-power Jasper Lake platform. Now though coming to GCC are some optimizations to further enhance the performance when targeting the Tremont micro-architecture...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Tremont-Faster-GCC",
          "publishedOn": "2021-09-15T09:45:07.000Z",
          "wordCount": 780,
          "title": "New Intel Tremont Optimizations Heading To The GCC Compiler"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-21.3-RadeonSI-Lower-CPU",
          "author": null,
          "description": "Following portions of the merge request landing, the rest of the RadeonSI CPU-overhead-lowering work was just merged to Mesa 21.3...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-21.3-RadeonSI-Lower-CPU",
          "publishedOn": "2021-09-14T20:35:40.000Z",
          "wordCount": 787,
          "title": "RadeonSI Lands Big Batch Of Improvements To Lower CPU Overhead"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=oneAPI-Level-Zero-Loader-1.5",
          "author": null,
          "description": "Intel has released a new version of their loader for oneAPI Level Zero for loading the Level Zero software driver components...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=oneAPI-Level-Zero-Loader-1.5",
          "publishedOn": "2021-09-14T18:22:37.000Z",
          "wordCount": 828,
          "title": "oneAPI Level Zero Loader v1.5 Released With VPU Driver Recognition, Multi-Driver Support"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=OpenJDK-17-Java-17",
          "author": null,
          "description": "Java 17 has made it to general availability status today with a number of improvements...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=OpenJDK-17-Java-17",
          "publishedOn": "2021-09-14T17:48:18.000Z",
          "wordCount": 934,
          "title": "Java 17 / OpenJDK 17 Hits GA With Maturing Vector API, Removal Planned For Applet API"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30523",
          "author": null,
          "description": "While NVIDIA has been supporting Resizable BAR for a while now with their GeForce RTX 30 series graphics cards, for those exclusively using Linux it remains more of a challenge due to AIB partners generally not releasing any vBIOS updates for ReBAR support that can be easily applied under Linux. But if you do carry out an update -- such as under Windows -- the performance uplift can be worthwhile if using a game that can benefit from the support.",
          "link": "https://www.phoronix.com/vr.php?view=30523",
          "publishedOn": "2021-09-14T13:09:13.000Z",
          "wordCount": 948,
          "title": "NVIDIA RTX 30 Series Resizable BAR Support Continues Helping Performance On Linux"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-Seamless-Update",
          "author": null,
          "description": "\"Intel Seamless Update\" is a forthcoming feature for Intel platforms seemingly first being exposed by their new Linux kernel patches working on the functionality... Intel is working on being able to carry out system firmware upates such as UEFI updates but doing so at run-time and being able to avoid the reboot in the process...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Intel-Seamless-Update",
          "publishedOn": "2021-09-14T10:05:13.000Z",
          "wordCount": 854,
          "title": "Intel Seamless Update: Intel Preparing For System Firmware Updates Without The Reboot"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=libinput-1.19",
          "author": null,
          "description": "Libinput 1.19 is now available as the newest version of this Linux input handling library commonly used these days by both X.Org and Wayland desktops...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=libinput-1.19",
          "publishedOn": "2021-09-14T09:42:51.000Z",
          "wordCount": 765,
          "title": "Libinput 1.19 Released With Hold Gestures & High Resolution Wheel Scrolling"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-Raising-GCC",
          "author": null,
          "description": "While Linux 5.15-rc1 was released on Sunday with its many changes, landing on Monday was a late change to raise the baseline GCC version requirement for building the Linux kernel...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-Raising-GCC",
          "publishedOn": "2021-09-14T07:00:00.000Z",
          "wordCount": 938,
          "title": "Linux 5.15 Raises Its GCC Compiler Version Requirement"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-Vulkan-WSI-No-Wait-XWay",
          "author": null,
          "description": "Mesa 21.3 today landed a debug option that can help with the XWayland-based gaming performance around latency and for power management as well...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Mesa-Vulkan-WSI-No-Wait-XWay",
          "publishedOn": "2021-09-14T00:48:47.000Z",
          "wordCount": 886,
          "title": "Mesa Lands Option That Can Help XWayland-Based Gaming On The Steam Deck"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-RFC-x86-User-Interrupts",
          "author": null,
          "description": "In addition to the big Advanced Matrix Extensions support still being in flux and the kernel-side AMX code not yet being merged, another feature of next year's Xeon \"Sapphire Rapids\" that we are only now seeing in early published form for the Linux kernel is handling of x86 user interrupts...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-RFC-x86-User-Interrupts",
          "publishedOn": "2021-09-13T20:38:01.000Z",
          "wordCount": 939,
          "title": "Intel Posts Initial Code For x86 User Interrupts On Linux  - Shows Great Performance Potential"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=FUTEX2-v3-Patches",
          "author": null,
          "description": "While Linux 5.15 has many new features and improvements, one of the patch series we have been eager to see land is the work introducing the new FUTEX2 system call. FUTEX2 can help improve the performance of newer Windows games running on Linux via Wine / Steam Play's Proton by better matching the Windows kernel behavior, but while it didn't land for Linux 5.15, at least a new version of the patches were posted...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=FUTEX2-v3-Patches",
          "publishedOn": "2021-09-13T18:45:11.000Z",
          "wordCount": 794,
          "title": "FUTEX2 System Call Updated To Work On ARM"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Zink-September-Games",
          "author": null,
          "description": "After last month landing the Zink sub-allocator code for improved performance and also enabling OpenGL ES 3.2 support for Zink, lead developer Mike Blumenkrantz at Valve has been spending time this month working to get more games running on this OpenGL-over-Vulkan Mesa driver...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Zink-September-Games",
          "publishedOn": "2021-09-13T17:54:34.000Z",
          "wordCount": 782,
          "title": "Zink OpenGL-On-Vulkan Tackling Support For More Games"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=GDB-11.1-Released",
          "author": null,
          "description": "GDB 11.1 is now available as the latest feature update to the GNU Debugger...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=GDB-11.1-Released",
          "publishedOn": "2021-09-13T17:34:49.000Z",
          "wordCount": 705,
          "title": "GNU Debugger 11.1 Released With MTE Support, Core File Debugging For 64-bit Cygwin Apps"
        },
        {
          "id": "https://www.phoronix.com/vr.php?view=30519",
          "author": null,
          "description": "Feature development is over on the Linux 5.15 kernel with Linux 5.15-rc1 being issued. It's now on to testing and bug fixing over the next two months before the kernel is christened as stable. Here is our original Linux 5.15 feature overview about all of the big changes in this next kernel version.",
          "link": "https://www.phoronix.com/vr.php?view=30519",
          "publishedOn": "2021-09-13T13:16:01.000Z",
          "wordCount": 1170,
          "title": "Linux 5.15 Delivers Many Features With New NTFS Driver, In-Kernel SMB3 Server, New Hardware"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Ubuntu-18.04.6-LTS-Coming",
          "author": null,
          "description": "While Ubuntu 18.04.5 LTS shipped one year ago as the last planned point release to the \"Bionic Beaver\", an emergency issue is leading to Ubuntu 18.04.6 now being prepared...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Ubuntu-18.04.6-LTS-Coming",
          "publishedOn": "2021-09-13T12:56:17.000Z",
          "wordCount": 752,
          "title": "Ubuntu 18.04.6 LTS Special Being Prepared To Deal With Unbootable Media"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-PSF-Control-September",
          "author": null,
          "description": "Of all the great stuff for AMD in Linux 5.15, one of the patches still not having yet been mainlined is the control support around Predictive Store Forwarding (PSF) with Zen 3 processors. It's been six months since AMD published their security whitepaper around PSF while the Linux patch has yet to be mainlined while now it seems will be updated for a reduced focus on KVM usage...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-PSF-Control-September",
          "publishedOn": "2021-09-13T12:40:51.000Z",
          "wordCount": 1180,
          "title": "Still-Pending AMD PSF Control Patch To Be Retailored For KVM"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Accel-Drivers-2021-Discussion",
          "author": null,
          "description": "On and off for years has been talk of an accelerator subsystem for the Linux kernel considering that for now most AI training/inference accelerator drivers end up lodged within the \"char/misc\" area of the kernel. That accelerator subsystem discussion has been restarted with talks of having such a subsystem or moving those drivers within the GPU/DRM subsystem space...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Accel-Drivers-2021-Discussion",
          "publishedOn": "2021-09-13T09:57:14.000Z",
          "wordCount": 926,
          "title": "Linux Developers Talk Again About An Accelerator Subsystem - Or Moving Them Into The GPU/DRM Area"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-rc1",
          "author": null,
          "description": "As expected this evening the Linux 5.15-rc1 kernel was released to top off the two week merge window that saw many changes to the kernel...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-rc1",
          "publishedOn": "2021-09-13T00:22:40.000Z",
          "wordCount": 917,
          "title": "Linux 5.15-rc1 Brings New NTFS Driver, In-Kernel SMB3 Server, AMD Changes, Intel DG2"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-AMD",
          "author": null,
          "description": "While working on my usual Linux kernel feature overview that summarizes the many articles over the past two weeks outlining all of the new features and changes merged, one area that particularly stands out for Linux 5.15 are all of AMD's upstream contributions that happened to make it in this kernel. There is a lot of new enablement on the AMD side -- both for CPUs and Radeon graphics -- but also improving existing hardware support...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Linux-5.15-AMD",
          "publishedOn": "2021-09-12T18:00:00.000Z",
          "wordCount": 1317,
          "title": "Linux 5.15 Is A Very Exciting Kernel For AMD"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Apache-FY2021-Report",
          "author": null,
          "description": "The Apache Software Foundation recently published their FY2021 report for their year-ended 30 April. Even with the ongoing pandemic, the Apache Software Foundation managed to raise more than $3M USD and enjoyed a host of software successes...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Apache-FY2021-Report",
          "publishedOn": "2021-09-12T11:11:29.000Z",
          "wordCount": 945,
          "title": "Apache Software Foundation Saw $3M In Revenue, ~134M Changed Lines Of Code Last Year"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Folios-Pagesets-MIA-5.15",
          "author": null,
          "description": "We are now down to the last day of the Linux 5.15 merge window and one of the patch series we have been waiting to see if it would land during this two week period was the \"folios\" code -- or that also was recently renamed to \"pagesets\" to address some concerns over the name...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Folios-Pagesets-MIA-5.15",
          "publishedOn": "2021-09-12T10:20:03.000Z",
          "wordCount": 922,
          "title": "It's Looking Like Folios / Pagesets Might Miss Making It Into Linux 5.15"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=RISC-V-Better-Stack-Rand",
          "author": null,
          "description": "In addition to the RISC-V changes merged last week for the Linux 5.15 kernel, a second batch of patches was merged this weekend...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=RISC-V-Better-Stack-Rand",
          "publishedOn": "2021-09-12T10:04:52.000Z",
          "wordCount": 690,
          "title": "RISC-V Gets Expanded Stack Randomization With Linux 5.15"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Spectre-V2-V4-Going-Prctl-Def",
          "author": null,
          "description": "A change first proposed last year to the Linux kernel's Spectre mitigation defaults looks like it will soon be sent in for the mainline kernel...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Spectre-V2-V4-Going-Prctl-Def",
          "publishedOn": "2021-09-12T04:00:00.000Z",
          "wordCount": 1063,
          "title": "Linux Preparing To Slightly Loosen Its Spectre Defaults"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=Rust-Linux-Kernel-Linaro-2021",
          "author": null,
          "description": "While the Rust programming language support for usage within the kernel isn't landing for the Linux 5.15 merge window ending this weekend, that effort remains ongoing. A status update on the effort was shared this week about Rust usage for the Linux kernel...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=Rust-Linux-Kernel-Linaro-2021",
          "publishedOn": "2021-09-11T18:30:14.000Z",
          "wordCount": 748,
          "title": "The Latest Progress On Rust For The Linux Kernel"
        },
        {
          "id": "https://www.phoronix.com/scan.php?page=news_item&px=RadeonSI-More-For-Mesa-21.3",
          "author": null,
          "description": "Another batch of minor optimizations were merged to Mesa 21.3 for the RadeonSI Gallium3D driver...",
          "link": "https://www.phoronix.com/scan.php?page=news_item&px=RadeonSI-More-For-Mesa-21.3",
          "publishedOn": "2021-09-11T17:15:07.000Z",
          "wordCount": 844,
          "title": "Another Batch Of RadeonSI Optimizations Land In Mesa 21.3"
        }
      ]
    }
  ],
  "cliVersion": "1.11.0"
}